<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<TITLE>Quan ly bo nho</TITLE>
<META NAME="subject" CONTENT="OS">
</HEAD>
<BODY LINK="#0000ff" VLINK="#7f007f" background="images/barbkgde.gif">
<B><P ALIGN="CENTER"><font face="Verdana" color="#000080" size="2">B&Agrave;I 6 :</font><font color="#000080" face="Verdana" size="5">QU&#7842;N L&Yacute; B&#7896; NH&#7898;</font></P>
</B><I><P ALIGN="JUSTIFY"></P>
<blockquote>
<P ALIGN="JUSTIFY"><font color="#000066">B&agrave;i h&#7885;c n&agrave;y s&#7869; gi&uacute;p c&aacute;c b&#7841;n h&igrave;nh dung nh&#7919;ng v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; c&#7847;n quan tâm khi thi&#7871;t k&#7871; module qu&#7843;n lý b&#7897; nh&#7899; c&#7911;a H&#7879; &#273;i&#7873;u h</FONT>&agrave;nh . M&#7897;t s&#7889; m&ocirc; h&igrave;nh t&#7893; ch&#7913;c b&#7897; nh&#7899; c&#361;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c gi&#7899;i thi&#7879;u v&agrave; ph&acirc;n t&iacute;ch &#432;u, khuy&#7871;t <FONT FACE="Times New Roman">&#273;i&#7875;m &#273;&#7875; các b&#7841;n có th&#7875; hi&#7875;u</FONT> <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&aacute;ch th&#7913;c c&#7845;p ph&aacute;t v&agrave; thu h&#7891;i b&#7897; nh&#7899; di&#7877;n ra nh&#432; th&#7871; n&agrave;o</font></P>
<blockquote>

</I></blockquote>
</blockquote>
<P ALIGN="JUSTIFY"><font color="#000066">B&#7897; nh&#7899; ch&iacute;nh l&agrave; thi&#7871;t b&#7883; l&#432;u tr&#7919; duy nh&#7845;t th&ocirc;ng qua <FONT FACE="Times New Roman">&#273;ó CPU có th&#7875; trao &#273;&#7893;i thông tin v&#7899;i môi tr</FONT>&#432;&#7901;ng ngo&agrave;i, do v&#7853;y nhu c&#7847;u t&#7893; ch&#7913;c, qu&#7843;n l&yacute; b&#7897; nh&#7899; l&agrave; m&#7897;t trong nh&#7919;ng nhi&#7879;m v&#7909; tr&#7885;ng t&acirc;m h&agrave;ng <FONT FACE="Times New Roman">&#273;&#7847;u c&#7911;a h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh . B&#7897; nh&#7899; ch&iacute;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7893; ch&#7913;c nh&#432; m&#7897;t m&#7843;ng m&#7897;t chi&#7873;u c&aacute;c t&#7915; nh&#7899; (word), m&#7895;i t&#7915; nh&#7899; c&oacute; m&#7897;t <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; . Vi&#7879;c trao &#273;&#7893;i thông tin v&#7899;i môi tr</FONT>&#432;&#7901;ng ngo&agrave;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n th&ocirc;ng qua c&aacute;c thao t&aacute;c <FONT FACE="Times New Roman">&#273;&#7885;c ho&#7863;c ghi d&#7919; li&#7879;u v</FONT>&agrave;o m&#7897;t <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#7909; th&#7875; n</FONT>&agrave;o
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;ó trong b&#7897; nh&#7899;.</font> </P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066">H&#7847;u h&#7871;t c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh hi&#7879;n <FONT FACE="Times New Roman">&#273;&#7841;i &#273;&#7873;u cho phép ch&#7871; &#273;&#7897; &#273;a nhi&#7879;m nh&#7857;m nâng cao hi&#7879;u su&#7845;t s&#7917; d&#7909;ng CPU. Tuy nhi</FONT>&ecirc;n k&#7929; thu&#7853;t n&agrave;y l&#7841;i l&agrave;m n&#7843;y sinh nhu c&#7847;u chia s&#7867; b&#7897; nh&#7899; gi&#7919;a c&aacute;c ti&#7871;n tr&igrave;nh kh&aacute;c nhau . V&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; n&#7857;m &#7903; ch&#7895;&nbsp;: «&nbsp;&nbsp;</FONT><I>b&#7897; nh&#7899; th&igrave; h&#7919;u h&#7841;n v&agrave; c&aacute;c y&ecirc;u c&#7847;u b&#7897; nh&#7899; th&igrave; v&ocirc; h&#7841;n</I> ».</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ch&#7883;u tr&aacute;ch nhi&#7879;m c&#7845;p ph&aacute;t v&ugrave;ng nh&#7899; cho c&aacute;c ti&#7871;n tr&igrave;nh c&oacute; y&ecirc;u c&#7847;u. <FONT FACE="Times New Roman">&#272;&#7875; th&#7921;c hi&#7879;n t&#7889;t nhi&#7879;m v&#7909; n</FONT>&agrave;y, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#7847;n ph&#7843;i xem x&eacute;t nhi&#7873;u kh&iacute;a c&#7841;nh&nbsp;:</font> </P><blockquote>

<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">S&#7921; t&#432;&#417;ng &#7913;ng gi&#7919;a <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; </FONT><I>logic</I> v&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý (</FONT><I>physic</I>)&nbsp;</font></U><font color="#000066">:<B> </B>l&agrave;m c&aacute;ch n&agrave;o <FONT FACE="Times New Roman">&#273;&#7875; chuy&#7875;n &#273;&#7893;i m&#7897;t &#273;&#7883;a ch&#7881; t</FONT>&#432;&#7907;ng tr&#432;ng (symbolic) trong ch&#432;&#417;ng tr&igrave;nh th&agrave;nh m&#7897;t
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7883;a ch&#7881; th&#7921;c trong b&#7897; nh&#7899; chính?</font> </P>
</FONT><U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">Qu&#7843;n l&yacute; b&#7897; nh&#7899; v&#7853;t l&yacute;</font></U><font color="#000066">: l&agrave;m c&aacute;ch n&agrave;o <FONT FACE="Times New Roman">&#273;&#7875; m&#7903; r&#7897;ng b&#7897; nh&#7899; có s&#7861;n nh&#7857;m l</FONT>&#432;u tr&#7919; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c nhi&#7873;u ti&#7871;n tr&igrave;nh
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7891;ng th&#7901;i?</font></P>
</FONT><U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">Chia s&#7867; th&ocirc;ng tin</font></U><font color="#000066">: l&agrave;m th&#7871; n&agrave;o <FONT FACE="Times New Roman">&#273;&#7875; cho phép hai ti&#7871;n tr</FONT>&igrave;nh c&oacute; th&#7875; chia s&#7867; th&ocirc;ng tin trong b&#7897; nh&#7899;?</font> </P>
<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">B&#7843;o v&#7879;</font></U><font color="#000066">: l&agrave;m th&#7871; n&agrave;o <FONT FACE="Times New Roman">&#273;&#7875; ng&#259;n ch&#7863;n các ti&#7871;n tr</FONT>&igrave;nh x&acirc;m ph&#7841;m <FONT FACE="Times New Roman">&#273;&#7871;n v</FONT>&ugrave;ng nh&#7899; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh kh&aacute;c?</font></P>
</blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">C&aacute;c gi&#7843;i ph&aacute;p qu&#7843;n l&yacute; b&#7897; nh&#7899; ph&#7909; thu&#7897;c r&#7845;t nhi&#7873;u v&agrave;o <FONT FACE="Times New Roman">&#273;&#7863;c tính ph&#7847;n c&#7913;ng v</FONT>&agrave; tr&#7843;i qua nhi&#7873;u giai <FONT FACE="Times New Roman">&#273;o&#7841;n c&#7843;i ti&#7871;n &#273;&#7875; tr&#7903; th</FONT>&agrave;nh nh&#7919;ng gi&#7843;p ph&aacute;p kh&aacute; th&#7887;a <FONT FACE="Times New Roman">&#273;áng nh</FONT>&#432; hi&#7879;n nay.</font></P>

<B><P ALIGN="JUSTIFY">&nbsp;</P><P ALIGN="JUSTIFY"><font face="Verdana" size="5" color="#FF0000"><a name="boicanh">I.
B&#7889;i c&#7843;nh</a></font></P>

</B><P ALIGN="JUSTIFY"><font color="#000066">Th&ocirc;ng th&#432;&#7901;ng, m&#7897;t ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a nh</FONT>&#432; m&#7897;t t&#7853;p tin nh&#7883; ph&acirc;n c&oacute; th&#7875; x&#7917; l&yacute;. <FONT FACE="Times New Roman">&#272;&#7875; th&#7921;c hi&#7879;n ch</FONT>&#432;&#417;ng tr&igrave;nh, c&#7847;n n&#7841;p ch&#432;&#417;ng tr&igrave;nh va&ograve; b&#7897; nh&#7899; ch&iacute;nh, t&#7841;o l&#7853;p ti&#7871;n tr&igrave;nh t&#432;&#417;ng &#7913;ng
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7875; x&#7917; lý .</font> </P>
</FONT><I><P ALIGN="JUSTIFY"><font color="#000066"><b>H&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i nh&#7853;p h&#7879; th&#7889;ng</FONT> </b></font></I><font color="#000066"> l&agrave; t&#7853;p h&#7907;p c&aacute;c ch&#432;&#417;ng tr&igrave;nh tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a &#273;ang ch&#7901; &#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;&#7875; ti&#7871;n h</FONT>&agrave;nh x&#7917; l&yacute;.</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066">C&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; trong ch</FONT>&#432;&#417;ng tr&igrave;nh ngu&#7891;n l&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; t</FONT>&#432;&#7907;ng tr&#432;ng , v&igrave; th&#7871;, m&#7897;t ch&#432;&#417;ng tr&igrave;nh ph&#7843;i tr&#7843;i qua nhi&#7873;u giai <FONT FACE="Times New Roman">&#273;o&#7841;n x&#7917; lý &#273;&#7875; chuy&#7875;n &#273;&#7893;i các &#273;&#7883;a ch&#7881; n</FONT>&agrave;y th&agrave;nh c&aacute;c
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7883;a ch&#7881; tuy&#7879;t &#273;&#7889;i trong b&#7897; nh&#7899; chính.</font></P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066">C&oacute; th&#7875; th&#7921;c hi&#7879;n k&#7871;t bu&#7897;c c&aacute;c ch&#7881; th&#7883; v&agrave; d&#7919; li&#7879;u v&#7899;i c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; b&#7897; nh&#7899; v</FONT>&agrave;o m&#7897;t trong nh&#7919;ng th&#7901;i
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;i&#7875;m sau&nbsp;:</font></P><blockquote>
<blockquote>

</FONT><U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bullet.gif" width="12" height="14"></U>
<U>Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m bi</FONT>&ecirc;n d&#7883;ch</U></font><font color="#000066">: n&#7871;u t&#7841;i th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m bi</FONT>&ecirc;n d&#7883;ch, c&oacute; th&#7875; bi&#7871;t v&#7883; tr&iacute; m&agrave; ti&#7871;n tr&igrave;nh s&#7869; th&#432;&#7901;ng tr&uacute; trong b&#7897; nh&#7899;, tr&igrave;nh bi&ecirc;n d&#7883;ch c&oacute; th&#7875; ph&aacute;t sinh ngay m&atilde; v&#7899;i c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; tuy&#7879;t &#273;&#7889;i. Tuy nhi</FONT>&ecirc;n, n&#7871;u v&#7873; sau c&oacute; s&#7921; thay <FONT FACE="Times New Roman">&#273;&#7893;i v&#7883; trí th</FONT>&#432;&#7901;ng tr&uacute; l&uacute;c <FONT FACE="Times New Roman">&#273;&#7847;u c&#7911;a ch</FONT>&#432;&#417;ng tr&igrave;nh, c&#7847;n ph&#7843;i bi&ecirc;n d&#7883;ch l&#7841;i ch&#432;&#417;ng tr&igrave;nh.</font></P>
<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bullet.gif" width="12" height="14"> </U>
<U>Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m n&#7841;p</FONT> </U></font><font color="#000066">: n&#7871;u t&#7841;i th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m bi</FONT>&ecirc;n d&#7883;ch, ch&#432;a th&#7875; bi&#7871;t v&#7883; tr&iacute; m&agrave; ti&#7871;n tr&igrave;nh s&#7869; th&#432;&#7901;ng tr&uacute; trong b&#7897; nh&#7899;, tr&igrave;nh bi&ecirc;n d&#7883;ch c&#7847;n ph&aacute;t sinh m&atilde; t&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i (translatable). S&#7921; li</FONT>&ecirc;n k&#7871;t <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#273;</FONT>&#432;&#7907;c tr&igrave; ho&atilde;n <FONT FACE="Times New Roman">&#273;&#7871;n th&#7901;i &#273;i&#7875;m ch</FONT>&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o b&#7897; nh&#7899;, l&uacute;c n&agrave;y c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; </FONT>t&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i s&#7869; &#273;</FONT>&#432;&#7907;c chuy&#7875;n th&agrave;nh <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; tuy&#7879;t &#273;&#7889;i do &#273;</FONT>&atilde; bi&#7871;t v&#7883; tr&iacute; b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u l</FONT>&#432;u tr&#7919; ti&#7871;n tr&igrave;nh. Khi c&oacute; s&#7921; thay <FONT FACE="Times New Roman">&#273;&#7893;i v&#7883; trí l</FONT>&#432;u tr&#7919;, ch&#7881; c&#7847;n n&#7841;p l&#7841;i ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7875; tính toán l&#7841;i các &#273;&#7883;a ch&#7881; tuy&#7879;t &#273;&#7889;i, m</FONT>&agrave; kh&ocirc;ng c&#7847;n bi&ecirc;n d&#7883;ch l&#7841;i.</font></P>
<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bullet.gif" width="12" height="14">
Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m x&#7917; lý </FONT></font> </U><font color="#000066">: n&#7871;u c&oacute; nhu c&#7847;u di chuy&#7875;n ti&#7871;n tr&igrave;nh t&#7915; v&ugrave;ng nh&#7899; n&agrave;y sang v&ugrave;ng nh&#7899; kh&aacute;c trong qu&aacute; tr&igrave;nh ti&#7871;n tr&igrave;nh x&#7917; l&yacute;, th&igrave; th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m k&#7871;t bu&#7897;c &#273;&#7883;a ch&#7881; ph&#7843;i tr</FONT>&igrave; ho&atilde;n <FONT FACE="Times New Roman">&#273;&#7871;n t&#7853;n th&#7901;i &#273;i&#7875;m x&#7917; lý. &#272;&#7875; th&#7921;c hi&#7879;n k&#7871;t bu&#7897;c &#273;&#7883;a ch&#7881; v</FONT>&agrave;o th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m x&#7917; lý, c&#7847;n s&#7917; d&#7909;ng c</FONT>&#417; ch&#7871; ph&#7847;n c&#7913;ng
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7863;c bi&#7879;t.</font></P>
</FONT><B><P ALIGN="JUSTIFY">&nbsp;</P></blockquote>
</blockquote>

<P ALIGN="JUSTIFY"><font color="#FF0000" face="Verdana" size="5"><a name="khonggian">II. Kh&ocirc;ng gian
&#273;&#7883;a ch&#7881; v&agrave; kh&ocirc;ng gian v&#7853;t l&yacute;</a></font></P>

</B><P ALIGN="JUSTIFY"><font color="#000066">M&#7897;t trong nh&#7919;ng h&#432;&#7899;ng ti&#7871;p c&#7853;n trung t&acirc;m nh&#7857;m t&#7893; ch&#7913;c qu&#7843;n l&yacute; b&#7897; nh&#7899; m&#7897;t c&aacute;ch hi&#7879;u q&#7911;a l&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;a ra kh&aacute;i ni&#7879;m kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#273;</FONT>&#432;&#7907;c x&acirc;y d&#7921;ng tr&ecirc;n kh&ocirc;ng gian nh&#7899; v&#7853;t l&yacute;, vi&#7879;c t&aacute;ch r&#7901;i hai kh&ocirc;ng gian n&agrave;y gi&uacute;p h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh d&#7877; d&agrave;ng x&acirc;y d&#7921;ng c&aacute;c c&#417; ch&#7871; v&agrave; chi&#7871;n l&#432;&#7907;c qu&#7843;n l&yacute; b&#7897; nh&#7899; h&#7919;u hi&#7879;u&nbsp;:</font></P><blockquote>

<I><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bullet.gif" width="12" height="14">
<U> </U>&#272;&#7883;a ch&#7881; logic</font></FONT> </I><font color="#000066"> – c&ograve;n g&#7885;i l&agrave; <I><FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o</FONT> </I> , l&agrave; t&#7845;t c&#7843; c&aacute;c
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7883;a ch&#7881; do b&#7897; x&#7917; lý t&#7841;o ra.</font> </P>
<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bullet.gif" width="12" height="14">
<U> </U>&#272;&#7883;a ch&#7881; v&#7853;t lý</font></I></FONT>  <font color="#000066">  - l&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; th&#7921;c t&#7871; m</FONT>&agrave; tr&igrave;nh qu&#7843;n l&yacute; b&#7897; nh&#7899; nh&igrave;n th&#7845;y v&agrave; thao t&aacute;c.</font> </P>
<I><P ALIGN="JUSTIFY"><font color="#000066" FACE="Times New Roman"><img border="0" src="images/bullet.gif" width="12" height="14">
</font><font color="#000066">Kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881;
</FONT></font> </I><font color="#000066">– l&agrave; t&#7853;p h&#7907;p t&#7845;t c&#7843; c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o phát sinh b&#7903;i m&#7897;t ch</FONT>&#432;&#417;ng tr&igrave;nh.</font> </P>
<I><P ALIGN="JUSTIFY"><font color="#000066" FACE="Times New Roman"><img border="0" src="images/bullet.gif" width="12" height="14">
</font><font color="#000066">Kh&ocirc;ng gian v&#7853;t l&yacute;</font></I> <font color="#000066"> – l&agrave; t&#7853;p h&#7907;p t&#7845;t c&#7843; c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý t</FONT>&#432;&#417;ng &#7913;ng v&#7899;i c&aacute;c
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7883;a ch&#7881; &#7843;o.</font> </P>
</blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">&#272;&#7883;a ch&#7881; &#7843;o v</font></FONT><font color="#000066">&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý l</FONT>&agrave; nh&#432; nhau trong ph&#432;&#417;ng th&#7913;c k&#7871;t bu&#7897;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v</FONT>&agrave;o th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m bi</FONT>&ecirc;n d&#7883;ch c&#361;ng nh&#432; v&agrave;o th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m n&#7841;p. Nh</FONT>&#432;ng c&oacute; s&#7921; kh&aacute;c bi&#7879;t gi&#7919;a <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o v</FONT>&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý trong ph</FONT>&#432;&#417;ng th&#7913;c k&#7871;t bu&#7897;c v&agrave;o th&#7901;i
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;i&#7875;m x&#7917; lý.</font></P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066">MMU (<I>memory-management unit</I>) l&agrave; m&#7897;t c&#417; ch&#7871; ph&#7847;n c&#7913;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7875; th&#7921;c hi&#7879;n chuy&#7875;n &#273;&#7893;i &#273;&#7883;a ch&#7881; &#7843;o th</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý v</FONT>&agrave;o th&#7901;i
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;i&#7875;m x&#7917; lý.</font> </P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066">Ch&#432;&#417;ng tr&igrave;nh c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng ch&#7881; thao t&aacute;c tr&ecirc;n c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o, không bao gi&#7901; nh</FONT>&igrave;n th&#7845;y c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý . &#272;&#7883;a ch&#7881; th&#7853;t s&#7921; &#7913;ng v&#7899;i v&#7883; trí c&#7911;a d&#7919; li&#7879;u trong bô nh&#7899; ch&#7881; &#273;</FONT>&#432;&#7907;c x&aacute;c
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7883;nh khi th&#7921;c hi&#7879;n truy xu&#7845;t &#273;&#7871;n d&#7919; li&#7879;u.</font>

</FONT></P><P ALIGN="JUSTIFY">&nbsp;</P>


<B><P ALIGN="JUSTIFY"><font color="#FF0000" face="Verdana" size="5"><a name="lientuc">III. C&#7845;p ph&aacute;t li&ecirc;n t&#7909;c</a></font></P>

<P ALIGN="JUSTIFY"><font color="#000066"><a name="Linker_Loader"><img border="0" src="images/read_single.gif" width="15" height="12">
 </a>
</font><a name="Linker_Loader"><font color="#800000">III.1. M&ocirc; h&igrave;nh Linker_Loader</font></a></P><blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">&Yacute; t&#432;&#7903;ng </font> </B><font color="#000066">: Ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o m&#7897;t v&ugrave;ng nh&#7899; li&ecirc;n t&#7909;c <FONT FACE="Times New Roman">&#273;&#7911; l&#7899;n &#273;&#7875; ch&#7913;a to</FONT>&agrave;n b&#7897; ti&#7871;n tr&igrave;nh. T&#7841;i th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m bi</FONT>&ecirc;n d&#7883;ch c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; b</FONT>&ecirc;n trong ti&#7871;n tr&igrave;nh v&#7851;n l&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; t</FONT>&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i. T&#7841;i th&#7901;i &#273;i&#7875;m n&#7841;p, H&#7879; &#273;i&#7873;u h</FONT>&agrave;nh s&#7869; tr&#7843; v&#7873; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; b&#7855;t &#273;&#7847;u</FONT> n&#7841;p ti&#7871;n tr&igrave;nh, v&agrave; t&iacute;nh to&aacute;n <FONT FACE="Times New Roman">&#273;&#7875; chuy&#7875;n  các &#273;&#7883;a ch&#7881; t</FONT>&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i v&#7873; &#273;&#7883;a ch&#7881; tuy&#7879;t &#273;&#7889;i trong b&#7897; nh&#7899; v&#7853;t lý theo công th&#7913;c <B>&#273;&#7883;a ch&#7881; v&#7853;t lý = &#273;&#7883;a ch&#7881; b&#7855;t &#273;&#7847;u + &#273;&#7883;a ch&#7881; t</B></FONT><B>&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i</FONT></B>.</font></P>

<P ALIGN="center"><img border="0" src="images/linker_loader.gif" width="412" height="167"></P>
<B>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#7843;o lu&#7853;n:</font></B> </P>

<blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m k&#7871;t buôc &#273;&#7883;a ch&#7881; l</FONT>&agrave; th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m n&#7841;p, do v&#7853;y sau khi n&#7841;p khô</FONT>ng th&#7875; d&#7901;i chuy&#7875;n ti&#7871;n tr&igrave;nh trong b&#7897; nh&#7899; .</font></P>
<P ALIGN="JUSTIFY"> <font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
Kh&ocirc;ng c&oacute; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng ki&#7875;m soát &#273;&#7883;a ch&#7881; các ti&#7871;n tr</FONT>&igrave;nh truy c&#7853;p, do v&#7853;y kh&ocirc;ng c&oacute; s&#7921; b&#7843;o v&#7879;.</font> </P>
</blockquote>

<B>
</blockquote>
<P ALIGN="JUSTIFY"><font color="#800000"><a name="base"><img border="0" src="images/read_single.gif" width="15" height="12">
 III.2. M&ocirc; h&igrave;nh Base &amp;Bound</a></font></P>
 </B><blockquote>
<B>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18"></font><font color="#000066">&Yacute; t&#432;&#7903;ng </font> </B><font color="#000066">: Ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o m&#7897;t v&ugrave;ng nh&#7899; li&ecirc;n t&#7909;c <FONT FACE="Times New Roman">&#273;&#7911; l&#7899;n &#273;&#7875; ch&#7913;a to</FONT>&agrave;n b&#7897; ti&#7871;n tr&igrave;nh. T&#7841;i
</font><font color="#000066"> th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m bi</FONT>&ecirc;n d&#7883;ch c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; b</FONT>&ecirc;n trong ti&#7871;n tr&igrave;nh v&#7851;n l&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; t</FONT>&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i. Tuy nhi</FONT>&ecirc;n b&#7893; t&uacute;c v&agrave;o c&#7845;u tr&uacute;c ph&#7847;n c&#7913;ng c&#7911;a m&aacute;y t&iacute;nh m&#7897;t thanh ghi n&#7873;n (<I>base register</I>) v&agrave; m&#7897;t thanh ghi gi&#7899;i h&#7841;n (<I>bound register</I>). Khi m&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t v&ugrave;ng nh&#7899;, n&#7841;p v&agrave;o thanh ghi n&#7873;n <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; b&#7855;t &#273;&#7847;u c&#7911;a phân v</FONT>&ugrave;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh, v&agrave; n&#7841;p v&agrave;o thanh ghi gi&#7899;i h&#7841;n k&iacute;ch th&#432;&#7899;c c&#7911;a ti&#7871;n tr&igrave;nh. Sau <FONT FACE="Times New Roman">&#273;ó, m&#7895;i &#273;&#7883;a ch&#7881; b&#7897; nh&#7899; &#273;</FONT>&#432;&#7907;c ph&aacute;t sinh s&#7869; t&#7921; <FONT FACE="Times New Roman">&#273;&#7897;ng &#273;</FONT>&#432;&#7907;c c&#7897;ng v&#7899;i <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; ch&#7913;a trong thanh ghi n&#7873;n &#273;&#7875; cho ra &#273;&#7883;a ch&#7881; tuy&#7879;t &#273;&#7889;i</FONT> trong b&#7897; nh&#7899;, c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#361;ng &#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7889;i chi&#7871;u v&#7899;i thanh ghi gi&#7899;i h&#7841;n &#273;&#7875; b&#7843;o &#273;&#7843;m ti&#7871;n tr</FONT>&igrave;nh kh&ocirc;ng truy xu&#7845;t ngo&agrave;i ph&#7841;m vi ph&acirc;n v&ugrave;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p cho n&oacute;.</font></P>
<P ALIGN="center"><img border="0" src="images/baseandbound.gif" width="412" height="167"></P>
<P ALIGN="center"><img border="0" src="images/haithanhghi.gif" width="415" height="229"></P>
<P ALIGN="center"><b>Hai thanh ghi h&#7893; tr&#7907; chuy&#7875;n &#273;&#7893;i &#273;&#7883;a ch&#7881;</b></P>
</blockquote>
<blockquote>
<B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18"></font><font color="#000066">Th&#7843;o lu&#7853;n:</font></B> </P>
<blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
 M&#7897;t &#432;u <FONT FACE="Times New Roman">&#273;i&#7875;m c&#7911;a vi&#7879;c s&#7917; d&#7909;ng thanh ghi n&#7873;n l</FONT>&agrave; c&oacute; th&#7875; di chuy&#7875;n c&aacute;c ch&#432;&#417;ng tr&igrave;nh trong b&#7897; nh&#7899; sau khi ch&uacute;ng b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u x&#7917; lý, m&#7895;i khi ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c di chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7871;n m&#7897;t v&#7883; trí m&#7899;i, ch&#7881; c&#7847;n n&#7841;p l&#7841;i giá tr&#7883; cho thanh ghi n&#7873;n, các &#273;&#7883;a ch&#7881; tuy&#7879;t &#273;&#7889;i s&#7869; &#273;</FONT>&#432;&#7907;c ph&aacute;t sinh l&#7841;i m&agrave; kh&ocirc;ng c&#7847;n c&#7853;p nh&#7853;t c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; t</FONT>&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i trong ch</FONT>&#432;&#417;ng tr&igrave;nh</font></P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
 Ch&#7883;u <FONT FACE="Times New Roman">&#273;&#7921;ng hi&#7879;n t</FONT>&#432;&#7907;ng ph&acirc;n m&#7843;nh ngo&#7841;i vi( <I>external fragmentation </I>)&nbsp;: khi c&aacute;c ti&#7871;n tr&igrave;nh l&#7847;n l&#432;&#7907;t v&agrave;o v&agrave; ra kh&#7887;i h&#7879; th&#7889;ng, d&#7847;n d&#7847;n xu&#7845;t hi&#7879;n c&aacute;c khe h&#7903; gi&#7919;a c&aacute;c ti&#7871;n tr&igrave;nh. <FONT FACE="Times New Roman">&#272;ây l</FONT>&agrave; c&aacute;c khe h&#7903; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o ra do k&iacute;ch th&#432;&#7899;c c&#7911;a ti&#7871;n tr&igrave;nh m&#7899;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p nh&#7887; h&#417;n k&iacute;ch th&#432;&#7899;c v&ugrave;ng nh&#7899; m&#7899;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c gi&#7843;i ph&oacute;ng b&#7903;i m&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&atilde; k&#7871;t th&uacute;c v&agrave; ra kh&#7887;i h&#7879; th&#7889;ng. Hi&#7879;n t&#432;&#7907;ng n&agrave;y c&oacute; th&#7875; d&#7851;n <FONT FACE="Times New Roman">&#273;&#7871;n t</FONT>&igrave;nh hu&#7889;ng t&#7893;ng v&ugrave;ng nh&#7899; tr&#7889;ng <FONT FACE="Times New Roman">&#273;&#7911; &#273;&#7875; tho&#7843; m</FONT>&atilde;n y&ecirc;u c&#7847;u, nh&#432;ng c&aacute;c v&ugrave;ng nh&#7899; n&agrave;y l&#7841;i kh&ocirc;ng li&ecirc;n t&#7909;c&nbsp;! Ng&#432;&#7901;i ta c&oacute; th&#7875; &aacute;p d&#7909;ng k&#7929; thu&#7853;t «&nbsp;d&#7891;n b&#7897; nh&#7899;&nbsp;» (<I>memory compaction</I> ) <FONT FACE="Times New Roman">&#273;&#7875; k&#7871;t h&#7907;p các m&#7843;nh b&#7897; nh&#7899; nh&#7887; r&#7901;i r&#7841;c th</FONT>&agrave;nh m&#7897;t v&ugrave;ng nh&#7899; l&#7899;n li&ecirc;n t&#7909;c. Tuy nhi&ecirc;n, k&#7929; thu&#7853;t n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&ograve;i h&#7887;i nhi&#7873;u th&#7901;i gian x&#7917; l&yacute;, ngo&agrave;i ra, s&#7921; k&#7871;t bu&#7897;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; ph&#7843;i th&#7921;c hi&#7879;n v</FONT>&agrave;o th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m x&#7917; lý, v</FONT>&igrave; c&aacute;c ti&#7871;n tr&igrave;nh c&oacute; th&#7875; b&#7883; di chuy&#7875;n trong qu&aacute; tr&igrave;nh d&#7891;n b&#7897; nh&#7899;.</font></P>
<P ALIGN="center"><img border="0" src="images/phanmanh.jpg" width="530" height="200"></P>
<P ALIGN="center"><font color="#000066"><b>Phân m&#7843;nh ngo&#7841;i vi</b></font></P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
 V&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; n&#7843;y sinh khi kích th</FONT>&#432;&#7899;c c&#7911;a ti&#7871;n tr&igrave;nh t<FONT FACE="Times New Roman">&#259;ng tr</FONT>&#432;&#7903;ng trong q&uacute;a tr&igrave;nh x&#7917; l&yacute; m&agrave; kh&ocirc;ng c&ograve;n v&ugrave;ng nh&#7899; tr&#7889;ng g&#7847;n k&#7873; <FONT FACE="Times New Roman">&#273;&#7875; m&#7903; r&#7897;ng v</FONT>&ugrave;ng nh&#7899; cho ti&#7871;n tr&igrave;nh.  C&oacute; hai c&aacute;ch gi&#7843;i quy&#7871;t:</font></P><blockquote>

<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">D&#7901;i ch&#7895; ti&#7871;n tr&igrave;nh
</font> </U><font color="#000066">: di chuy&#7875;n ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7871;n m&#7897;t v</FONT>&ugrave;ng nh&#7899; kh&aacute;c <FONT FACE="Times New Roman">&#273;&#7911; l&#7899;n &#273;&#7875; th&#7887;a m</FONT>&atilde;n nhu c&#7847;u t<FONT FACE="Times New Roman">&#259;ng tr</FONT>&#432;&#7903;ng c&#7911;a ti&#7871;n tr&igrave;nh.</font></P>
<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">C&#7845;p ph&aacute;t d&#432; v&ugrave;ng nh&#7899; cho ti&#7871;n tr&igrave;nh :</font></U> <font color="#000066"> c&#7845;p ph&aacute;t d&#7921; ph&ograve;ng cho ti&#7871;n tr&igrave;nh m&#7897;t v&ugrave;ng nh&#7899; l&#7899;n h&#417;n y&ecirc;u c&#7847;u ban <FONT FACE="Times New Roman">&#273;&#7847;u c&#7911;a ti&#7871;n tr</FONT>&igrave;nh.</font></P>
</blockquote>
</blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/caution.gif" width="16" height="16">
M&#7897;t ti&#7871;n tr&igrave;nh c&#7847;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;&#7875; x&#7917; lý. Trong các ph</FONT>&#432;&#417;ng th&#7913;c t&#7893; ch&#7913;c tr&ecirc;n <FONT FACE="Times New Roman">&#273;ây, m&#7897;t ti&#7871;n tr</FONT>&igrave;nh lu&ocirc;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; trong b&#7897; nh&#7899; su&#7889;t qu&aacute; tr&igrave;nh x&#7917; l&yacute; c&#7911;a n&oacute;. Tuy nhi&ecirc;n, trong tr&#432;&#7901;ng h&#7907;p ti&#7871;n tr&igrave;nh b&#7883; kh&oacute;a, ho&#7863;c ti&#7871;n tr&igrave;nh s&#7917; d&#7909;ng h&#7871;t th&#7901;i gian CPU d&agrave;nh cho n&oacute;, n&oacute; c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chuy&#7875;n t&#7841;m th&#7901;i ra b&#7897; nh&#7899; ph&#7909; v&agrave; sau n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p tr&#7903; l&#7841;i v&agrave;o b&#7897; nh&#7899; ch&iacute;nh
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7875; ti&#7871;p t&#7909;c x&#7917; lý.</font> </P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/caution.gif" width="16" height="16">
C&aacute;c c&aacute;ch t&#7893; ch&#7913;c b&#7897; nh&#7899; tr&ecirc;n <FONT FACE="Times New Roman">&#273;ây &#273;&#7873;u ph&#7843;i ch&#7883;u &#273;&#7921;ng t</FONT>&igrave;nh tr&#7841;ng b&#7897; nh&#7899; b&#7883; ph&acirc;n m&#7843;nh v&igrave; ch&uacute;ng <FONT FACE="Times New Roman">&#273;&#7873;u ti&#7871;p c&#7853;n theo ki&#7875;u c&#7845;p phát m&#7897;t v</FONT>&ugrave;ng nh&#7899; li&ecirc;n t&#7909;c cho ti&#7871;n tr&igrave;nh. Nh&#432; <FONT FACE="Times New Roman">&#273;</FONT>&atilde; th&#7843;o lu&#7853;n, c&oacute; th&#7875; s&#7917; d&#7909;ng k&#7929; thu&#7853;t d&#7891;n b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;&#7875; lo&#7841;i b&#7887; s&#7921; phân m&#7843;nh ngo&#7841;i vi, nh</FONT>&#432;ng chi ph&iacute; th&#7921;c hi&#7879;n r&#7845;t cao. M&#7897;t gi&#7843;i ph&aacute;p kh&aacute;c h&#7919;u hi&#7879;u h&#417;n l&agrave; cho ph&eacute;p kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý c&#7911;a ti&#7871;n tr</FONT>&igrave;nh kh&ocirc;ng li&ecirc;n t&#7909;c, ngh&#297;a l&agrave; c&oacute; th&#7875; c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh nh&#7919;ng v&ugrave;ng nh&#7899; t&#7921; do b&#7845;t k&#7923;, kh&ocirc;ng c&#7847;n li&ecirc;n t&#7909;c.
</font> </P>
<B><P ALIGN="JUSTIFY">&nbsp;</P></blockquote>
<P ALIGN="JUSTIFY"><font face="Verdana" size="4" color="#FF0000"><a name="khonglientuc">IV. C&#7845;p ph&aacute;t kh&ocirc;ng li&ecirc;n t&#7909;c</a></font></P></B>
<B>

<P ALIGN="JUSTIFY"><font color="#000066"><a name="phandoan"><img border="0" src="images/read_single.gif" width="15" height="12"> 
</a> </font> <a name="phandoan"> <font color="#800000">IV.1. Ph&acirc;n
</font> <FONT FACE="Times New Roman"><font color="#800000">&#273;o&#7841;n  (Segmentation)</font>

</FONT></a></P>
<blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">&Yacute; t&#432;&#7903;ng</font></B><font color="#000066">: quan ni&#7879;m kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; l</FONT>&agrave; m&#7897;t t&#7853;p c&aacute;c <I>ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n (segments)
</FONT> </I>– c&aacute;c ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n l</FONT>&agrave; nh&#7919;ng ph&#7847;n b&#7897; nh&#7899;<EM> k&iacute;ch th&#432;&#7899;c kh&aacute;c nhau v&agrave; c&oacute; li&ecirc;n h&#7879; logic v&#7899;i nhau</EM>. M&#7895;i ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n có m&#7897;t t</FONT>&ecirc;n g&#7885;i (s&#7889; hi&#7879;u ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n) v</FONT>&agrave; m&#7897;t <FONT FACE="Times New Roman">&#273;&#7897; d</FONT>&agrave;i. Ng&#432;&#7901;i d&ugrave;ng s&#7869; thi&#7871;t l&#7853;p m&#7895;i <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7899;i hai giá tr&#7883;&nbsp;: </FONT><I>&lt;s&#7889; hi&#7879;u ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n</FONT></I>, <I>offset</I>&gt;.</font></P>

<P ALIGN="center"><img border="0" src="images/hinh4.17.gif" width="411" height="282"></P>

<P ALIGN="center"><font color="#000066"><b>Hình 4.17</b> Mô hình phân &#273;o&#7841;n
b&#7897; nh&#7899;</font></P>

<B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">C&#417; ch&#7871; MMU trong k&#7929; thu&#7853;t ph&acirc;n
</font><font color="#000066" FACE="Times New Roman">&#273;o&#7841;n:</font></B> </P>
<P ALIGN="JUSTIFY"><font color="#000066">C&#7847;n ph&#7843;i x&acirc;y d&#7921;ng m&#7897;t &aacute;nh x&#7841; <FONT FACE="Times New Roman">&#273;&#7875; chuy&#7875;n &#273;&#7893;i các &#273;&#7883;a ch&#7881; 2 chi&#7873;u &#273;</FONT>&#432;&#7907;c ng&#432;&#7901;i d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a t</FONT>h&agrave;nh <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý m&#7897;t chi&#7873;u. S&#7921; chuy&#7875;n &#273;&#7893;i n</FONT>&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n qua m&#7897;t <I>b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n</FONT></I>. M&#7895;i th&agrave;nh ph&#7847;n trong b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n bao g&#7891;m m&#7897;t </FONT><I>thanh ghi n&#7873;n</I> v&agrave; m&#7897;t <I>thanh ghi gi&#7899;i h&#7841;n</I>. Thanh ghi n&#7873;n l&#432;u tr&#7919; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý n</FONT>&#417;i b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u phân &#273;o&#7841;n trong b&#7897; nh&#7899;, trong </FONT>khi thanh ghi gi&#7899;i h&#7841;n <FONT FACE="Times New Roman">&#273;&#7863;c t&#7843; chi&#7873;u d</FONT>&agrave;i c&#7911;a ph&acirc;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;o&#7841;n.</font> </P>
</FONT><B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">Chuy&#7875;n
</font><font color="#000066" FACE="Times New Roman">&#273;&#7893;i &#273;&#7883;a ch&#7881;:</font></B> </P>
<P ALIGN="JUSTIFY"><font color="#000066">M&#7895;i <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o l</FONT>&agrave; m&#7897;t b&#7897;
</font> <I><font color="#000066">&lt;<B>s,d</B>&gt;&nbsp;:</font></P><blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
s&#7889; hi&#7879;u ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n s
</FONT></font> </I><font color="#000066">: <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng nh&#432; ch&#7881; m&#7909;c
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7871;n b&#7843;ng phân &#273;o&#7841;n</font></P>
<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
 &#273;&#7883;a ch&#7881; t</font></I></FONT><I><font color="#000066">&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i d
</FONT></font></I><font color="#000066">: c&oacute; gi&aacute; tr&#7883; trong kho&#7843;ng t&#7915;  0 <FONT FACE="Times New Roman">&#273;&#7871;n gi&#7899;i h&#7841;n chi&#7873;u d</FONT>&agrave;i c&#7911;a ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n. N&#7871;u &#273;&#7883;a ch&#7881; t</FONT>&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i h&#7907;p l&#7879;, nó s&#7869; &#273;</FONT>&#432;&#7907;c c&#7897;ng v&#7899;i gi&aacute; tr&#7883; ch&#7913;a trong thanh ghi n&#7873;n <FONT FACE="Times New Roman">&#273;&#7875; phát sinh &#273;&#7883;a ch&#7881; v&#7853;t lý t</FONT>&#432;&#417;ng &#7913;ng.</font></P><P ALIGN="center"><img border="0" src="images/hinh4.18.gif" width="446" height="266"></P>

<P ALIGN="center"><font color="#000066"><b>Hình 4.18</b> C&#417; ch&#7871; ph&#7847;n c&#7913;ng
h&#7893; tr&#7907; k&#297; thu&#7853;t phân &#273;o&#7841;n</font></P>

<P ALIGN="center"><img border="0" src="images/hinh4.19.gif" width="543" height="282"></P>

<P ALIGN="center"><font color="#000066"><b>Hình 4.19</b> H&#7879; th&#7889;ng phân &#273;o&#7841;n</font></P>

</blockquote>
</blockquote>

<B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">C&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t b&#7843;ng phân &#273;o&#7841;n</FONT></font></B><font color="#000066">:</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066">C&oacute; th&#7875; s&#7917; d&#7909;ng c&aacute;c thanh ghi <FONT FACE="Times New Roman">&#273;&#7875; l</FONT>&#432;u tr&#7919; b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n n&#7871;u s&#7889; l</FONT>&#432;&#7907;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n nh&#7887;. Trong t</FONT>r&#432;&#7901;ng h&#7907;p ch&#432;&#417;ng tr&igrave;nh bao g&#7891;m qu&aacute; nhi&#7873;u ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n, b&#7843;ng phân &#273;o&#7841;n ph&#7843;i &#273;</FONT>&#432;&#7907;c l&#432;u trong b&#7897; nh&#7899; ch&iacute;nh. M&#7897;t  <I>thanh ghi n&#7873;n b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n</FONT> </I> (STBR) ch&#7881; <FONT FACE="Times New Roman">&#273;&#7871;n &#273;&#7883;a ch&#7881; b&#7855;t &#273;&#7847;u c&#7911;a b&#7843;ng phân &#273;o&#7841;n. V</FONT>&igrave; s&#7889; l&#432;&#7907;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n s&#7917; d&#7909;ng trong m&#7897;t ch</FONT>&#432;&#417;ng tr&igrave;nh bi&#7871;n <FONT FACE="Times New Roman">&#273;&#7897;ng, c&#7847;n s&#7917;</FONT> d&#7909;ng th&ecirc;m m&#7897;t <I>thanh ghi <FONT FACE="Times New Roman">&#273;&#7863;c t&#7843; kích th</FONT>&#432;&#7899;c b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n</FONT> </I> (STLR).</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">V&#7899;i m&#7897;t <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; logic &lt;</FONT><I>s,d</I>&gt;, tr&#432;&#7899;c ti&ecirc;n s&#7889; hi&#7879;u ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n </FONT><I>s</I> <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ki&#7875;m tra t&iacute;nh h&#7907;p l&#7879; (s &lt;STLR). K&#7871; ti&#7871;p, c&#7897;ng gi&aacute; tr&#7883; s v&#7899;i STBR <FONT FACE="Times New Roman">&#273;&#7875; có &#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#273;&#7883;a ch&#7881; c&#7911;a ph&#7847;n t&#7917; th&#7913; </FONT><I>s</I> trong b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n (STBR+</FONT><I>s</I>). <FONT FACE="Times New Roman">&#272;i&#7841; ch&#7881; v&#7853;t lý cu&#7889;i c</FONT>&ugrave;ng l&agrave; (STBR+<I>s </I>+ <I>d</I>)</font></P>
<P ALIGN="center"><img border="0" src="images/hinh4.20.gif" width="425" height="233"></P>

<P ALIGN="center"><font color="#000066"><b>Hình 4.20</b> S&#7917; d&#7909;ng STBR, STLR
và b&#7843;ng phân &#273;o&#7841;n</font></P>

<B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">B&#7843;o v&#7879;</font></B><font color="#000066">: M&#7897;t &#432;u <FONT FACE="Times New Roman">&#273;i&#7875;m &#273;&#7863;c bi&#7879;t c&#7911;a c</FONT>&#417; ch&#7871; ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n l</FONT>&agrave; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng &#273;&#7863;c t&#7843; thu&#7897;c tính b&#7843;o v&#7879; cho m&#7895;i phân &#273;o&#7841;n. V</FONT>&igrave; m&#7895;i ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n bi&#7877;u di&#7877;n cho m&#7897;t ph&#7847;n c&#7911;a ch</FONT>&#432;&#417;ng tr&igrave;nh v&#7899;i ng&#7919; ngh&#297;a <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ng&#432;&#7901;i d&ugrave;ng x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh, ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng c&oacute; th&#7875; bi&#7871;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c m&#7897;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n ch&#7913;a &#273;&#7921;ng nh&#7919;ng g</FONT>&igrave; b&ecirc;n trong, do v&#7853;y h&#7885; c&oacute; th&#7875;
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7863;c t&#7843; các thu&#7897;c tính b&#7843;o v&#7879; thích h&#7907;p cho t&#7915;ng phân &#273;o&#7841;n.</font></P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066">C&#417; ch&#7871; ph&#7847;n c&#7913;ng ph&#7909; tr&aacute;ch chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i &#273;&#7883;a ch&#7881; b&#7897; nh&#7899; s&#7869; ki&#7875;m tra các bit b&#7843;o v&#7879; &#273;</FONT>&#432;&#7907;c g&aacute;n v&#7899;i m&#7895;i ph&#7847;n t&#7917; trong b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n &#273;&#7875; ng&#259;n ch&#7863;n các thao tác truy xu&#7845;t b&#7845;t h&#7907;p l&#7879; &#273;&#7871;n phân &#273;o&#7841;n t</FONT>&#432;&#417;ng &#7913;ng.</font></P>
<B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">Chia s&#7867; ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n</FONT></font></B><font color="#000066">: M&#7897;t &#432;u <FONT FACE="Times New Roman">&#273;i&#7875;m khác c&#7911;a k&#7929; thu&#7853;t phân &#273;o&#7841;n l</FONT>&agrave; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng chia s&#7867; &#7903; m&#7913;c &#273;&#7897; phân &#273;o&#7841;n. Nh&#7901; kh&#7843; n&#259;ng n</FONT>&agrave;y, c&aacute;c ti&#7871;n tr&igrave;nh c&oacute; th&#7875; chia s&#7867; v&#7899;i nhau t&#7915;ng ph&#7847;n ch&#432;&#417;ng tr&igrave;nh ( v&iacute; d&#7909; c&aacute;c th&#7911; t&#7909;c, h&agrave;m), kh&ocirc;ng nh&#7845;t thi&#7871;t ph&#7843;i chia s&#7867; to&agrave;n b&#7897; ch&#432;&#417;ng tr&igrave;nh nh&#432; tr&#432;&#7901;ng h&#7907;p ph&acirc;n trang. M&#7895;i ti&#7871;n tr&igrave;nh c&oacute; m&#7897;t b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n ri</FONT>&ecirc;ng, m&#7897;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n &#273;</FONT>&#432;&#7907;c chia s&#7867; khi c&aacute;c ph&#7847;n t&#7917; trong b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n c&#7911;a hai ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c nhau c&ugrave;ng ch&#7881;
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7871;n m&#7897;t v&#7883; trí v&#7853;t lý duy nh&#7845;t.</font> 
</FONT> </P>
<P ALIGN="center"><img border="0" src="images/hinh4.21.gif" width="431" height="283"> </P>
<P ALIGN="center"><font color="#000066"><b>Hình 4.21</b> Chia s&#7867; code trong h&#7879;
phân &#273;o&#7841;n</font> </P>
<B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#7843;o lu&#7853;n</font></B><font color="#000066">:</font></P><blockquote>

<P ALIGN="JUSTIFY"><I><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
</font> </I><font color="#000066">Ph&#7843;i gi&#7843;i quy&#7871;t v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; c&#7845;p phát &#273;&#7897;ng: l</FONT>&agrave;m th&#7871; n&agrave;o <FONT FACE="Times New Roman">&#273;&#7875; th&#7887;a m</FONT>&atilde;n m&#7897;t y&ecirc;u c&#7847;u v&ugrave;ng nh&#7899; k&iacute;ch th&#432;&#7899;c N&nbsp;? C&#7847;n ph&#7843;i ch&#7885;n v&ugrave;ng nh&#7899; n&agrave;o trong danh s&aacute;ch v&ugrave;ng nh&#7899; t&#7921; do <FONT FACE="Times New Roman">&#273;&#7875; c&#7845;p phát&nbsp;? Nh</FONT>&#432; v&#7853;y c&#7847;n ph&#7843;i ghi nh&#7899; hi&#7879;n tr&#7841;ng b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;&#7875; có th&#7875; c&#7845;p phát &#273;úng. Có hai ph</FONT>&#432;&#417;ng ph&aacute;p qu&#7843;n l&yacute; ch&#7911; y&#7871;u&nbsp;:</font></P><blockquote>

<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">Qu&#7843;n l&yacute; b&#7857;ng m&#7897;t b&#7843;ng c&aacute;c bit&nbsp;:</font></U> <font color="#000066"> b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia th&agrave;nh c&aacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; c&#7845;p ph&aacute;t, m&#7895;i <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&#7843;n &aacute;nh b&#7857;ng m&#7897;t bit trong b&#7843;ng c&aacute;c bit, m&#7897;t bit nh&#7853;n gi&aacute; tr&#7883; 0 n&#7871;u <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; b&#7897; nh&#7899; t&#432;&#417;ng &#7913;ng <FONT FACE="Times New Roman">&#273;ang t&#7921; do, v</FONT>&agrave; nh&#7853;n gi&aacute; tr&#7883; 1 n&#7871;u <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; t&#432;&#417;ng &#7913;ng <FONT FACE="Times New Roman">&#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t cho m&#7897;t ti&#7871;n tr&igrave;nh. Khi c&#7847;n n&#7841;p m&#7897;t ti&#7871;n tr&igrave;nh c&oacute; k&iacute;ch th&#432;&#7899;c <I>k</I> <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883;, c&#7847;n ph&#7843;i t&igrave;m trong b&#7843;ng c&aacute;c bit m&#7897;t d&atilde;y con <I>k </I>bit nh&#7853;n gi&aacute; tr&#7883; 0. <FONT FACE="Times New Roman">&#272;ây l</FONT>&agrave; m&#7897;t gi&#7843;i ph&aacute;p <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n, nh&#432;ng th&#7921;c hi&#7879;n ch&#7853;m n&ecirc;n &iacute;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng.</font></P>
<P ALIGN="center"><img border="0" src="images/hinh4.5.gif" width="294" height="128"></P>
<P ALIGN="center"><font color="#000066"><b>Hình 4.5</b> Qu&#7843;n lý b&#7897; nh&#7899; b&#7857;ng
b&#7843;ng các bit</font></P>
<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">Qu&#7843;n l&yacute; b&#7857;ng danh s&aacute;ch:</font></U> <font color="#000066"> T&#7893; ch&#7913;c m&#7897;t danh s&aacute;ch c&aacute;c ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n &#273;</FONT>&atilde; c&#7845;p ph&aacute;t v&agrave; ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n t&#7921; do, m&#7897;t phân &#273;o&#7841;n có th&#7875; l</FONT>&agrave; m&#7897;t ti&#7871;n tr&igrave;nh (P) hay v&ugrave;ng nh&#7899; tr&#7889;ng gi&#7919;a hai ti&#7871;n tr&igrave;nh (H).</font></P>

<P ALIGN="center"><img border="0" src="images/hinh4.6.gif" width="449" height="129"></P>

<P ALIGN="center"><font color="#000066"><b>Hình 4.6</b> Qu&#7843;n lý b&#7897; nh&#7899; b&#7857;ng
danh sách</font></P>

<P ALIGN="JUSTIFY"><font color="#000066">C&aacute;c thu&#7853;t to&aacute;n th&ocirc;ng d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7875; ch&#7885;n m&#7897;t phân &#273;o&#7841;n t&#7921; do trong danh sách &#273;&#7875; c&#7845;p phát cho ti&#7871;n tr</FONT>&igrave;nh l&agrave;&nbsp;:</font></P><blockquote>

<B><P ALIGN="JUSTIFY"><font color="#000066">First-fit:</font></B> <font color="#000066"> c&#7845;p ph&aacute;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n t&#7921; do &#273;&#7847;u ti</FONT>&ecirc;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7911; l&#7899;n.</font></P>
</FONT><B><P ALIGN="JUSTIFY"><font color="#000066">Best-fit:</font></B> <font color="#000066"> c&#7845;p ph&aacute;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n t&#7921; do nh&#7887; nh&#7845;t nh</FONT>&#432;ng  <FONT FACE="Times New Roman">&#273;&#7911; l&#7899;n &#273;&#7875; th</FONT>&otilde;a m&atilde;n nhu c&#7847;u.</font></P>
<B><P ALIGN="JUSTIFY"><font color="#000066">Worst-fit&nbsp;:</font></B> <font color="#000066"> c&#7845;p ph&aacute;t ph&acirc;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;o&#7841;n t&#7921; do l&#7899;n nh&#7845;t.</font></P></blockquote>

</blockquote>

</FONT><P ALIGN="JUSTIFY"><I><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
</font> </I><font color="#000066">Trong h&#7879; th&#7889;ng s&#7917; d&#7909;ng k&#7929; thu&#7853;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n , hi&#7879;n t</FONT>&#432;&#7907;ng ph&acirc;n m&#7843;nh ngo&#7841;i vi l&#7841;i xu&#7845;t hi&#7879;n khi c&aacute;c kh&#7889;i nh&#7899; t&#7921; do
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7873;u quá nh&#7887;, không &#273;&#7911; &#273;&#7875; ch&#7913;a m&#7897;t phân &#273;o&#7841;n.</font>

</FONT></P><P ALIGN="JUSTIFY">&nbsp;</P>

<B></blockquote>

</blockquote>
<P ALIGN="JUSTIFY"><font color="#800000"><a name="phantrang"><img border="0" src="images/read_single.gif" width="15" height="12">
 IV.2. Ph&acirc;n trang ( Paging)</a></font></P></B>
<blockquote>
<B>
<P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18"><font color="#000066">&Yacute; t&#432;&#7903;ng</font></B><font color="#000066">:&nbsp;</font></P>

<blockquote>
<P ALIGN="JUSTIFY"><font color="#000066">Ph&acirc;n b&#7897; nh&#7899; v&#7853;t l&yacute; th&agrave;nh c&aacute;c kh&#7889;i (block) c&oacute; k&iacute;ch th&#432;&#7899;c c&#7889; <FONT FACE="Times New Roman">&#273;&#7883;nh v</FONT>&agrave; b&#7857;ng nhau, g&#7885;i l&agrave; <I>khung trang (page frame)</I>. Kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#361;ng &#273;</FONT>&#432;&#7907;c chia th&agrave;nh c&aacute;c kh&#7889;i c&oacute; c&ugrave;ng k&iacute;ch th&#432;&#7899;c v&#7899;i khung trang, v&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; <I>trang</I> (<I>page</I>). Khi c&#7847;n n&#7841;p m&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7875; x&#7917; lý, các trang c&#7911;a ti&#7871;n tr</FONT>&igrave;nh s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p  v&agrave;o nh&#7919;ng khung trang c&ograve;n tr&#7889;ng. M&#7897;t ti&#7871;n tr&igrave;nh k&iacute;ch th&#432;&#7899;c N trang s&#7869; y&ecirc;u c&#7847;u N khung trang t&#7921; do.</font></P>

<P ALIGN="center"><img border="0" src="images/hinh4.8.gif" width="304" height="210"></P>
<P ALIGN="center"><font color="#000066"><b>Hình 4.8</b> Mô hình b&#7897; nh&#7899; phân
trang</font></P>

</blockquote>

<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18"><font color="#000066">C&#417; ch&#7871; MMU trong k&#7929; thu&#7853;t ph&acirc;n trang:</font></B> </P>
<blockquote>
<P ALIGN="JUSTIFY"><font color="#000066">C&#417; ch&#7871; ph&#7847;n c&#7913;ng h&#7895; tr&#7907; th&#7921;c hi&#7879;n chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i &#273;&#7883;a ch&#7881; trong c</FONT>&#417; ch&#7871; ph&acirc;n trang l&agrave; b&#7843;ng trang (<I>pages table</I>). M&#7895;i ph&#7847;n t&#7917; trong b&#7843;ng trang cho bi&#7871;t c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; b&#7855;t &#273;&#7847;u c&#7911;a v&#7883; trí l</FONT>&#432;u tr&#7919; trang t&#432;&#417;ng &#7913;ng  trong b&#7897; nh&#7899; v&#7853;t l&yacute; ( s&#7889; hi&#7879;u khung trang trong b&#7897; nh&#7899; v&#7853;t l&yacute;
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;ang ch&#7913;a trang ).</font> </P>
  </blockquote>
</FONT><B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18"><font color="#000066">Chuy&#7875;n
</font><font color="#000066" FACE="Times New Roman">&#273;&#7893;i &#273;&#7883;a ch&#7881;:</font></B> </P>
<blockquote>
<P ALIGN="JUSTIFY"><font color="#000066">M&#7895;i <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; phát sinh b&#7903;i CPU &#273;</FONT>&#432;&#7907;c chia th&agrave;nh hai ph&#7847;n:</font></P>
<blockquote>

<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
s&#7889; hi&#7879;u trang (p)</font></I><font color="#000066">: s&#7917; d&#7909;ng nh&#432; ch&#7881; m&#7909;c <FONT FACE="Times New Roman">&#273;&#7871;n ph&#7847;n t&#7917; t</FONT>&#432;&#417;ng &#7913;ng trong b&#7843;ng trang.</font></P>
<I><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
&#273;&#7883;a ch&#7881; t</font></FONT><font color="#000066">&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i trong trang (d)</FONT></font></I><font color="#000066">: k&#7871;t h&#7907;p v&#7899;i <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; b&#7855;t &#273;&#7847;u c&#7911;a trang &#273;&#7875; t&#7841;o ra &#273;&#7883;a ch&#7881; v&#7853;t lý m</FONT>&agrave; tr&igrave;nh qu&#7843;n l&yacute; b&#7897; nh&#7899; s&#7917; d&#7909;ng.</font></P>
</blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">K&iacute;ch th&#432;&#7899;c c&#7911;a trang do ph&#7847;n c&#7913;ng qui <FONT FACE="Times New Roman">&#273;&#7883;nh. &#272;&#7875; d&#7877; phân tích &#273;&#7883;a ch&#7881; &#7843;o th</FONT>&agrave;nh s&#7889; hi&#7879;u trang v&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; t</FONT>&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i, kích th</FONT>&#432;&#7899;c c&#7911;a m&#7897;t trang th&ocirc;ng th&#432;&#7901;ng l&agrave; m&#7897;t l&#361;y th&#7915;a c&#7911;a 2 (bi&#7871;n <FONT FACE="Times New Roman">&#273;&#7893;i trong ph&#7841;m vi 512 bytes v</FONT>&agrave; 8192 bytes). N&#7871;u k&iacute;ch th&#432;&#7899;c c&#7911;a kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881;  l</FONT>&agrave; <I>2<SUP>m</I></SUP> v&agrave; k&iacute;ch th&#432;&#7899;c trang l&agrave; <I>2<SUP> n</I></SUP>, th&igrave;  <I>m-n</I> bits cao c&#7911;a <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o s&#7869; bi&#7877;u di&#7877;n s&#7889; hi&#7879;u trang, v</FONT>&agrave; <I>n</I> bits th&#7845;p cho bi&#7871;t <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; t</FONT>&#432;&#417;ng
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7889;i trong trang.</font>
</FONT>
</P>

<P ALIGN="center"><img border="0" src="images/hinh4.9.gif" width="433" height="224"></P>

<P ALIGN="center">&nbsp;&nbsp;
p&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; d<br>
m-n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; n</P>
</blockquote>
<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18"><font color="#000066">C&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t b&#7843;ng trang</FONT></font></B><font color="#000066">:</font> </P>
<blockquote>
<P ALIGN="JUSTIFY"><font color="#000066">Trong tr&#432;&#7901;ng h&#7907;p <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n nh&#7845;t, b&#7843;ng trang m&#7897;t t&#7853;p c&aacute;c thanh ghi <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7875; c</FONT>&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t b&#7843;ng trang. Tuy nhi</FONT>&ecirc;n  vi&#7879;c s&#7917; d&#7909;ng thanh ghi ch&#7881; ph&ugrave; h&#7907;p v&#7899;i c&aacute;c b&#7843;ng trang c&oacute; k&iacute;ch th&#432;&#7899;c nh&#7887;, n&#7871;u b&#7843;ng trang c&oacute; k&iacute;ch th&#432;&#7899;c l&#7899;n, n&oacute; ph&#7843;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; trong b&#7897; nh&#7899; ch&iacute;nh, v&agrave; s&#7917; d&#7909;ng m&#7897;t thanh ghi <FONT FACE="Times New Roman">&#273;&#7875; l</FONT>&#432;u <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; b&#7855;t &#273;&#7847;u l</FONT>&#432;u tr&#7919; b&#7843;ng trang (PTBR).</font></P>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/caution.gif" width="16" height="16">
 Theo c&aacute;ch t&#7893; ch&#7913;c n&agrave;y, m&#7895;i truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7871;n d&#7919; li&#7879;u hay ch&#7881; th&#7883; &#273;&#7873;u &#273;</FONT>&ograve;i h&#7887;i hai l&#7847;n truy xu&#7845;t b&#7897; nh&#7899;&nbsp;: m&#7897;t cho truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7871;n b&#7843;ng trang v</FONT>&agrave; m&#7897;t cho b&#7843;n th&acirc;n d&#7919; li&#7879;u!</font></P>

<P ALIGN="center"><img border="0" src="images/hinh4.10.jpg" width="343" height="210"></P>

<P ALIGN="center"><font color="#000066"><b>Hình 4.10</b> Mô hình b&#7897; nh&#7899;
phân trang</font></P>

<P ALIGN="center"><img border="0" src="images/hinh4.11.gif" width="362" height="224"></P>

<P ALIGN="center"><font color="#000066"><b>Hình 4.11</b> S&#7917; d&#7909;ng thanh ghi
n&#7873;n tr&#7887; &#273;&#7871;n b&#7843;ng trang</font></P>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/caution.gif" width="16" height="16">
 C&oacute; th&#7875; n&eacute; tr&aacute;nh b&#7899;t vi&#7879;c truy xu&#7845;t b&#7897; nh&#7899; hai l&#7847;n b&#7857;ng c&aacute;ch s&#7917; d&#7909;ng th&ecirc;m m&#7897;t v&ugrave;ng nh&#7899; <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t , v&#7899;i t&#7889;c &#273;&#7897; truy xu&#7845;t nhanh v</FONT>&agrave; cho ph&eacute;p t&igrave;m ki&#7871;m song song, v&ugrave;ng nh&#7899; cache nh&#7887; n&agrave;y th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; b&#7897; nh&#7899; k&#7871;t h&#7907;p (TLBs). M&#7895;i thanh ghi trong b&#7897; nh&#7899; k&#7871;t h&#7907;p g&#7891;m m&#7897;t t&#7915; kh&oacute;a v&agrave; m&#7897;t gi&aacute; tr&#7883;, khi <FONT FACE="Times New Roman">&#273;</FONT>&#432;a <FONT FACE="Times New Roman">&#273;&#7871;n b&#7897; nh&#7899; k&#7871;t h&#7907;p m&#7897;t &#273;&#7889;i t</FONT>&#432;&#7907;ng c&#7847;n t&igrave;m, <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng n&agrave;y s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c so s&aacute;nh c&ugrave;ng l&uacute;c v&#7899;i c&aacute;c t&#7915; kh&oacute;a trong b&#7897; nh&#7899; k&#7871;t h&#7907;p <FONT FACE="Times New Roman">&#273;&#7875; t</FONT>&igrave;m ra ph&#7847;n t&#7917; t&#432;&#417;ng &#7913;ng. Nh&#7901; <FONT FACE="Times New Roman">&#273;&#7863;c tính n</FONT>&agrave;y m&agrave; vi&#7879;c t&igrave;m ki&#7871;m tr&ecirc;n b&#7897; nh&#7899; k&#7871;t h&#7907;p <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n r&#7845;t nhanh, nh&#432;ng chi ph&iacute; ph&#7847;n c&#7913;ng l&#7841;i cao.</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066">&nbsp;&nbsp;&nbsp; Trong k&#7929; thu&#7853;t ph&acirc;n trang, TLBs <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7875; l</FONT>&#432;u tr&#7919; c&aacute;c trang b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c truy c&#7853;p g&#7847;n hi&#7879;n t&#7841;i nh&#7845;t. Khi CPU ph&aacute;t sinh m&#7897;t <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881;, s&#7889; hi&#7879;u trang c&#7911;a &#273;&#7883;a ch&#7881; s&#7869; &#273;</FONT>&#432;&#7907;c so s&aacute;nh v&#7899;i c&aacute;c ph&#7847;n t&#7917; trong TLBs, n&#7871;u c&oacute; trang t&#432;&#417;ng &#7913;ng trong TLBs, th&igrave; s&#7869; x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh &#273;</FONT>&#432;&#7907;c ngay s&#7889; hi&#7879;u khung trang t&#432;&#417;ng &#7913;ng, n&#7871;u kh&ocirc;ng m&#7899;i c&#7847;n th&#7921;c hi&#7879;n thao t&aacute;c t&igrave;m ki&#7871;m trong b&#7843;ng trang.</font></P>
<P ALIGN="center"><img border="0" src="images/hinh4.12.gif" width="454" height="300"></P>
</blockquote>

<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18"><font color="#000066">T&#7893; ch&#7913;c b&#7843;ng trang:&nbsp;
</font> </B></P>
<blockquote>
  <P ALIGN="JUSTIFY"><font color="#000066">M&#7895;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&oacute; m&#7897;t ph&#432;&#417;ng ph&aacute;p ri&ecirc;ng <FONT FACE="Times New Roman">&#273;&#7875; t&#7893; ch&#7913;c l</FONT>&#432;u tr&#7919; b&#7843;ng trang. <FONT FACE="Times New Roman">&#272;a s&#7889; các h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh c&#7845;p cho m&#7895;i ti&#7871;n tr&igrave;nh m&#7897;t b&#7843;ng trang. Tuy nhi&ecirc;n ph&#432;&#417;ng ph&aacute;p n&agrave;y kh&ocirc;ng th&#7875; ch&#7845;p nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7871;u h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh cho ph&eacute;p qu&#7843;n l&yacute; m&#7897;t kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; có dung l</FONT>&#432;&#7907;ng qu&aacute; (2<SUP>32</SUP>, 2<SUP>64</SUP>): trong c&aacute;c h&#7879; th&#7889;ng nh&#432; th&#7871;, b&#7843;n th&acirc;n b&#7843;ng trang <FONT FACE="Times New Roman">&#273;</FONT>&ograve;i h&#7887;i m&#7897;t v&ugrave;ng nh&#7899; q&uacute;a l&#7899;n! C&oacute; hai gi&#7843;i ph&aacute;p cho v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; n</FONT>&agrave;y:</font></P>
<blockquote>

<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
 Ph&acirc;n trang <FONT FACE="Times New Roman">&#273;a c&#7845;p:</FONT>  </font></I><font color="#000066"> ph&acirc;n chia b&#7843;ng trang th&agrave;nh c&aacute;c ph&#7847;n nh&#7887;, b&#7843;n th&acirc;n b&#7843;ng trang c&#361;ng s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&acirc;n trang</font></P>
<P ALIGN="center"><img border="0" src="images/hinh4.13.gif" width="372" height="256"></P>
<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
B&#7843;ng trang ngh&#7883;ch <FONT FACE="Times New Roman">&#273;&#7843;o:</FONT> 
</font></I><font color="#000066"> s&#7917; d&#7909;ng duy nh&#7845;t m&#7897;t <I>b&#7843;ng trang ngh&#7883;ch <FONT FACE="Times New Roman">&#273;&#7843;o</FONT> </I> cho t&#7845;t c&#7843; c&aacute;c ti&#7871;n tr&igrave;nh . M&#7895;i ph&#7847;n t&#7917; trong <I>b&#7843;ng trang ngh&#7883;ch <FONT FACE="Times New Roman">&#273;&#7843;o</FONT> </I> ph&#7843;n &aacute;nh m&#7897;t khung trang trong b&#7897; nh&#7899; bao g&#7891;m <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; logic c&#7911;a m&#7897;t trang &#273;ang &#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; trong b&#7897; nh&#7899; v&#7853;t l&yacute; t&#7841;i khung trang n&agrave;y, c&ugrave;ng v&#7899;i th&ocirc;ng tin v&#7873; ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang &#273;</FONT>&#432;&#7907;c s&#7905; h&#7919;u trang. M&#7895;i <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o khi &#273;ó l</FONT>&agrave; m&#7897;t b&#7897; ba&nbsp;&lt;idp, p, d &gt;</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">Trong <FONT FACE="Times New Roman">&#273;ó&nbsp;:&nbsp;&nbsp;&nbsp;
idp l</FONT>&agrave; <FONT FACE="Times New Roman">&#273;&#7883;nh danh c&#7911;a ti&#7871;n tr</FONT>&igrave;nh</font></P><blockquote>
<blockquote>

<P ALIGN="left"><font color="#000066">p&nbsp;l&agrave; s&#7889; hi&#7879;u trang</font></P>
<P ALIGN="left"><font color="#000066">d l&agrave;  <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; t</FONT>&#432;&#417;ng
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7889;i trong trang</font></P>
  </blockquote>

</FONT>
</blockquote>
<P ALIGN="JUSTIFY"><font color="#000066">M&#7895;i ph&#7847;n t&#7917;  trong b&#7843;ng trang ngh&#7883;ch <FONT FACE="Times New Roman">&#273;&#7843;o l</FONT>&agrave; m&#7897;t c&#7863;p &lt;idp, p &gt;. Khi m&#7897;t tham kh&#7843;o <FONT FACE="Times New Roman">&#273;&#7871;n b&#7897; nh&#7899; &#273;</FONT>&#432;&#7907;c ph&aacute;t sinh, m&#7897;t ph&#7847;n <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o l</FONT>&agrave; &lt;idp, p &gt; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a <FONT FACE="Times New Roman">&#273;&#7871;n cho tr</FONT>&igrave;nh qu&#7843;n l&yacute; b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;&#7875; t</FONT>&igrave;m ph&#7847;n t&#7917; t&#432;&#417;ng &#7913;ng trong b&#7843;ng trang ngh&#7883;ch <FONT FACE="Times New Roman">&#273;&#7843;o, n&#7871;u t</FONT>&igrave;m th&#7845;y, <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý </FONT>&lt;i,d&gt; s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&aacute;t sinh. Trong c&aacute;c tr&#432;&#7901;ng h&#7907;p kh&aacute;c, xem nh&#432; tham kh&#7843;o b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;</FONT>&atilde; truy xu&#7845;t m&#7897;t
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7883;a ch&#7881; b&#7845;t h&#7907;p l&#7879;.</font>

</FONT></P>
<P ALIGN="center"><img border="0" src="images/hinh4.14.gif" width="452" height="251"></P>
</blockquote>
  </blockquote>

<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18"><font color="#000066">B&#7843;o v&#7879;</font></B><font color="#000066">:&nbsp;</font> </P>
<blockquote>
  <P ALIGN="JUSTIFY"><font color="#000066"> C&#417; ch&#7871; b&#7843;o v&#7879; trong h&#7879; th&#7889;ng ph&acirc;n trang <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n v&#7899;i c&aacute;c bit b&#7843;o v&#7879; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7855;n v&#7899;i m&#7895;i khung trang. Th&ocirc;ng th&#432;&#7901;ng , c&aacute;c bit n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u trong b&#7843;ng trang  , v&igrave; m&#7895;i truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7871;n b&#7897; nh&#7899; &#273;&#7873;u ph&#7843;i tham kh&#7843;o &#273;&#7871;n b&#7843;ng trang &#273;&#7875; phát sinh &#273;&#7883;a ch&#7881; v&#7853;t lý, khi &#273;ó, h&#7879; th&#7889;ng có th&#7875; ki&#7875;m tra các thao tác truy xu&#7845;t tr</FONT>&ecirc;n khung trang t&#432;&#417;ng &#7913;ng c&oacute; h&#7907;p l&#7879; v&#7899;i thu&#7897;c t&iacute;nh b&#7843;o v&#7879; c&#7911;a n&oacute; kh&ocirc;ng.</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066">Ngo&agrave;i ra, m&#7897;t bit ph&#7909; tr&#7897;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&ecirc;m v&agrave;o trong c&#7845;u tr&uacute;c m&#7897;t ph&#7847;n t&#7917; c&#7911;a b&#7843;ng trang&nbsp;: bit h&#7907;p l&#7879;-b&#7845;t h&#7907;p l&#7879; (valid-invalid).</font> </P>
<blockquote>

<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
H&#7907;p l&#7879; </font>    </I><font color="#000066">: trang t&#432;&#417;ng &#7913;ng thu&#7897;c v&#7873; kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#7911;a ti&#7871;n tr</FONT>&igrave;nh.</font></P>
<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
B&#7845;t h&#7907;p l&#7879; </font> </I><font color="#000066">: trang t&#432;&#417;ng &#7913;ng kh&ocirc;ng n&#7857;m trong kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#7911;a ti&#7871;n tr</FONT>&igrave;nh, <FONT FACE="Times New Roman">&#273;i&#7873;u n</FONT>&agrave;y c&oacute; ngh&#297;a ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&atilde; truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7871;n m&#7897;t &#273;&#7883;a ch&#7881; không &#273;</FONT>&#432;&#7907;c  ph&eacute;p.</font></P>

<B><P ALIGN="CENTER"><img border="0" src="images/hinh4.15.gif" width="228" height="55"></P><P ALIGN="CENTER"><font color="#000066">H&igrave;nh 4.15</font></B> <font color="#000066"> C&#7845;u tr&uacute;c m&#7897;t ph&#7847;n t&#7917; trong b&#7843;ng trang</font></P></blockquote>
</blockquote>

<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18"><font color="#000066">Chia s&#7867; b&#7897; nh&#7899; trong c&#417; ch&#7871; ph&acirc;n trang</font></B><font color="#000066">:&nbsp;
</font> </P>

<blockquote>
  <P ALIGN="JUSTIFY"><font color="#000066"> M&#7897;t &#432;u <FONT FACE="Times New Roman">&#273;i&#7875;m c&#7911;a c</FONT>&#417; ch&#7871; ph&acirc;n trang l&agrave; cho ph&eacute;p chia s&#7867; c&aacute;c trang gi&#7919;a c&aacute;c ti&#7871;n tr&igrave;nh.Trong tr&#432;&#7901;ng h&#7907;p n&agrave;y, s&#7921; chia s&#7867; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n b&#7857;ng c&aacute;ch &aacute;nh x&#7841; nhi&#7873;u <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; logic v</FONT>&agrave;o m&#7897;t <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý duy nh&#7845;t. Có th&#7875; áp d&#7909;ng k&#7929; thu&#7853;t n</FONT>&agrave;y <FONT FACE="Times New Roman">&#273;&#7875; cho phép có ti&#7871;n tr</FONT>&igrave;nh chia s&#7867; m&#7897;t v&ugrave;ng code chung<I>:</I> n&#7871;u c&oacute; nhi&#7873;u ti&#7871;n tr&igrave;nh c&#7911;a c&ugrave;ng m&#7897;t ch&#432;&#417;ng tr&igrave;nh, ch&#7881; c&#7847;n l&#432;u tr&#7919; m&#7897;t <FONT FACE="Times New Roman">&#273;o&#7841;n code c&#7911;a ch</FONT>&#432;&#417;ng tr&igrave;nh n&agrave;y trong b&#7897; nh&#7899;, c&aacute;c ti&#7871;n tr&igrave;nh s&#7869; c&oacute; th&#7875; c&ugrave;ng truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7871;n các trang ch&#7913;a code chung n</FONT>&agrave;y. L&#432;u &yacute; <FONT FACE="Times New Roman">&#273;&#7875; có th&#7875; chia s&#7867; m&#7897;t &#273;o&#7841;n code, &#273;o&#7841;n code n</FONT>&agrave;y ph&#7843;i c&oacute; thu&#7897;c t&iacute;nh <I>reenterable </I>(cho ph&eacute;p m&#7897;t b&#7843;n sao c&#7911;a ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7891;ng th&#7901;i b&#7903;i nhi&#7873;u tác v&#7909;).</font>

</FONT></P>

  <P ALIGN="center"><img border="0" src="images/hinh4.16.gif" width="394" height="298"></P>

  </blockquote>

<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18"><font color="#000066">Th&#7843;o lu&#7853;n</font></B><font color="#000066">:</font></P>
<blockquote>
<P ALIGN="JUSTIFY"><I><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
</font></I><font color="#000066">K&#7929; thu&#7853;t ph&acirc;n trang lo&#7841;i b&#7887; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c hi&#7879;n t&#432;&#7907;ng ph&acirc;n m&#7843;nh ngo&#7841;i vi&nbsp;: m&#7895;i khung trang <FONT FACE="Times New Roman">&#273;&#7873;u có th&#7875; &#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t cho m&#7897;t ti&#7871;n tr&igrave;nh n&agrave;o <FONT FACE="Times New Roman">&#273;ó có y</FONT>&ecirc;u c&#7847;u. Tuy nhi&ecirc;n hi&#7879;n t&#432;&#7907;ng ph&acirc;n m&#7843;nh n&#7897;i vi v&#7851;n c&oacute; th&#7875; x&#7843;y ra khi k&iacute;ch th&#432;&#7899;c c&#7911;a ti&#7871;n tr&igrave;nh kh&ocirc;ng <FONT FACE="Times New Roman">&#273;úng b&#7857;ng b&#7897;i s&#7889; c&#7911;a kích th</FONT>&#432;&#7899;c m&#7897;t trang, khi <FONT FACE="Times New Roman">&#273;ó, trang cu&#7889;i c</FONT>&ugrave;ng s&#7869; kh&ocirc;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng h&#7871;t.</font></P>
<P ALIGN="JUSTIFY"><I><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
</font></I><font color="#000066">M&#7897;t khi&aacute; c&#7841;nh t&iacute;ch c&#7921;c r&#7845;t quan tr&#7885;ng kh&aacute;c c&#7911;a k&#7929; thu&#7853;t ph&acirc;n trang l&agrave; s&#7921; ph&acirc;n bi&#7879;t r&#7841;ch r&ograve;i g&oacute;c nh&igrave;n c&#7911;a ng&#432;&#7901;i d&ugrave;ng v&agrave; c&#7911;a b&#7897; ph&#7853;n qu&#7843;n l&yacute; b&#7897; nh&#7899; v&#7853;t l&yacute;:</font></P><blockquote>
<blockquote>

<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
G&oacute;c nh&igrave;n c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng:</font></I> <font color="#000066"> m&#7897;t ti&#7871;n tr&igrave;nh c&#7911;a ng&#432;&#7901;i d&ugrave;ng nh&igrave;n th&#7845;y b&#7897; nh&#7899; nh&#432; l&agrave; m&#7897;t kh&ocirc;ng gian li&ecirc;n t&#7909;c, <FONT FACE="Times New Roman">&#273;&#7891;ng nh&#7845;t v</FONT>&agrave;  ch&#7881; ch&#7913;a duy nh&#7845;t b&#7843;n th&acirc;n ti&#7871;n tr&igrave;nh n&agrave;y.</font></P>
<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
G&oacute;c nh&igrave;n c&#7911;a b&#7897; nh&#7899; v&#7853;t l&yacute;:</font></I> <font color="#000066"> m&#7897;t ti&#7871;n tr&igrave;nh c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; ph&acirc;n t&aacute;n kh&#7855;p b&#7897; nh&#7899; v&#7853;t l&yacute;, trong b&#7897; nh&#7899; v&#7853;t l&yacute; <FONT FACE="Times New Roman">&#273;&#7891;ng th&#7901;i c&#361;ng ch&#7913;a nh&#7919;ng ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c.</font></P></blockquote>
</blockquote>

<P ALIGN="JUSTIFY"><I><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
</font></I><font color="#000066">Ph&#7847;n c&#7913;ng <FONT FACE="Times New Roman">&#273;&#7843;m nhi&#7879;m vi&#7879;c chuy&#7875;n &#273;&#7893;i &#273;&#7883;a ch&#7881; logic th</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý . S&#7921; chuy&#7875;n &#273;&#7893;i n</FONT>&agrave;y l&agrave; trong su&#7889;t <FONT FACE="Times New Roman">&#273;&#7889;i v&#7899;i ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng.</font></P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><I><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
</font></I><font color="#000066">&#272;&#7875;</font></FONT> <font color="#000066"> l&#432;u tr&#7919; c&aacute;c th&ocirc;ng tin chi ti&#7871;t v&#7873; qu&aacute; tr&igrave;nh c&#7845;p ph&aacute;t b&#7897; nh&#7899;, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh s&#7917; d&#7909;ng m&#7897;t b&#7843;ng khung trang, m&agrave; m&#7895;i ph&#7847;n t&#7917; m&ocirc; t&#7843; t&igrave;nh tr&#7841;ng c&#7911;a m&#7897;t khung trang v&#7853;t l&yacute;&nbsp;: t&#7921; do hay <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t cho m&#7897;t ti&#7871;n tr&igrave;nh n&agrave;o
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;ó&nbsp;.</font> </P>
  </blockquote>

</FONT><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/caution.gif" width="16" height="16">
L&#432;u &yacute; r&#7857;ng s&#7921; ph&acirc;n trang kh&ocirc;ng ph&#7843;n &aacute;nh <FONT FACE="Times New Roman">&#273;úng cách th&#7913;c ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng c&#7843;m nh&#7853;n v&#7873; b&#7897; nh&#7899;. Ng&#432;&#7901;i s&#7917; d&#7909;ng nh&igrave;n th&#7845;y b&#7897; nh&#7899; nh&#432; m&#7897;t t&#7853;p c&aacute;c <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng c&#7911;a ch&#432;&#417;ng tr&igrave;nh (segments, c&aacute;c th&#432; vi&#7879;n...) v&agrave; m&#7897;t t&#7853;p c&aacute;c <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng d&#7919; li&#7879;u (bi&#7871;n to&agrave;n c&#7909;c, stack, v&ugrave;ng nh&#7899; chia s&#7867;...). V&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; &#273;&#7863;t ra l</FONT>&agrave; c&#7847;n t&igrave;m m&#7897;t c&aacute;ch th&#7913;c bi&#7877;u di&#7877;n b&#7897; nh&#7899; sao cho c&oacute; th&#7875; cung c&#7845;p cho ng&#432;&#7901;i d&ugrave;ng m&#7897;t c&aacute;ch nh&igrave;n g&#7847;n v&#7899;i quan <FONT FACE="Times New Roman">&#273;i&#7875;m logic c&#7911;a h&#7885; h</FONT>&#417;n v&agrave; <FONT FACE="Times New Roman">&#273;ó l</FONT>&agrave; k&#7929; thu&#7853;t ph&acirc;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;o&#7841;n</font></P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/caution.gif" width="16" height="16">
K&#7929; thu&#7853;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n th</FONT>&otilde;a m&atilde;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c nhu c&#7847;u th&#7875; hi&#7879;n c&#7845;u tr&uacute;c logic c&#7911;a ch&#432;&#417;ng tr&igrave;nh nh&#432;ng n&oacute; d&#7851;n <FONT FACE="Times New Roman">&#273;&#7871;n t</FONT>&igrave;nh hu&#7889;ng ph&#7843;i c&#7845;p ph&aacute;t c&aacute;c kh&#7889;i nh&#7899; c&oacute; k&iacute;ch th&#432;&#7899;c kh&aacute;c nhau cho c&aacute;c ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n trong b&#7897; nh&#7899; v&#7853;t lý. &#272;i&#7873;u n</FONT>&agrave;y l&agrave;m r&#7855;c r&#7889;i v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; h</FONT>&#417;n r&#7845;t nhi&#7873;u so v&#7899;i vi&#7879;c c&#7845;p ph&aacute;t c&aacute;c trang c&oacute; k&iacute;ch th&#432;&#7899;c t&#297;nh.M&#7897;t gi&#7843;i ph&aacute;p dung ho&agrave; l&agrave; k&#7871;t h&#7907;p c&#7843; hai k&#7929; thu&#7853;t ph&acirc;n trang v&agrave; ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n&nbsp;: chúng ta ti&#7871;n h</FONT>&agrave;nh <I>ph&acirc;n trang c&aacute;c ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n</FONT></I>.</font></P><P ALIGN="JUSTIFY">&nbsp;</P>

<B></blockquote>

<P ALIGN="JUSTIFY"><font color="#800000"><a name="phandoantrang"><img border="0" src="images/read_single.gif" width="15" height="12">
 IV.3. Ph&acirc;n </a> </font> <FONT FACE="Times New Roman"><a name="phandoantrang"><font color="#800000">&#273;o&#7841;n k&#7871;t h&#7907;p phân trang (Paged segmentation)</font></a></P>

</FONT>
<blockquote>
  <P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">&Yacute; t&#432;&#7903;ng</font></B><font color="#000066">: Kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; l</FONT>&agrave; m&#7897;t t&#7853;p c&aacute;c ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n, m&#7895;i phân &#273;o&#7841;n &#273;</FONT>&#432;&#7907;c chia th&agrave;nh nhi&#7873;u trang. Khi m&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o h&#7879; th&#7889;ng, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh s&#7869; c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh c&aacute;c trang c&#7847;n thi&#7871;t <FONT FACE="Times New Roman">&#273;&#7875; ch&#7913;a &#273;&#7911; các phân &#273;o&#7841;n c&#7911;a ti&#7871;n tr</FONT>&igrave;nh</font><EM><font color="#000066">.</font></P>
</EM><B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">C&#417; ch&#7871; MMU trong k&#7929; thu&#7853;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n k&#7871;t h&#7907;p phân trang</FONT></font></B><font color="#000066">:</font> </P>
<FONT FACE="Times New Roman">
<blockquote>
  <P ALIGN="JUSTIFY"><font color="#000066">&#272;&#7875; h&#7895; tr&#7907; k&#7929; thu&#7853;t phân &#273;o&#7841;n, c&#7847;n có m&#7897;t
</font> </FONT><font color="#000066"><I>b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n</FONT></I>, nh&#432;ng gi&#7901; <FONT FACE="Times New Roman">&#273;ây m&#7895;i phân &#273;o&#7841;n c&#7847;n có m&#7897;t </FONT><I>b&#7843;ng trang</I> ph&acirc;n bi&#7879;t.</font> </P>
  </blockquote>
<B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">Chuy&#7875;n
</font><font color="#000066" FACE="Times New Roman">&#273;&#7893;i &#273;&#7883;a ch&#7881;:</font></B> </P>
  <blockquote>
<P ALIGN="JUSTIFY"><font color="#000066">M&#7895;i <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; logic l</FONT>&agrave; m&#7897;t b&#7897; ba:
</font> <I><font color="#000066">&lt;<B>s,p,d</B>&gt;</font></P>
<blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
s&#7889; hi&#7879;u ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n (s)</FONT></font></I><font color="#000066">: s&#7917; d&#7909;ng nh&#432; ch&#7881; m&#7909;c <FONT FACE="Times New Roman">&#273;&#7871;n ph&#7847;n t&#7917; t</FONT>&#432;&#417;ng &#7913;ng trong b&#7843;ng ph&acirc;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;o&#7841;n.</font></P>
</FONT><I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
s&#7889; hi&#7879;u trang (p)</font></I><font color="#000066">: s&#7917; d&#7909;ng nh&#432; ch&#7881; m&#7909;c <FONT FACE="Times New Roman">&#273;&#7871;n ph&#7847;n t&#7917; t</FONT>&#432;&#417;ng &#7913;ng trong b&#7843;ng trang c&#7911;a ph&acirc;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;o&#7841;n.</font></P>
<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
 &#273;&#7883;a ch&#7881; </font></I> </FONT>
<I><font color="#000066">t&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i trong trang (d): k&#7871;t h&#7907;p v&#7899;i &#273;&#7883;a ch&#7881; b&#7855;t &#273;&#7847;u c&#7911;a trang &#273;&#7875; t&#7841;o ra &#273;&#7883;a</FONT> </font></I><font color="#000066"> ch&#7881; v&#7853;t l&yacute; m&agrave; tr&igrave;nh qu&#7843;n l&yacute; b&#7897; nh&#7899; s&#7917; d&#7909;ng.</font></P>
  <P ALIGN="center"><img border="0" src="images/hinh4.22.gif" width="411" height="282"></P>

  <P ALIGN="center"><B><font color="#000066">H&igrave;nh 4.22</font></B><font color="#000066"><b>
  </b>Mô hình phân &#273;o&#7841;n k&#7871; h&#7907;p phân trang</font></P>

  <P ALIGN="center"><img border="0" src="images/hinh4.23.gif" width="486" height="342"></P>

</blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">T&#7845;t c&#7843; c&aacute;c m&ocirc; h&igrave;nh t&#7893; ch&#7913;c b&#7897; nh&#7899; tr&ecirc;n <FONT FACE="Times New Roman">&#273;ây &#273;&#7873;u có khuynh h</FONT>&#432;&#7899;ng c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh to&agrave;n b&#7897; c&aacute;c trang y&ecirc;u c&#7847;u tr&#432;&#7899;c khi th&#7853;t s&#7921; x&#7917; l&yacute;. V&igrave; b&#7897; nh&#7899; v&#7853;t l&yacute; c&oacute; k&iacute;ch th&#432;&#7899;c r&#7845;t gi&#7899;i h&#7841;n, <FONT FACE="Times New Roman">&#273;i&#7873;u n</FONT>&agrave;y d&#7851;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7871;n hai &#273;i&#7875;m b&#7845;t ti&#7879;n sau&nbsp;:</font></P><blockquote>

</FONT><P ALIGN="JUSTIFY"> <I><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
</font></I><font color="#000066">K&iacute;ch th&#432;&#7899;c ti&#7871;n tr&igrave;nh b&#7883; gi&#7899;i h&#7841;n b&#7903;i k&iacute;ch th&#432;&#7899;c c&#7911;a b&#7897; nh&#7899; v&#7853;t l&yacute;.</font></P>
<P ALIGN="JUSTIFY"> <I><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
</font></I><font color="#000066">Kh&oacute; c&oacute; th&#7875; b&#7843;o tr&igrave; nhi&#7873;u ti&#7871;n tr&igrave;nh c&ugrave;ng l&uacute;c trong b&#7897; nh&#7899;, v&agrave; nh&#432; v&#7853;y kh&oacute; n&acirc;ng cao m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; &#273;a ch</FONT>&#432;&#417;ng c&#7911;a h&#7879; th&#7889;ng.</font></P>
<P ALIGN="JUSTIFY">&nbsp;</P></blockquote>

  </blockquote>
</blockquote>

<B><P ALIGN="JUSTIFY"><font color="#FF0000" face="Verdana" size="4"><a name="tomtat">V. T&oacute;m t&#7855;t</a></font></P><blockquote>

</B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
C&oacute; nhi&#7873;u c&aacute;ch ti&#7871;p c&#7853;n kh&aacute;c nhau <FONT FACE="Times New Roman">&#273;&#7875; t&#7893; ch&#7913;c qu</FONT>&atilde;n l&yacute; b&#7897; nh&#7899;, nh&#432;ng t&#7921;u chung mong <FONT FACE="Times New Roman">&#273;&#7841;t &#273;&#7871;n các m&#7909;c ti</FONT>&ecirc;u sau&nbsp;:</font></P><blockquote>

<P ALIGN="JUSTIFY"> <I><font color="#000066"><img border="0" src="images/dotgreen.gif" width="9" height="9">
</font></I><font color="#000066">C&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;áp &#7913;ng &#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7847;y &#273;&#7911; các  nhu c&#7847;u b&#7897; nh&#7899; c&#7911;a ch</FONT>&#432;&#417;ng tr&igrave;nh v&#7899;i m&#7897;t b&#7897; nh&#7899; v&#7853;t l&yacute; gi&#7899;i h&#7841;n</font></P>
<P ALIGN="JUSTIFY"> <I><font color="#000066"><img border="0" src="images/dotgreen.gif" width="9" height="9">
</font></I><font color="#000066">Qu&aacute; tr&igrave;nh chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i &#273;&#7883;a ch&#7881;, t&#7893; ch&#7913;c c&#7845;p phát b&#7897; nh&#7899; l</FONT>&agrave; trong su&#7889;t v&#7899;i ng&#432;&#7901;i d&ugrave;ng, v&agrave; c&oacute; kh&#7843; n</font><FONT FACE="Times New Roman"><font color="#000066">&#259;ng tái &#273;&#7883;nh v&#7883;.</font></P>
</FONT><P ALIGN="JUSTIFY"> <I><font color="#000066"><img border="0" src="images/dotgreen.gif" width="9" height="9">
</font></I><font color="#000066">T&#7853;n d&#7909;ng hi&#7879;u qu&#7843; b&#7897; nh&#7899; ( &iacute;t c&oacute; v&ugrave;ng nh&#7899; kh&ocirc;ng s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c)</font></P>
<P ALIGN="JUSTIFY"> <I><font color="#000066"><img border="0" src="images/dotgreen.gif" width="9" height="9">
</font></I><font color="#000066">B&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7843;o v&#7879; t&#7889;t</font></P>
<P ALIGN="JUSTIFY"> <I><font color="#000066"><img border="0" src="images/dotgreen.gif" width="9" height="9">
</font></I><font color="#000066">C&oacute; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng chia s&#7867; b&#7897; nh&#7899; gi&#7919;a các ti&#7871;n tr</FONT>&igrave;nh</font></P></blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
M&#7897;t s&#7889; c&aacute;ch ti&#7871;p c&#7853;n t&#7893; ch&#7913;c b&#7897; nh&#7899; ch&iacute;nh</font></P><blockquote>

<I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/dotgreen.gif" width="9" height="9">
C&#7845;p ph&aacute;t li&ecirc;n t&#7909;c</font></I><font color="#000066">&nbsp;: c&oacute; th&#7875; c&#7845;p ph&aacute;t c&aacute;c v&ugrave;ng nh&#7899; li&ecirc;n t&#7909;c cho c&aacute;c ti&#7871;n tr&igrave;nh trong nh&#7919;ng ph&acirc;n v&ugrave;ng c&oacute; k&iacute;ch th&#432;&#7899;c c&#7889; <FONT FACE="Times New Roman">&#273;&#7883;nh hay bi&#7871;n &#273;&#7897;ng. &#272;i&#7875;m y&#7871;u  c&#7911;a cách ti&#7871;p c&#7853;n n</FONT>&agrave;y l&agrave; k&iacute;ch th&#432;&#7899;c c&aacute;c ch&#432;&#417;ng tr&igrave;nh c&oacute; th&#7875; d&#432;&#7907;c x&#7917; l&yacute; b&#7883; gi&#7899;i h&#7841;n b&#7903;i c&aacute;c k&iacute;ch th&#432;&#7899;c c&#7911;a kh&#7889;i nh&#7899; li&ecirc;n t&#7909;c c&oacute; th&#7875; s&#7917; d&#7909;ng. C&aacute;c hi&#7879;n t&#432;&#7907;ng ph&acirc;n m&#7843;nh ngo&#7841;i vi, n&#7897;i vi
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7873;u có th&#7875; xu&#7845;t hi&#7879;n</font></P>
</FONT><I><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/dotgreen.gif" width="9" height="9">
C&#7845;p ph&aacute;t kh&ocirc;ng li&ecirc;n t&#7909;c</font></I><font color="#000066">&nbsp;: c&oacute; th&#7875; c&#7845;p ph&aacute;t c&aacute;c v&ugrave;ng nh&#7899; kh&ocirc;ng li&ecirc;n t&#7909;c cho m&#7897;t ti&#7871;n tr&igrave;nh. Hai k&#7929; thu&#7853;t th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c &aacute;p d&#7909;ng l&agrave; ph&acirc;n trang v&agrave; ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n. K&#7929; thu&#7853;t</FONT> ph&acirc;n trang cho ph&eacute;p lo&#7841;i b&otilde; hi&#7879;n t&#432;&#7907;ng ph&acirc;n m&#7843;nh ngo&#7841;i vi, k&#7929; thu&#7853;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n lo&#7841;i b&#7887; hi&#7879;n t</FONT>&#432;&#7907;ng ph&acirc;n m&#7843;nh n&#7897;i vi, nh&#432;ng ph&#7843;i gi&#7843;i quy&#7871;t v&#7845;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7873;  c&#7845;p phát &#273;&#7897;ng.</font></FONT><FONT SIZE=4><font color="#000066">&nbsp;</font></P>
</blockquote>
</blockquote>

</FONT>
<P><a name="cauhoi"><img border="0" src="images/blebul1a.gif" width="20" height="20"> <b><font color="#FF0000" face="Times New Roman" size="4">C&#7911;ng
c&#7889; bài h&#7885;c</font></b></a></P>
<blockquote>
<P><font color="#000066">C&aacute;c c&acirc;u h&#7887;i c&#7847;n tr&#7843; l&#7901;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c sau b&agrave;i h&#7885;c n&agrave;y :</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">1. Nhi&#7879;m v&#7909; qu&#7843;n l&yacute; b&#7897; nh&#7899; bao g&#7891;m c&aacute;c c&ocirc;ng vi&#7879;c n&agrave;o&nbsp;? Giai <FONT FACE="Times New Roman">&#273;o&#7841;n n</FONT>&agrave;o do h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh th&#7921;c hi&#7879;n&nbsp;, giai <FONT FACE="Times New Roman">&#273;o&#7841;n n</FONT>&agrave;o c&#7847;n s&#7921; tr&#7907; gi&uacute;p c&#7911;a ph&#7847;n c&#7913;ng?</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">2. C&aacute;c kh&aacute;i ni&#7879;m&nbsp;: ph&acirc;n m&#7843;nh n&#7897;i vi, ph&acirc;n m&#7843;nh ngo&#7841;i vi, b&agrave;i to&aacute;n c&#7845;p ph&aacute;t
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7897;ng, &#273;i&#7841; ch&#7881; logic, &#273;i&#7841; ch&#7881; physic</font></P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066">3. Ph&acirc;n t&iacute;ch &#432;u khuy&#7871;t c&#7911;a c&aacute;c m&ocirc; h&igrave;nh t&#7893; ch&#7913;c b&#7897; nh&#7899;.</font></P>
</blockquote>
<FONT SIZE=4>

</FONT><P ALIGN="JUSTIFY"><a name="baitap"><img border="0" src="images/blebul1a.gif" width="20" height="20">
<b><font color="#FF0000" face="Times New Roman" size="4">Bài T&#7853;p</font></b></a></P>
<blockquote>
  <P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
  <b>Bài 1.</b> Gi&#7843;i th&iacute;ch s&#7921; kh&aacute;c bi&#7879;t gi&#7919;a <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; logic v</FONT>&agrave;
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7883;a ch&#7881; physic?</font></P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
  <b>Bài 2.</b> Gi&#7843;i th&iacute;ch s&#7921; kh&aacute;c bi&#7879;t gi&#7919;a hi&#7879;n t&#432;&#7907;ng ph&acirc;n m&#7843;nh n&#7897;i vi  v&agrave; ngo&#7841;i vi?
</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 3.</b> Gi&#7843; s&#7917;  b&#7897; nh&#7899; ch&iacute;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&acirc;n th&agrave;nh c&aacute;c  ph&acirc;n v&ugrave;ng c&oacute; k&iacute;ch th&#432;&#7899;c l&agrave; 600K, 500K, 200K, 300K ( theo th&#7913; t&#7921; ), cho bi&#7871;t c&aacute;c ti&#7871;n tr&igrave;nh c&oacute; k&iacute;ch th&#432;&#7899;c 212K, 417K, 112K v&agrave; 426K ( theo th&#7913; t&#7921; ) s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t b&#7897; nh&#7899; nh&#432; th&#7871; n&agrave;o, n&#7871;u s&#7917; d&#7909;ng :
</font> </P><blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">a) Thu&#7853;t to&aacute;n First fit</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">b) Thu&#7853;t to&aacute;n Best fit</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">c) Thu&#7853;t to&aacute;n Worst fit</font></P></blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">Thu&#7853;t to&aacute;n n&agrave;o cho ph&eacute;p s&#7917; d&#7909;ng b&#7897; nh&#7899; hi&#7879;u q&#7911;a nh&#7845;t trong tr&#432;&#7901;ng h&#7907;p tr&ecirc;n ?</font></P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 4.</b> X&eacute;t m&#7897;t h&#7879; th&#7889;ng trong <FONT FACE="Times New Roman">&#273;ó m&#7897;t ch</FONT>&#432;&#417;ng tr&igrave;nh khi <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o b&#7897; nh&#7899; s&#7869; ph&acirc;n bi&#7879;t ho&agrave;n to&agrave;n ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n code v</FONT>&agrave; ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n data. Gi&#7843; s&#7917;  CPU s&#7869; xác &#273;&#7883;nh &#273;</FONT>&#432;&#7907;c khi n&agrave;o c&#7847;n truy xu&#7845;t l&#7879;nh hay d&#7919; li&#7879;u , v&agrave; ph&#7843;i truy xu&#7845;t &#7903; <FONT FACE="Times New Roman">&#273;âu. Khi &#273;ó</FONT> m&#7895;i ch&#432;&#417;ng tr&igrave;nh s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c cung c&#7845;p 2 b&#7897; thanh ghi base-limit : m&#7897;t cho ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n code, v</FONT>&agrave; m&#7897;t cho ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n data. B&#7897; thanh ghi base-limit c&#7911;a phân &#273;o&#7841;n code t&#7921; &#273;&#7897;ng &#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7863;t thu&#7897;c tính readonly. Th&#7843;o lu&#7853;n các </FONT>&#432;u v&agrave; khuy&#7871;t <FONT FACE="Times New Roman">&#273;i&#7875;m c&#7911;a h&#7879; th&#7889;ng n</FONT>&agrave;y.
</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 5.</b> T&#7841;i sao k&iacute;ch th&#432;&#7899;c trang lu&ocirc;n l&agrave; l&#361;y th&#7915;a c&#7911;a 2 ?
</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 6.</b> X&eacute;t m&#7897;t kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; có 8 trang, m&#7895;i trang  có kích th</FONT>&#432;&#7899;c 1K. &aacute;nh x&#7841; v&agrave;o b&#7897; nh&#7899; v&#7853;t l&yacute; c&oacute; 32 khung trang.
</font> </P><blockquote>

<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><font color="#000066">a) &#272;&#7883;a ch&#7881; logic g&#7891;m bao nhi</font></FONT><font color="#000066">&ecirc;u bit  ?</font></P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><font color="#000066">b) &#272;&#7883;a ch&#7881; physic g&#7891;m bao nhi</font></FONT><font color="#000066">&ecirc;u bit  ?</font></P></blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 7.</b> T&#7841;i sao trong h&#7879; th&#7889;ng s&#7917; d&#7909;ng k&#7929; thu&#7853;t ph&acirc;n trang, m&#7897;t ti&#7871;n tr&igrave;nh kh&ocirc;ng th&#7875; truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7871;n v</FONT>&ugrave;ng nh&#7899; kh&ocirc;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p cho n&oacute; ? L&agrave;m c&aacute;ch n&agrave;o h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&oacute; th&#7875; cho ph&eacute;p s&#7921; truy xu&#7845;t n&agrave;y x&#7843;y ra ? H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&oacute; n&ecirc;n cho ph&eacute;p
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;i&#7873;u &#273;ó không ? T&#7841;i sao ?</font></P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
  <b>Bài 8.</b> X&eacute;t m&#7897;t h&#7879; th&#7889;ng s&#7917; d&#7909;ng k&#7929; thu&#7853;t ph&acirc;n trang, v&#7899;i b&#7843;ng trang <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; trong b&#7897; nh&#7899; ch&iacute;nh.
</font> </P><blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">a) N&#7871;u th&#7901;i gian cho m&#7897;t l&#7847;n truy xu&#7845;t b&#7897; nh&#7899; b&igrave;nh th&#432;&#7901;ng l&agrave; 200nanoseconds, th&igrave; m&#7845;t bao nhi&ecirc;u th&#7901;i gian cho m&#7897;t thao t&aacute;c truy xu&#7845;t b&#7897; nh&#7899; trong h&#7879; th&#7889;ng n&agrave;y ?</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">b) N&#7871;u s&#7917; d&#7909;ng TLBs v&#7899;i hit-ratio ( t&#7881; l&#7879; t&igrave;m th&#7845;y) l&agrave; 75%, th&#7901;i gian <FONT FACE="Times New Roman">&#273;&#7875; t</FONT>&igrave;m trong TLBs xem nh&#432; b&#7857;ng 0, t&iacute;nh th&#7901;i gian truy xu&#7845;t b&#7897; nh&#7899; trong h&#7879; th&#7889;ng ( effective memory reference time)</font></P></blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 9.</b> N&#7871;u cho ph&eacute;p hai ph&#7847;n t&#7917; trong b&#7843;ng trang c&ugrave;ng l&#432;u tr&#7919; m&#7897;t s&#7889; hi&#7879;u khung trang trong b&#7897; nh&#7899; th&igrave; s&#7869; c&oacute; hi&#7879;u q&#7911;a g&igrave; ? Gi&#7843;i th&iacute;ch l&agrave;m c&aacute;ch n&agrave;o hi&#7879;u q&#7911;a n&agrave;y c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7875; gi&#7843;m th&#7901;i gian c&#7847;n khi sao chép m&#7897;t kh&#7889;i l</FONT>&#432;&#7907;ng l&#7899;n v&ugrave;ng nh&#7899; t&#7915; v&#7883; tr&iacute; n&agrave;y sang v&#7883; tr&iacute; kh&aacute;c. Khi <FONT FACE="Times New Roman">&#273;ó n&#7871;u s&#7917;a n&#7897;i dung m&#7897;t trang th</FONT>&igrave; s&#7869; t&aacute;c <FONT FACE="Times New Roman">&#273;&#7897;ng &#273;&#7871;n trang c</FONT>&ograve;n l&#7841;i th&#7871; n&agrave;o?
</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 10.</b> V&igrave; sao <FONT FACE="Times New Roman">&#273;ôi lúc ng</FONT>&#432;&#7901;i ta k&#7871;t h&#7907;p hai k&#7929; thu&#7853;t ph&acirc;n trang v&agrave; ph&acirc;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;o&#7841;n ?</font></P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
  <b>Bài 11.</b> M&ocirc; t&#7843; c&#417; ch&#7871; cho ph&eacute;p m&#7897;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n có th&#7875; thu&#7897;c v&#7873; không gian &#273;i&#7841; ch&#7881; c&#7911;a hai ti&#7871;n tr</FONT>&igrave;nh.
</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 12.</b> Gi&#7843;i th&iacute;ch v&igrave; sao chia s&#7867; m&#7897;t module trong k&#7929; thu&#7853;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n l&#7841;i d&#7877; h</FONT>&#417;n trong k&#7929; thu&#7853;t ph&acirc;n trang?
</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 13.</b> X&eacute;t b&#7843;ng ph&acirc;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;o&#7841;n sau &#273;ây :</font></P>
</FONT>
<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=288>
<TR><TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/bg_yellow.gif">
<P ALIGN="CENTER"><font color="#000066">Segment</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/bg_yellow.gif">
<P ALIGN="CENTER"><font color="#000066">Base</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/bg_yellow.gif">
<P ALIGN="CENTER"><font color="#000066">Length</font></TD>
</TR>
<TR><TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">0</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">219</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">600</font></TD>
</TR>
<TR><TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">1</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">2300</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">14</font></TD>
</TR>
<TR><TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">2</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">90</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">100</font></TD>
</TR>
<TR><TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">3</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">1327</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">580</font></TD>
</TR>
<TR><TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">4</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">1952</font></TD>
<TD WIDTH="33%" VALIGN="TOP" HEIGHT=20 background="images/blocks.gif">
<P ALIGN="CENTER"><font color="#000066">96</font></TD>
</TR>
</TABLE>
</CENTER>

<P ALIGN="JUSTIFY"><font color="#000066">Cho bi&#7871;t <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý t</FONT>&#432;&#417;ng &#7913;ng v&#7899;i c&aacute;c
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7883;a ch&#7881; logique sau &#273;ây :</font></P>
</FONT><PRE><font color="#000066">	a. 0,430
	b. 1,10
	c. 2,500
	d. 3,400
	e. 4,112</font></PRE>
</blockquote>
</BODY>
</HTML>
