<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 4.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<LINK REL="stylesheet" TYPE="text/css" HREF="style.css" TITLE="MTD">
<title>New Page 1</title>
</head>

<body>
<STRONG>
<P ALIGN="JUSTIFY" class="cap1"><a name="cautruc">III. C&#7844;U TR&Uacute;C C&#7910;A H&#7878; &#272;I&#7872;U
HÀNH</a></P>
<FONT SIZE=4><P ALIGN="JUSTIFY" class="cap2"><a name="thanhphan"><img border="0" src="images/read_single.gif" width="15" height="12">
III.1 C&aacute;c th&agrave;nh ph&#7847;n c&#7911;a h&#7879; th&#7889;ng</a></P></FONT></STRONG><B><P>&nbsp;&nbsp;&nbsp;
<img border="0" src="images/bullet.gif" width="12" height="14"> Qu&#7843;n l&yacute; ti&#7871;n tr&igrave;nh</P>

</B><blockquote>

<P ALIGN="JUSTIFY">M&#7897;t ch&#432;&#417;ng tr&igrave;nh kh&ocirc;ng th&#7921;c hi&#7879;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&igrave; c&#7843; n&#7871;&oslash;u nh&#432; n&oacute; kh&ocirc;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c CPU thi h&agrave;nh. M&#7897;t <B><I>ti&#7871;n tr&igrave;nh</B></I> l&agrave; m&#7897;t ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang &#273;</FONT>&#432;&#7907;c thi h&agrave;nh, nh&#432;ng &yacute; ngh&#297;a c&#7911;a n&oacute; c&ograve;n r&#7897;ng h&#417;n. M&#7897;t c&ocirc;ng vi&#7879;c theo l&ocirc; l&agrave; m&#7897;t ti&#7871;n tr&igrave;nh. M&#7897;t ch&#432;&#417;ng tr&igrave;nh ng&#432;&#7901;i d&ugrave;ng chia x&#7867; th&#7901;i gian l&agrave; m&#7897;t ti&#7871;n tr&igrave;nh, m&#7897;t c&ocirc;ng vi&#7879;c c&#7911;a h&#7879; th&#7889;ng nh&#432; soopling xu&#7845;t ra m&aacute;y in c&#361;ng l&agrave; m&#7897;t ti&#7871;n tr&igrave;nh.</P>
<P ALIGN="JUSTIFY">M&#7897;t ti&#7871;n tr&igrave;nh ph&#7843;i s&#7917;  d&#7909;ng t&agrave;i nguy&ecirc;n nh&#432; th&#7901;i gian s&#7917; d&#7909;ng CPU, b&#7897; nh&#7899;, t&#7853;p tin, c&aacute;c thi&#7871;t b&#7883; nh&#7853;p xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7875; ho</FONT>&agrave;n t&#7845;t c&ocirc;ng vi&#7879;c c&#7911;a n&oacute;. C&aacute;c t&agrave;i nguy&ecirc;n n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c cung c&#7845;p khi ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o hay trong qu&aacute; tr&igrave;nh thi h&agrave;nh. Khi ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o, n&oacute; s&#7917; d&#7909;ng r&#7845;t nhi&#7873;u t&agrave;i nguy&ecirc;n v&#7853;t l&yacute; v&agrave; lu&#7853;n l&yacute;.c&#361;ng nh&#432; m&#7897;t s&#7889; kh&#7903;i t&#7841;o d&#7919; li&#7879;u nh&#7853;p. V&iacute; d&#7909; , kh&#7843;o s&aacute;t ti&#7871;n tr&igrave;nh hi&#7875;n th&#7883; tr&#7841;ng th&aacute;i c&#7911;a t&#7853;p tin l&ecirc;n m&agrave;n h&igrave;nh. <FONT FACE="Times New Roman">&#272;&#7847;u v</FONT>&agrave;o c&#7911;a ti&#7871;n tr&igrave;nh l&agrave; t&ecirc;n t&#7853;p tin, v&agrave; ti&#7871;n tr&igrave;nh s&#7869; th&#7921;c hi&#7879;n nh&#7919;ng ch&#7881; th&#7883; th&iacute;ch h&#7907;p, th&#7921;c hi&#7879;n l&#7901;i g&#7885;i h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#7875; nh&#7853;n &#273;</FONT>&#432;&#7907;c nh&#7919;ng th&ocirc;ng tin mong mu&#7889;n v&agrave; hi&#7875;n th&#7883; n&oacute; l&ecirc;n m&agrave;n h&igrave;nh. Khi ti&#7871;n tr&igrave;nh k&#7871;t th&uacute;c, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;</FONT>&ucirc;u h&agrave;nh s&#7869; t&aacute;i t&#7841;o l&#7841;i c&aacute;c t&agrave;i nguy&ecirc;n c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c d&ugrave;ng l&#7841;i..</P>
<P ALIGN="JUSTIFY">M&#7897;t ti&#7871;n tr&igrave;nh l&agrave; ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng (active) ho</FONT>&agrave;n to&agrave;n-ng&#432;&#7907;c l&#7841;i v&#7899;i m&#7897;t t&#7853;p tin tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a l</FONT>&agrave; th&#7909; <FONT FACE="Times New Roman">&#273;&#7897;ng (passive)-v&#7899;i m&#7897;t b&#7897; &#273;&#7871;m ch</FONT>&#432;&#417;ng tr&igrave;nh cho bi&#7871;t l&#7879;nh k&#7871; ti&#7871;p <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi h&agrave;nh.Vi&#7879;c thi h&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n theo c&#417; ch&#7871; tu&#7847;n t&#7921; , CPU s&#7869; thi h&agrave;nh t&#7915; l&#7879;nh <FONT FACE="Times New Roman">&#273;&#7847;u &#273;&#7871;n l&#7879;nh cu&#7889;i.</P>
</FONT>
<P ALIGN="JUSTIFY">M&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c coi l&agrave; m&#7897;t <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; l&agrave;m vi&#7879;c c&#7911;a h&#7879; th&#7889;ng. M&#7897;t h&#7879; th&#7889;ng c&oacute; th&#7875; c&oacute; nhi&#7873;u ti&#7871;n tr&igrave;nh c&ugrave;ng l&uacute;c , trong <FONT FACE="Times New Roman">&#273;ó m&#7897;t s&#7889; ti&#7871;n tr</FONT>&igrave;nh l&agrave; c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh, m&#7897;t s&#7889; ti&#7871;n tr&igrave;nh l&agrave; c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng. c&aacute;c ti&#7871;n tr&igrave;nh n&agrave;y c&oacute; th&#7875; di&#7877;n ra <FONT FACE="Times New Roman">&#273;&#7891;ng th&#7901;i.</P>
</FONT>
<P ALIGN="JUSTIFY">Vai tr&ograve; c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh trong vi&#7879;c qu&#7843;n l&yacute; ti&#7871;n tr&igrave;nh l&agrave; :</P>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">T&#7841;o v&agrave; h&#7911;y c&aacute;c ti&#7871;n tr&igrave;nh c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng v&agrave; c&#7911;a h&#7879; th&#7889;ng.</P></blockquote>
</blockquote>

  <blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Ng&#432;ng v&agrave; th&#7921;c hi&#7879;n l&#7841;i m&#7897;t ti&#7871;n tr&igrave;nh.</P></blockquote>
</blockquote>

  <blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Cung c&#7845;p c&#417; ch&#7871; <FONT FACE="Times New Roman">&#273;&#7891;ng b&#7897; ti&#7871;n tr</FONT>&igrave;nh.</P></blockquote>
</blockquote>

  <blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Cung c&#7845;p c&aacute;ch th&ocirc;ng tin gi&#7919;a c&aacute;c ti&#7871;n tr&igrave;nh.</P></blockquote>
</blockquote>

  <blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Cung c&#7845;p c&#417; ch&#7871; ki&#7875;m so&aacute;t deadlock(kh&aacute;i ni&#7879;m n&agrave;y s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c tr&igrave;nh b&agrave;y trong ch&#432;&#417;ng II).</P></blockquote>
</blockquote>

<P>&nbsp;</P>

<B><P>&nbsp;&nbsp;&nbsp; <img border="0" src="images/bullet.gif" width="12" height="14">
Qu&#7843;n l&yacute; b&#7897; nh&#7899; ch&iacute;nh :</P>

</B><blockquote>

<P ALIGN="JUSTIFY">Trong h&#7879; th&#7889;ng m&aacute;y t&iacute;nh hi&#7879;n <FONT FACE="Times New Roman">&#273;&#7841;i, </FONT><B><I>b&#7897; nh&#7899; ch&iacute;nh</B></I> l&agrave; trung t&acirc;m c&#7911;a c&aacute;c thao t&aacute;c, x&#7917; l&yacute;. B&#7897; nh&#7899; ch&iacute;nh c&oacute; th&#7875; xem nh&#432; m&#7897;t m&#7843;ng ki&#7875;u byte hay ki&#7875;u word. M&#7895;i ph&#7847;n t&#7917; <FONT FACE="Times New Roman">&#273;&#7873;u có &#273;&#7883;a ch&#7881;. &#272;ó l</FONT>&agrave; n&#417;i l&#432;u d&#7919; li&#7879;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c CPU truy xu&#7845;t m&#7897;t c&aacute;ch nhanh ch&oacute;ng so v&#7899;i c&aacute;c thi&#7871;t b&#7883; nh&#7853;p/xu&#7845;t. CPU <FONT FACE="Times New Roman">&#273;&#7885;c nh&#7919;ng ch&#7881; th&#7883; t&#7915; b&#7897; nh&#7899; chính. Các thi&#7871;t b&#7883; nh&#7853;p/xu&#7845;t c</FONT>&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t c</FONT>&#417; ch&#7871; DMA(xem ch&#432;&#417;ng IV) c&#361;ng <FONT FACE="Times New Roman">&#273;&#7885;c v</FONT>&agrave; ghi d&#7919; li&#7879;u trong b&#7897; nh&#7899; ch&iacute;nh. Th&ocirc;ng th&#432;&#7901;ng b&#7897; nh&#7899; ch&iacute;nh ch&#7913;a c&aacute;c thi&#7871;t b&#7883; m&agrave; CPU c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;&#7883;nh v&#7883; tr&#7921;c ti&#7871;p. Ví d&#7909; CPU truy xu&#7845;t d&#7919; li&#7879;u t&#7915; &#273;&#297;a, nh&#7919;ng d&#7919; li&#7879;u n</FONT>&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chuy&#7875;n v&agrave;o b&#7897; nh&#7899; qua l&#7901;i g&#7885;i h&#7879; th&#7889;ng nh&#7853;p/xu&#7845;t.</P>
<P ALIGN="JUSTIFY">M&#7897;t ch&#432;&#417;ng tr&igrave;nh mu&#7889;n thi h&agrave;nh tr&#432;&#7899;c h&#7871;t ph&#7843;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c &aacute;nh x&#7841; th&agrave;nh <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; tuy&#7879;t &#273;&#7889;i v</FONT>&agrave; n&#7841;p v&agrave;o b&#7897; nh&#7899; ch&iacute;nh.Khi ch&#432;&#417;ng tr&igrave;nh thi h&agrave;nh, h&#7879; th&#7889;ng truy xu&#7845;t c&aacute;c ch&#7881; th&#7883; v&agrave; d&#7919; li&#7879;u c&#7911;a ch&#432;&#417;ng tr&igrave;nh trong b&#7897; nh&#7899; ch&iacute;nh. Ngay c&#7843; khi ti&#7871;n tr&igrave;nh k&#7871;t th&uacute;c , d&#7919; li&#7879;u v&#7851;n c&ograve;n trong b&#7897; nh&#7899; cho <FONT FACE="Times New Roman">&#273;&#7871;n khi m&#7897;t ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ghi ch&#7891;ng l&ecirc;n.</P>
<P ALIGN="JUSTIFY"><FONT FACE="Times New Roman">&#272;&#7875; t&#7889;i </FONT>&#432;u h&oacute;a qu&aacute; tr&igrave;nh ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng c&#7911;a CPU v</FONT>&agrave; t&#7889;c <FONT FACE="Times New Roman">&#273;&#7897; c&#7911;a máy tính, m&#7897;t s&#7889; ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u gi&#7919; trong b&#7897; nh&#7899;. C&oacute; r&#7845;t nhi&#7873;u k&#7871; ho&#7841;ch qu&#7843;n tr&#7883; b&#7897; nh&#7899; do c&oacute; nhi&#7873;u &#7913;ng d&#7909;ng b&#7897; nh&#7899; kh&aacute;c nhau v&agrave; hi&#7879;u qu&#7843; c&#7911;a c&aacute;c thu&#7853;t to&aacute;n ph&#7909; thu&#7897;c v&agrave;o t&ugrave;y t&igrave;nh hu&#7889;ng c&#7909; th&#7875;. L&#7921;a ch&#7885;n m&#7897;t thu&#7853;t to&aacute;n cho m&#7897;t h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c m&ocirc; t&#7843; tr&#432;&#7899;c ph&#7909; thu&#7897;c v&agrave;o nhi&#7873;u y&#7871;u t&#7889;, <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t l</FONT>&agrave; ph&#7847;n c&#7913;ng c&#7911;a h&#7879; th&#7889;ng.</P>
<P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&oacute; nh&#7919;ng vai tr&ograve; nh&#432; sau trong vi&#7879;c qu&#7843;n l&yacute; b&#7897; nh&#7899; ch&iacute;nh :</P>
  <blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">L&#432;u gi&#7919; th&ocirc;ng tin v&#7873; c&aacute;c v&#7883; tr&iacute; trong b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng v&agrave; ai s&#7917; d&#7909;ng.</P></blockquote>
</blockquote>

<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Quy&#7871;t <FONT FACE="Times New Roman">&#273;&#7883;nh ti&#7871;n tr</FONT>&igrave;nh n&agrave;o <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o b&#7897; nh&#7899; ch&iacute;nh, khi b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;</FONT>&atilde; c&oacute; th&#7875; d&ugrave;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c.</P></blockquote>
</blockquote>

<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">C&#7845;p ph&aacute;t v&agrave; thu h&#7891;i b&#7897; nh&#7899; khi c&#7847;n thi&#7871;t.</P></blockquote>
</blockquote>

<B><P>&nbsp;&nbsp;&nbsp; <img border="0" src="images/bullet.gif" width="12" height="14">
Qu&#7843;n l&yacute; b&#7897; nh&#7899; ph&#7909; :</P>

</B><blockquote>

<P ALIGN="JUSTIFY">M&#7909;c ti&ecirc;u ch&iacute;nh c&#7911;a h&#7879; th&#7889;ng m&aacute;y t&iacute;nh l&agrave; thi h&agrave;nh ch&#432;&#417;ng tr&igrave;nh. Nh&#7919;ng ch&#432;&#417;ng tr&igrave;nh v&#7899;i d&#7919; li&#7879;u truy xu&#7845;t c&#7911;a ch&uacute;ng ph&#7843;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7863;t trong b&#7897; nh&#7899; chính trong su&#7889;t quá tr</FONT>&igrave;nh thi h&agrave;nh. Nh&#432;ng b&#7897; nh&#7899; ch&iacute;nh qu&aacute; nh&#7887; <FONT FACE="Times New Roman">&#273;&#7875; có th&#7875; l</FONT>&#432;u gi&#7919; m&#7885;i d&#7919; li&#7879;u v&agrave; ch&#432;&#417;ng tr&igrave;nh, ngo&agrave;i ra d&#7919; li&#7879;u s&#7869; m&#7845;t khi kh&ocirc;ng c&ograve;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c cung c&#7845;p n<FONT FACE="Times New Roman">&#259;ng l</FONT>&#432;&#7907;ng. H&#7879; th&#7889;ng m&aacute;y t&iacute;nh ng&agrave;y nay cung c&#7845;p <B><I>h&#7879; th&#7889;ng l&#432;u tr&#7919; ph&#7909;</B></I>. <FONT FACE="Times New Roman">&#272;a s&#7889; các máy tính &#273;&#7873;u d</FONT>&ugrave;ng <FONT FACE="Times New Roman">&#273;&#297;a &#273;&#7875; l</FONT>&#432;u tr&#7919; c&#7843; ch&#432;&#417;ng tr&igrave;nh v&agrave; d&#7919; li&#7879;u. H&#7847;u nh&#432; t&#7845;t c&#7843; ch&#432;&#417;ng tr&igrave;nh : ch&#432;&#417;ng tr&igrave;nh d&#7883;ch, h&#7907;p ng&#7919;, th&#7911; t&#7909;c, tr&igrave;nh so&#7841;n th&#7843;o, <FONT FACE="Times New Roman">&#273;&#7883;nh d&#7841;ng... &#273;&#7873;u &#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a cho t&#7899;i khi nó &#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n, n&#7841;p v&agrave;o trong b&#7897; nh&#7899; ch&iacute;nh v&agrave; c&#361;ng s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#297;a &#273;&#7875; ch&#7913;a d&#7919; li&#7879;u v</FONT>&agrave; k&#7871;t qu&#7843; x&#7917; l&yacute;. V&igrave; v&#7853;y m&#7897;t b&#7897; qu&#7843;n l&yacute; h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#297;a r&#7845;t quan tr&#7885;ng cho h&#7879; th&#7889;ng máy tính.</P>
</FONT>
<P ALIGN="JUSTIFY">Vai tr&ograve; c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh trong vi&#7879;c qu&#7843;n l&yacute; <FONT FACE="Times New Roman">&#273;&#297;a :</P>
</FONT><blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Qu&#7843;n l&yacute; v&ugrave;ng tr&#7889;ng tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a.

</FONT></P></blockquote>
</blockquote>

<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10"><FONT FACE="Times New Roman">&#272;&#7883;nh v&#7883; l</FONT>&#432;u tr&#7919;.</P></blockquote>
</blockquote>

<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">L&#7853;p l&#7883;ch cho <FONT FACE="Times New Roman">&#273;&#297;a.</P></blockquote>
</blockquote>

</FONT><blockquote>

<P ALIGN="JUSTIFY">V&igrave; h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#297;a &#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng th&#432;&#7901;ng xuy&ecirc;n, n&ecirc;n n&oacute; ph&#7843;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c d&ugrave;ng hi&#7879;u qu&#7843;.T&#7889;c <FONT FACE="Times New Roman">&#273;&#7897; c&#7911;a to</FONT>&agrave;n b&#7897; h&#7879; th&#7889;ng tu&#7923; thu&#7897;c r&#7845;t nhi&#7873;u v&agrave;o t&#7889;c <FONT FACE="Times New Roman">&#273;&#7897; truy xu&#7845;t &#273;&#297;a.

</FONT></P></blockquote>

<B><P>&nbsp;&nbsp;&nbsp; <img border="0" src="images/bullet.gif" width="12" height="14">
Qu&#7843;n l&yacute; h&#7879; th&#7889;ng nh&#7853;p xu&#7845;t :</P>

</B><blockquote>

<P ALIGN="JUSTIFY">M&#7897;t trong nh&#7919;ng m&#7909;c ti&ecirc;u c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&agrave; <I>che d&#7845;u</I> nh&#7919;ng <FONT FACE="Times New Roman">&#273;&#7863;c th</FONT>&ugrave; c&#7911;a c&aacute;c thi&#7871;t b&#7883; ph&#7847;n c&#7913;ng <FONT FACE="Times New Roman">&#273;&#7889;i v&#7899;i ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng thay v&agrave;o <FONT FACE="Times New Roman">&#273;ó l</FONT>&agrave; m&#7897;t l&#7899;p th&acirc;n thi&#7879;n h&#417;n, ng&#432;&#7901;i s&#7917; d&#7909;ng d&#7875; thao t&aacute;c h&#417;n. M&#7897;t h&#7879; th&#7889;ng nh&#7853;p/xu&#7845;t bao g&#7891;m :</P>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">H&#7879; th&#7889;ng buffer caching.</P></blockquote>
</blockquote>

<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Giao ti&#7871;p <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; (device drivers) t&#7893;ng quát.

</FONT></P></blockquote>
</blockquote>

<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">B&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n cho các thi&#7871;t b&#7883; ph&#7847;n c&#7913;ng.</P>
</FONT></blockquote>

<P ALIGN="JUSTIFY">Ch&#7881; c&oacute; device driver m&#7899;i hi&#7875;u <FONT FACE="Times New Roman">&#273;&#7871;n c&#7845;u trúc &#273;&#7863;c th</FONT>&ugrave; c&#7911;a thi&#7871;t b&#7883; m&agrave; n&oacute; m&ocirc; t&#7843;.</P></blockquote>

<B><P>&nbsp;&nbsp;&nbsp; <img border="0" src="images/bullet.gif" width="12" height="14">
Qu&#7843;n l&yacute; h&#7879; th&#7889;ng t&#7853;p tin :</P>

</B><blockquote>

<P ALIGN="JUSTIFY">H&#7879; th&#7889;ng qu&#7843;n l&yacute; t&#7853;p tin l&agrave; th&agrave;nh ph&#7847;n r&otilde; r&agrave;ng nh&#7845;t trong h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh. M&aacute;y t&iacute;nh c&oacute; th&#7875; l&#432;u tr&#7919; th&ocirc;ng tin trong nhi&#7873;u d&#7841;ng thi&#7871;t b&#7883; v&#7853;t l&yacute; kh&aacute;c nhau : b<FONT FACE="Times New Roman">&#259;ng t&#7915;, &#273;&#297;a t&#7915;, , &#273;&#297;a quang, ... M&#7895;i d&#7841;ng có nh&#7919;ng &#273;&#7863;c th</FONT>&ugrave; ri&ecirc;ng v&#7873; m&#7863;t t&#7893; ch&#7913;c v&#7853;t l&yacute;. M&#7895;i thi&#7871;t b&#7883; c&oacute; m&#7897;t b&#7897; ki&#7875;m so&aacute;t nh&#432; b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n &#273;&#297;a (disk driver) v</FONT>&agrave; c&oacute; nh&#7919;ng t&iacute;nh ch&#7845;t ri&ecirc;ng. Nh&#7919;ng t&iacute;nh ch&#7845;t n&agrave;y l&agrave; t&#7889;c <FONT FACE="Times New Roman">&#273;&#7897;, kh&#7843; n&#259;ng l</FONT>&#432;u tr&#7919;, t&#7889;c <FONT FACE="Times New Roman">&#273;&#7897; truy&#7873;n d&#7919; li&#7879;u v</FONT>&agrave; c&aacute;ch truy xu&#7845;t.</P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#7875; cho vi&#7879;c s&#7917; d&#7909;ng h&#7879; th&#7889;ng máy tính thu&#7853;n ti&#7879;n, h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh cung c&#7845;p m&#7897;t c&aacute;i nh&igrave;n logic <FONT FACE="Times New Roman">&#273;&#7891;ng nh&#7845;t v&#7873; h&#7879; th&#7889;ng l</FONT>&#432;u tr&#7919; th&ocirc;ng tin. H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a m&#7897;t &#273;</FONT>&#417;n v&#7883; l&#432;u tr&#7919; logic l&agrave; t&#7853;p tin. H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh t&#7841;o m&#7897;t &aacute;nh x&#7841; t&#7915; t&#7853;p tin <FONT FACE="Times New Roman">&#273;&#7871;n v</FONT>&ugrave;ng th&ocirc;ng tin tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a v</FONT>&agrave; truy xu&#7845;t nh&#7919;ng t&#7853;p tin n&agrave;y th&ocirc;ng qua thi&#7871;t b&#7883; l&#432;u tr&#7919;.</P>
<P ALIGN="JUSTIFY">M&#7897;t t&#7853;p tin l&agrave; m&#7897;t t&#7853;p h&#7907;p nh&#7919;ng th&ocirc;ng tin do ng&#432;&#7901;i t&#7841;o ra n&oacute; x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh. Thông th</FONT>&#432;&#7901;ng m&#7897;t t&#7853;p tin <FONT FACE="Times New Roman">&#273;&#7841;i di&#7879;n cho m&#7897;t ch</FONT>&#432;&#417;ng tr&igrave;nh v&agrave; d&#7919; li&#7879;u. D&#7919; li&#7879;u c&#7911;a t&#7853;p tin c&oacute; th&#7875; l&agrave; s&#7889;, l&agrave; k&yacute; t&#7921;, hay k&yacute; s&#7889;. T&#7853;p tin th&#432;&#7901;ng c&oacute; d&#7841;ng t&#7921; do, nh&#432; t&#7853;p tin v<FONT FACE="Times New Roman">&#259;n b&#7843;n, nh&#7883; phân...(l</FONT>&agrave; t&#7853;p tin ch&#7913;a d&atilde;y c&aacute;c bit). (Xem b&agrave;i VIII)</P>
<blockquote>

<P ALIGN="JUSTIFY">Vai tr&ograve; c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh trong vi&#7879;c qu&#7843;n l&yacute; t&#7853;p tin :</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">T&#7841;o v&agrave; xo&aacute; m&#7897;t t&#7853;p tin.</P></blockquote>
</blockquote>

<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">T&#7841;o v&agrave; xo&aacute; m&#7897;t th&#432; m&#7909;c.</P></blockquote>
</blockquote>

<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">H&#7895; tr&#7907; c&aacute;c thao t&aacute;c tr&ecirc;n t&#7853;p tin v&agrave; th&#432; m&#7909;c.</P></blockquote>
</blockquote>

<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Ánh x&#7841; t&#7853;p tin tr&ecirc;n h&#7879; th&#7889;ng l&#432;u tr&#7919; ph&#7909;.</P></blockquote>
</blockquote>

<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Backup t&#7853;p tin tr&ecirc;n c&aacute;c thi&#7871;t b&#7883; l&#432;u tr&#7919;.</P></blockquote>
</blockquote>

<B><P>&nbsp;&nbsp;&nbsp; <img border="0" src="images/bullet.gif" width="12" height="14">
H&#7879; th&#7889;ng b&#7843;o v&#7879; :</P>

</B><blockquote>

<P ALIGN="JUSTIFY">Trong m&#7897;t h&#7879; th&#7889;ng nhi&#7873;u ng&#432;&#7901;i s&#7917; d&#7909;ng v&agrave; cho ph&eacute;p nhi&#7873;u ti&#7871;n tr&igrave;nh di&#7877;n ra <FONT FACE="Times New Roman">&#273;&#7891;ng th&#7901;i, các ti&#7871;n tr</FONT>&igrave;nh ph&#7843;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7843;o v&#7879; <FONT FACE="Times New Roman">&#273;&#7889;i v&#7899;i nh&#7919;ng ho&#7841;t &#273;&#7897;ng khác.Do &#273;ó, h&#7879; th&#7889;ng cung c&#7845;p c</FONT>&#417; ch&#7871; <FONT FACE="Times New Roman">&#273;&#7875; &#273;&#7843;m b&#7843;o r&#7857;ng t&#7853;p tin, b&#7897; nh&#7899;, CPU, v</FONT>&agrave; nh&#7919;ng t&agrave;i nguy&ecirc;n kh&aacute;c ch&#7881; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c truy xu&#7845;t b&#7903;i nh&#7919;ng ti&#7871;n tr&igrave;nh c&oacute; quy&#7873;n. V&iacute; d&#7909;, b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;&#7843;m b&#7843;o r&#7857;ng ti&#7871;n tr</FONT>&igrave;nh ch&#7881; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi h&agrave;nh trong ph&#7841;m vi <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#7911;a nó. B&#7897; th&#7901;i gian &#273;&#7843;m b&#7843;o r&#7857;ng không có ti&#7871;n tr</FONT>&igrave;nh n&agrave;o <FONT FACE="Times New Roman">&#273;&#7897;c chi&#7871;m CPU. Cu&#7889;i c</FONT>&ugrave;ng c&aacute;c thi&#7871;t b&#7883; ngo&#7841;i vi c&#361;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7843;o v&#7879;.</P>
<B><I><P ALIGN="JUSTIFY">H&#7879; th&#7889;ng b&#7843;o v&#7879;</B></I> l&agrave; m&#7897;t c&#417; ch&#7871; ki&#7875;m so&aacute;t qu&aacute; tr&igrave;nh truy xu&#7845;t c&#7911;a ch&#432;&#417;ng tr&igrave;nh, ti&#7871;n tr&igrave;nh, ho&#7863;c ng&#432;&#7901;i s&#7917; d&#7909;ng v&#7899;i t&agrave;i nguy&ecirc;n c&#7911;a h&#7879; th&#7889;ng. C&#417; ch&#7871; n&agrave;y c&#361;ng cung c&#7845;p c&aacute;ch th&#7913;c <FONT FACE="Times New Roman">&#273;&#7875; mô t&#7843; l&#7841;i m&#7913;c &#273;&#7897; ki&#7875;m soát.</P>
</FONT>
<P ALIGN="JUSTIFY">H&#7879; th&#7889;ng b&#7843;o v&#7879; c&#361;ng l&agrave;m t<FONT FACE="Times New Roman">&#259;ng &#273;&#7897; an to</FONT>&agrave;n khi ki&#7875;m tra l&#7895;i trong giao ti&#7871;p gi&#7919;a nh&#7919;ng h&#7879; th&#7889;ng nh&#7887; b&ecirc;n trong.</P></blockquote>

<P>&nbsp;</P>

<B><P>&nbsp;&nbsp;&nbsp; <img border="0" src="images/bullet.gif" width="12" height="14">
H&#7879; th&#7889;ng c&#417; ch&#7871; d&ograve;ng l&#7879;nh :</P>

</B><blockquote>

<P ALIGN="JUSTIFY">M&#7897;t trong nh&#7919;ng ph&#7847;n quan tr&#7885;ng c&#7911;a ch&#432;&#417;ng tr&igrave;nh h&#7879; th&#7889;ng trong m&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&agrave; c&#417; ch&#7871; <B><I>d&ograve;ng l&#7879;nh</B></I>, <FONT FACE="Times New Roman">&#273;ó l</FONT>&agrave; giao ti&#7871;p gi&#7919;a ng&#432;&#7901;i s&#7917; d&#7909;ng v&agrave; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh. M&#7897;t s&#7889; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;&#7863;t c</FONT>&#417; ch&#7871; d&ograve;ng l&#7879;nh b&ecirc;n trong h&#7841;t nh&acirc;n, s&#7889; kh&aacute;c nh&#432; MS-DOS v&agrave; UNIX th&igrave; xem h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh nh&#432; l&agrave; m&#7897;t ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7863;t bi&#7879;t, &#273;</FONT>&#432;&#7907;c thi h&agrave;nh khi c&aacute;c c&ocirc;ng vi&#7879;c b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u ho&#7863;c khi ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng login l&#7847;n <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n. </P>
<P ALIGN="JUSTIFY">C&aacute;c l&#7879;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh th&ocirc;ng qua <I>b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n l&#7879;nh</I></FONT>. Trong c&aacute;c h&#7879; th&#7889;ng chia x&#7867; th&#7901;i gian m&#7897;t ch&#432;&#417;ng tr&igrave;nh c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;&#7885;c v</FONT>&agrave; th&ocirc;ng d&#7883;ch c&aacute;c l&#7879;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n &#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n m&#7897;t c&aacute;ch t&#7921; <FONT FACE="Times New Roman">&#273;&#7897;ng. Ch</FONT>&#432;&#417;ng tr&igrave;nh n&agrave;y th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; b&#7897; th&ocirc;ng d&#7883;ch <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n card, c</FONT>&#417; ch&#7871; d&ograve;ng l&#7879;nh ho&#7863;c Shell. Ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a nó r&#7845;t &#273;</FONT>&#417;n gi&#7843;n <FONT FACE="Times New Roman">&#273;ó l</FONT>&agrave; l&#7845;y l&#7879;nh k&#7871; ti&#7871;p v&agrave; thi h&agrave;nh.</P>
<P ALIGN="JUSTIFY">M&#7895;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh s&#7869; c&oacute; nh&#7919;ng giao ti&#7871;p kh&aacute;c nhau, d&#7841;ng <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n theo c&#417; ch&#7871; d&ograve;ng l&#7879;nh, d&#7841;ng th&acirc;n thi&#7879;n v&#7899;i ng&#432;&#7901;i s&#7917; d&#7909;ng nh&#432; giao di&#7879;n c&#7911;a Macintosh c&oacute; c&aacute;c bi&#7875;u t&#432;&#7907;ng, c&#7917;a s&#7893; thao t&aacute;c d&ugrave;ng chu&#7897;t.</P>
<P ALIGN="JUSTIFY">C&aacute;c l&#7879;nh c&oacute; quan h&#7879; v&#7899;i vi&#7879;c t&#7841;o v&agrave; qu&#7843;n l&yacute; c&aacute;c ti&#7871;n tr&igrave;nh, ki&#7875;m so&aacute;t nh&#7853;p xu&#7845;t, qu&#7843;n l&yacute; b&#7897; l&#432;u tr&#7919; ph&#7909;, qu&#7843;n l&yacute; b&#7897; nh&#7899; ch&iacute;nh, truy xu&#7845;t h&#7879; th&#7889;ng t&#7853;p tin v&agrave; c&#417; ch&#7871; b&#7843;o v&#7879;.</P>
<P ALIGN="JUSTIFY">&nbsp;</P></blockquote>

<FONT SIZE=4><STRONG><P class="cap2"><a name="dichvu"><img border="0" src="images/read_single.gif" width="15" height="12">
III.2 C&aacute;c d&#7883;ch v&#7909; c&#7911;a h&#7879; </a> </FONT><a name="dichvu"><FONT FACE="Times New Roman" SIZE=4>&#273;i&#7873;u h</FONT><FONT SIZE=4>&agrave;nh
</FONT></a></P><blockquote>
</STRONG>
<P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh cung c&#7845;p m&#7897;t m&ocirc;i tr&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;&#7875; thi h</FONT>&agrave;nh c&aacute;c ch&#432;&#417;ng tr&igrave;nh, b&#7857;ng c&aacute;ch cung c&#7845;p c&aacute;c d&#7883;ch v&#7909; cho ch&#432;&#417;ng tr&igrave;nh v&agrave; cho ng&#432;&#7901;i s&#7917; d&#7909;ng. C&aacute;c d&#7883;ch v&#7909; n&agrave;y tr&ecirc;n m&#7895;i h&#7879; th&#7889;ng l&agrave; kh&aacute;c nhau nh&#432;ng c&#361;ng c&oacute; nh&#7919;ng l&#7899;p chung. C&aacute;c d&#7883;ch v&#7909; n&agrave;y gi&uacute;p cho c&aacute;c l&#7853;p tr&igrave;nh vi&ecirc;n thu&#7853;n ti&#7879;n h&#417;n v&agrave; vi&#7879;c l&#7853;p tr&igrave;nh d&#7875; d&agrave;ng h&#417;n.</P>
<P ALIGN="JUSTIFY"><B><I><img border="0" src="images/red.gif" width="7" height="10">Thi h&agrave;nh ch&#432;&#417;ng tr&igrave;nh</I> </B> : h&#7879; th&#7889;ng ph&#7843;i c&oacute; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng n&#7841;p ch</FONT>&#432;&#417;ng tr&igrave;nh v&agrave;o b&#7897; nh&#7899; v&agrave; thi h&agrave;nh n&oacute;. Ch&#432;&#417;ng tr&igrave;nh ph&#7843;i ch&#7845;m d&#7913;t thi h&agrave;nh theo c&aacute;ch th&ocirc;ng th&#432;&#7901;ng hay b&#7845;t th&#432;&#7901;ng (c&oacute; l&#7895;i).</P>
<P ALIGN="JUSTIFY"><B><I><img border="0" src="images/red.gif" width="7" height="10">Thao t&aacute;c nh&#7853;p xu&#7845;t</I></B> : M&#7897;t ch&#432;&#417;ng tr&igrave;nh thi h&agrave;nh c&oacute; th&#7875; y&ecirc;u c&#7847;u nh&#7853;p xu&#7845;t. Nh&#7853;p xu&#7845;t n&agrave;y c&oacute; th&#7875; l&agrave; t&#7853;p tin hay thi&#7871;t b&#7883;. <FONT FACE="Times New Roman">&#272;&#7889;i v&#7899;i thi&#7871;t b&#7883; có m&#7897;t h</FONT>&agrave;m <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t &#273;</FONT>&#432;&#7907;c thi h&agrave;nh. <FONT FACE="Times New Roman">&#272;&#7875; t&#259;ng hi&#7879;u qu&#7843;, ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng kh&ocirc;ng truy xu&#7845;t tr&#7921;c ti&#7871;p c&aacute;c thi&#7871;t b&#7883; nh&#7853;p xu&#7845;t m&agrave; th&ocirc;ng qua c&aacute;ch th&#7913;c do h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh cung c&#7845;p.</P>
<P ALIGN="JUSTIFY"><B><I><img border="0" src="images/red.gif" width="7" height="10">Thao t&aacute;c tr&ecirc;n h&#7879; th&#7889;ng t&#7853;p tin</I></B> .</P>
<P ALIGN="JUSTIFY"><B><I><img border="0" src="images/red.gif" width="7" height="10">Th&ocirc;ng tin</I></B> : c&oacute; nhi&#7873;u t&igrave;nh hu&#7889;ng m&#7897;t ti&#7871;n tr&igrave;nh c&#7847;n trao <FONT FACE="Times New Roman">&#273;&#7893;i thông tin v&#7899;i m&#7897;t ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c. C&oacute; hai c&aacute;ch th&#7921;c hi&#7879;n: M&#7897;t l&agrave; th&#7921;c hi&#7879;n thay th&#7871; ti&#7871;n tr&igrave;nh tr&ecirc;n c&ugrave;ng m&aacute;y t&iacute;nh, hai l&agrave; thay th&#7871; ti&#7871;n tr&igrave;nh tr&ecirc;n h&#7879; th&#7889;ng kh&aacute;c trong h&#7879; th&#7889;ng m&#7841;ng. Th&ocirc;ng tin c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t qua chia x&#7867; b&#7897; nh&#7899;, ho&#7863;c b&#7857;ng k&#7929; thu&#7853;t chuy&#7875;n thông &#273;i&#7879;p. Vi&#7879;c chuy&#7875;n thông tin &#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n b&#7903;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh.</P>
<B><I>
</B></I><P ALIGN="JUSTIFY"><B><I><img border="0" src="images/red.gif" width="7" height="10">Ph&aacute;t hi&#7879;n l&#7895;i</I></B><I> </I>: h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ph&#7843;i c&oacute; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng báo l&#7895;i. L&#7895;i x&#7843;y ra có th&#7875; do CPU, b&#7897; nh&#7899;, trong thi&#7871;t b&#7883; nh&#7853;p xu&#7845;t, … hay trong các ch</FONT>&#432;&#417;ng tr&igrave;nh. <FONT FACE="Times New Roman">&#272;&#7889;i v&#7899;i m&#7895;i d&#7841;ng l&#7895;i, h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh s&#7869; c&oacute; c&aacute;ch gi&#7843;i quy&#7871;t t&#432;&#417;ng &#7913;ng.</P>
<FONT SIZE=4><STRONG></blockquote>

<P ALIGN="JUSTIFY" class="cap2"><a name="loigoi"><img border="0" src="images/read_single.gif" width="15" height="12">
III.3 L&#7901;i g&#7885;i h&#7879; th&#7889;ng</a></P>
</STRONG>
</FONT><blockquote>
<I><B><P ALIGN="JUSTIFY">L&#7901;i g&#7885;i h&#7879; th&#7889;ng</B></I> cung c&#7845;p m&#7897;t giao ti&#7871;p gi&#7919;a ti&#7871;n tr&igrave;nh v&agrave; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh. L&#7901;i g&#7885;i n&agrave;y c&#361;ng nh&#432; c&aacute;c l&#7879;nh h&#7907;p ng&#7919;.</P>
<P ALIGN="JUSTIFY">M&#7897;t s&#7889; h&#7879; th&#7889;ng cho ph&eacute;p l&#7901;i g&#7885;i h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n t&#7915; c&#7845;p l&#7853;p tr&igrave;nh ng&ocirc;n ng&#7919; c&#7845;p cao, nh&#432; c&aacute;c h&agrave;m v&agrave; l&#7901;i g&#7885;i h&agrave;m. N&oacute; c&oacute; th&#7875; ph&aacute;t sinh l&#7901;i g&#7885;i t&#7915; c&aacute;c th&#7911; t&#7909;c hay g&#7885;i tr&#7921;c ti&#7871;p trong d&ograve;ng.</P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#7875; hi&#7875;u quá tr</FONT>&igrave;nh ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng c&#7911;a l&#7901;i g&#7885;i h&#7879; th&#7889;ng chúng ta c</FONT>&ugrave;ng kh&#7843;o s&aacute;t m&#7897;t ch&#432;&#417;ng tr&igrave;nh nh&#7887; d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7875; &#273;&#7885;c d&#7919; li&#7879;u </FONT>t&#7915; m&#7897;t t&#7853;p tin ch&eacute;p qua t&#7853;p tin kh&aacute;c. D&#7919; li&#7879;u nh&#7853;p <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n c&#7911;a c&#7911;a ch&#432;&#417;ng tr&igrave;nh l&agrave; t&ecirc;n c&#7911;a hai t&#7853;p tin : t&#7853;p tin nh&#7853;p v&agrave; t&#7853;p tin xu&#7845;t. T&ecirc;n n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c m&ocirc; t&#7843; b&#7857;ng nhi&#7873;u c&aacute;ch t&ugrave;y thu&#7897;c v&agrave;o thi&#7871;t k&#7871; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh nh&#432; : ch&#432;&#417;ng tr&igrave;nh y&ecirc;u c&#7847;u ng&#432;&#7901;i s&#7917; d&#7909;ng cho bi&#7871;t t&ecirc;n c&#7911;a hai t&#7853;p tin, h&#7885; c&#361;ng c&oacute; th&#7875; cung c&#7845;p b&#7857;ng c&aacute;ch l&#7921;a ch&#7885;n v&#7899;i chu&#7897;t. Khi c&oacute; t&ecirc;n c&#7911;a hai t&#7853;p tin, ch&#432;&#417;ng tr&igrave;nh m&#7903; t&#7853;p tin nh&#7853;p v&agrave; t&#7841;o t&#7853;p tin xu&#7845;t. M&#7895;i thao t&aacute;c n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n b&#7903;i nh&#7919;ng l&#7901;i  g&#7885;i h&#7879; th&#7889;ng kh&aacute;c. C&#361;ng c&oacute; nh&#7919;ng tr&#432;&#7901;ng h&#7907;p ph&aacute;t sinh l&#7895;i : Khi ch&#432;&#417;ng tr&igrave;nh m&#7903; t&#7853;p tin nh&#7853;p, c&oacute; th&#7875; x&#7843;y ra tr&#432;&#7901;ng h&#7907;p kh&ocirc;ng c&oacute; t&#7853;p tin c&oacute; t&ecirc;n nh&#432; m&ocirc; t&#7843; ho&#7863;c t&#7853;p tin b&#7883; c&#7845;m truy c&#7853;p. Trong tr&#432;&#7901;ng h&#7907;p n&agrave;y ch&#432;&#417;ng tr&igrave;nh ph&#7843;i xu&#7845;t th&ocirc;ng <FONT FACE="Times New Roman">&#273;i&#7879;p l</FONT>&ecirc;n m&agrave;n h&igrave;nh. N&#7871;u t&#7853;p tin nh&#7853;p t&#7891;n t&#7841;i, ph&#7843;i t&#7841;o t&#7853;p tin m&#7899;i. H&#7879; th&#7889;ng ph&#7843;i ki&#7875;m tra ti&#7871;p xem <FONT FACE="Times New Roman">&#273;</FONT>&atilde; c&oacute; t&#7853;p tin xu&#7845;t t&#7891;n t&#7841;i kh&ocirc;ng v&agrave; s&#7869; c&oacute; nh&#7919;ng l&#7901;i g&#7885;i h&#7879; th&#7889;ng t&#432;&#417;ng &#7913;ng <FONT FACE="Times New Roman">&#273;&#7875; gi&#7843;i quy&#7871;t ho&#7863;c l</FONT>&agrave; h&#7911;y ti&#7871;n tr&igrave;nh, hai l&agrave; x&oacute;a t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&atilde; t&#7891;n t&#7841;i v&agrave; t&#7841;o t&#7853;p tin m&#7899;i. Sau khi <FONT FACE="Times New Roman">&#273;</FONT>&atilde; thi&#7871;t l&#7853;p xong t&#7853;p tin, h&#7879; th&#7889;ng ti&#7871;p t&#7909;c t&#7841;o v&ograve;ng l&#7863;p <FONT FACE="Times New Roman">&#273;&#7885;c d&#7919; li&#7879;u t&#7915; t&#7853;p tin nh&#7853;n v</FONT>&agrave; ghi l&ecirc;n t&#7853;p tin xu&#7845;t. M&#7895;i b&#432;&#7899;c <FONT FACE="Times New Roman">&#273;&#7873;u có ki&#7875;m tra l&#7895;i. Sau khi chép xong, ch</FONT>&#432;&#417;ng tr&igrave;nh s&#7869; <FONT FACE="Times New Roman">&#273;óng hai t&#7853;p tin l&#7841;i (d</FONT>&ugrave;ng m&#7897;t l&#7901;i g&#7885;i h&#7879; th&#7889;ng kh&aacute;c), xu&#7845;t th&ocirc;ng b&aacute;o l&ecirc;n m&agrave;n h&igrave;nh (d&ugrave;ng l&#7901;i g&#7885;i h&#7879; th&#7889;ng) cu&#7889;i c&ugrave;ng ch&#7845;m d&#7913;t ch&#432;&#417;ng tr&igrave;nh (l&#7901;i g&#7885;i h&#7879; th&#7889;ng cu&#7889;i c&ugrave;ng). </P>
<P ALIGN="JUSTIFY">Trong c&aacute;c ng&ocirc;n ng&#7919; l&#7853;p tr&igrave;nh c&#7845;p cao, ng&#432;&#7901;i s&#7917; d&#7909;ng kh&ocirc;ng c&#7847;n quan t&acirc;m <FONT FACE="Times New Roman">&#273;&#7871;n chi ti&#7871;t m</FONT>&agrave; ch&#7881; c&#7847;n th&ocirc;ng qua c&aacute;c h&agrave;m hay c&aacute;c l&#7879;nh <FONT FACE="Times New Roman">&#273;&#7875; th&#7921;c hi&#7879;n.L&#7901;i g&#7885;i h&#7879; th&#7889;ng có th&#7875; di&#7877;n ra theo m&#7897;t cách khác. Ki&#7875;u v</FONT>&agrave; kh&#7889;i l&#432;&#7907;ng th&ocirc;ng tin t&ugrave;y thu&#7897;c v&agrave;o h&#7879; th&#7889;ng v&agrave; l&uacute;c g&#7885;i.</P>
<P ALIGN="JUSTIFY">C&oacute; ba ph&#432;&#417;ng ph&aacute;p <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7875; chuy&#7875;n tham s&#7889; cho </FONT>h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh. C&aacute;ch <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n nh&#7845;t l&agrave; chuy&#7875;n tham s&#7889; v&agrave;o thanh ghi. N&#7871;u c&oacute; nhi&#7873;u tham s&#7889;, n&oacute; s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; trong kh&#7889;i ho&#7863;c b&#7843;ng trong b&#7897; nh&#7899;. C&aacute;ch cu&#7889;i c&ugrave;ng l&agrave; d&ugrave;ng c&#417; ch&#7871; stack.&nbsp;</P>
<P ALIGN="JUSTIFY">L&#7901;i g&#7885;i h&#7879; th&#7889;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia th&agrave;nh c&aacute;c lo&#7841;i : ki&#7875;m so&aacute;t ti&#7871;n tr&igrave;nh, thao t&aacute;c t&#7853;p tin, thao t&aacute;c thi&#7871;t b&#7883;, th&ocirc;ng tin.</P><FONT SIZE=4><STRONG></blockquote>

<P ALIGN="JUSTIFY" class="cap2"><a name="cautrucht"><img border="0" src="images/read_single.gif" width="15" height="12">
III.4 C&#7845;u tr&uacute;c h&#7879; th&#7889;ng</a></P></STRONG></FONT><B><P>&nbsp;&nbsp;&nbsp;
<img border="0" src="images/bullet.gif" width="12" height="14">  C&#7845;u tr&uacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n</P>

</B><blockquote>

<P ALIGN="JUSTIFY">C&#7845;u tr&uacute;c n&agrave;y trong m&#7897;t s&#7889; h&#7879; th&#7889;ng th&#432;&#417;ng m&#7841;i v&agrave; kh&ocirc;ng c&oacute; c&#7845;u tr&uacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a t&#7889;t. Thông th</FONT>&#432;&#7901;ng h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u l</FONT>&agrave; m&#7897;t h&#7879; th&#7889;ng nh&#7887;, <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n v&agrave; c&oacute; gi&#7899;i h&#7841;n.</P>
<P ALIGN="JUSTIFY">MS-DOS l&agrave; m&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&oacute; c&#7845;u tr&uacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n, n&oacute; cung c&#7845;p nh&#7919;ng ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7847;n thi&#7871;t nh&#7845;t trong m&#7897;t không gian nh&#7887; nh&#7845;t do s&#7921; gi&#7899;i h&#7841;n c&#7911;a ph&#7847;n c&#7913;ng m</FONT>&agrave; n&oacute; ch&#7841;y tr&ecirc;n <FONT FACE="Times New Roman">&#273;ó v</FONT>&agrave; kh&ocirc;ng chia th&agrave;nh nh&#7919;ng <FONT FACE="Times New Roman">&#273;</FONT>&#417;n th&#7875; r&otilde; r&#7879;t.</P>
<P ALIGN="center"><img border="0" src="images/hinh1.2.gif" width="329" height="243"></P>
<P ALIGN="center"><b>Hình 1.2 </b>C&#7845;u trúc c&#7911;a MS-DOS</P>
<P ALIGN="JUSTIFY">M&#7863;c d&ugrave; MS-DOS c&oacute; c&#7845;u tr&uacute;c nh&#432;ng gi&#7919;a giao di&#7879;n v&agrave; ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng không có s&#7921; phân chia r</FONT>&otilde; r&#7879;t. C&aacute;c ch&#432;&#417;ng tr&igrave;nh &#7913;ng d&#7909;ng c&oacute; th&#7875; truy xu&#7845;t tr&#7921;c ti&#7871;p c&aacute;c th&#7911; t&#7909;c nh&#7853;p xu&#7845;t c&#417; b&#7843;n v&agrave; ghi tr&#7921;c ti&#7871;p l&ecirc;n m&agrave;n h&igrave;nh hay b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n &#273;&#297;a.</FONT>&nbsp;</P>
<P ALIGN="JUSTIFY">M&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#361;ng c&oacute; c&#7845;u tr&uacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n l&agrave; UNIX v&#7899;i nh&#7919;ng version <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n. C&#7845;u tr&uacute;c c&#7911;a n&oacute; ch&#7881; bao g&#7891;m hai ph&#7847;n : h&#7841;t nh&acirc;n v&agrave; c&aacute;c ch&#432;&#417;ng tr&igrave;nh h&#7879; th&#7889;ng. H&#7841;t nh&acirc;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia th&agrave;nh m&#7897;t chu&#7895;i giao ti&#7871;p v&agrave; device driver(b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883;, xem b</FONT>&agrave;i XI).</P>
<P ALIGN="center"><img border="0" src="images/hinh1.3.gif" width="438" height="329"></P><P ALIGN="JUSTIFY">Nh&#7919;ng g&igrave; d&#432;&#7899;i l&#7901;i g&#7885;i h&#7879; th&#7889;ng v&agrave; tr&ecirc;n ph&#7847;n c&#7913;ng l&agrave; <B><I>h&#7841;t nh&acirc;n</B></I>. H&#7841;t nh&acirc;n cung c&#7845;p h&#7879; th&#7889;ng t&#7853;p tin, l&#7853;p l&#7883;ch CPU, qu&#7843;n tr&#7883; b&#7897; nh&#7899; v&agrave; nh&#7919;ng ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh kh&aacute;c th&ocirc;ng qua l&#7901;i g&#7885;i h&#7879; th&#7889;ng. T&oacute;m l&#7841;i l&agrave; to&agrave;n b&#7897; ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a h&#7879; th&#7889;ng &#273;</FONT>&#432;&#7907;c k&#7871;t h&#7907;p trong m&#7897;t l&#7899;p. Nh&#7919;ng ch&#432;&#417;ng tr&igrave;nh h&#7879; th&#7889;ng d&ugrave;ng nh&#7919;ng l&#7901;i g&#7885;i h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c h&#7895; tr&#7907; b&#7903;i h&#7841;t nh&acirc;n <FONT FACE="Times New Roman">&#273;&#7875; cung c&#7845;p nh&#7919;ng ch&#7913;c n&#259;ng h&#7919;u ích nh</FONT>&#432; bi&ecirc;n d&#7883;ch v&agrave; thao t&aacute;c t&#7853;p tin. L&#7901;i g&#7885;i h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a m&#7897;t giao ti&#7871;p l&#7853;p tr</FONT>&igrave;nh cho UNIX, <FONT FACE="Times New Roman">&#273;ó l</FONT>&agrave; t&#7853;p h&#7907;p nh&#7919;ng ch&#432;&#417;ng tr&igrave;nh h&#7879; th&#7889;ng th&ocirc;ng th&#432;&#7901;ng trong <FONT FACE="Times New Roman">&#273;ó có &#273;&#7883;nh ngh&#297;a giao ti&#7871;p v&#7899;i ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng.</P>
<B></blockquote>

<P>&nbsp;&nbsp;&nbsp;
<img border="0" src="images/bullet.gif" width="12" height="14">  C&#7845;u tr&uacute;c theo l&#7899;p</P>

</B><blockquote>

<P ALIGN="JUSTIFY">Nh&#7919;ng version m&#7899;i c&#7911;a UNIX <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi&#7871;t k&#7871; <FONT FACE="Times New Roman">&#273;&#7875; s&#7917; d&#7909;ng ph&#7847;n c&#7913;ng ph&#7913;c t&#7841;p h</FONT>&#417;n, do <FONT FACE="Times New Roman">&#273;ó h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia th&agrave;nh nhi&#7873;u ph&#7847;n nh&#7887; h&#417;n.</P>
<P ALIGN="JUSTIFY">B&#7857;ng c&aacute;ch s&#7917; d&#7909;ng k&#7929; thu&#7853;t <I>topdown</I>, nh&#7919;ng ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng v</FONT>&agrave; <FONT FACE="Times New Roman">&#273;&#7863;c tính c&#7911;a h&#7879; th&#7889;ng &#273;</FONT>&#432;&#7907;c chia l&agrave;m nhi&#7873;u th&agrave;nh ph&#7847;n nh&#7887;. Che d&#7845;u th&ocirc;ng tin, kh&ocirc;ng cho ch&#432;&#417;ng tr&igrave;nh c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng c&oacute; th&#7875; c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t nh&#7919;ng h</FONT>&agrave;m truy xu&#7845;t c&#7845;p th&#7845;p , thay v&agrave;o <FONT FACE="Times New Roman">&#273;ó l</FONT>&agrave; nh&#7919;ng l&#7899;p giao ti&#7871;p b&ecirc;n trong.</P>
<P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia th&agrave;nh nhi&#7873;u l&#7899;p. L&#7899;p d&#432;&#7899;i c&ugrave;ng l&agrave; ph&#7847;n c&#7913;ng, l&#7899;p tr&ecirc;n c&ugrave;ng l&agrave; giao ti&#7871;p v&#7899;i ng&#432;&#7901;i s&#7917; d&#7909;ng. L&#7899;p h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t th</FONT>&agrave;nh nh&#7919;ng <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng tr&#7915;u t&#432;&#7907;ng. Th&ocirc;ng th&#432;&#7901;ng m&#7897;t l&#7899;p c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh bao g&#7891;m m&#7897;t s&#7889; c&#7845;u tr&uacute;c d&#7919; li&#7879;u v&agrave; c&aacute;c h&agrave;m c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i b&#7903;i l&#7899;p &#7903; tr&ecirc;n v&agrave; b&#7843;n th&acirc;n n&oacute; g&#7885;i nh&#7919;ng ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a l&#7899;p b</FONT>&ecirc;n d&#432;&#7899;i. M&#7895;i l&#7899;p c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t ch&#7881; s&#7917; d&#7909;ng nh&#7919;ng thao tác do l&#7899;p d</FONT>&#432;&#7899;i cung c&#7845;p. M&#7897;t l&#7899;p c&#361;ng kh&ocirc;ng c&#7847;n bi&#7871;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t nh</FONT>&#432; th&#7871; n&agrave;o, n&oacute; ch&#7881; c&#7847;n bi&#7871;t nh&#7919;ng thao t&aacute;c n&agrave;y l&agrave;m g&igrave; th&ocirc;i.</P>
<P ALIGN="JUSTIFY">C&#7845;u tr&uacute;c l&#7899;p n&agrave;y l&#7847;n <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi&#7871;t k&#7871; v&agrave; &aacute;p d&#7909;ng cho h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh THE (Technische Hogeschool Eindhoven). H&#7879; th&#7889;ng n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia th&agrave;nh s&aacute;u l&#7899;p nh&#432; h&igrave;nh sau:</P>
<P ALIGN="center"><img border="0" src="images/hinh1.4.gif" width="319" height="181"></P>
<P ALIGN="JUSTIFY">L&#7899;p d&#432;&#7899;i c&ugrave;ng l&agrave; ph&#7847;n c&#7913;ng, l&#7899;p k&#7871; ti&#7871;p c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t l&#7853;p l&#7883;ch  CPU, l&#7899;p ti&#7871;p theo c</FONT>&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t qu&#7843;n lý b&#7897; nh&#7899;. B&#7897; nh&#7899; &#7903; &#273;ây l</FONT>&agrave; b&#7897; nh&#7899; &#7843;o. L&#7899;p ti&#7871;p n&#7919;a ch&#7913;a device driver cho c&aacute;c thao t&aacute;c v&#7899;i m&agrave;n h&igrave;nh. L&#7899;p k&#7871; l&agrave; t&#7893; ch&#7913;c buffer cho vi&#7879;c nh&#7853;p xu&#7845;t thi&#7871;t b&#7883;. Cu&#7889;i c&ugrave;ng l&agrave; ch&#432;&#417;ng tr&igrave;nh c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng.</P>
<P ALIGN="JUSTIFY">C&aacute;c v&iacute; d&#7909; kh&aacute;c nh&#432; c&#7845;u tr&uacute;c l&#7899;p c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh VENUS v&agrave; OS/2</P>
<P ALIGN="center"><img border="0" src="images/hinh1.5.gif" width="313" height="206"></P>
<P ALIGN="center"><img border="0" src="images/hinh1.6.gif" width="416" height="387"></P>
<P ALIGN="center"><b>Hình 1.6 </b>C&#7845;u trúc l&#7899;p c&#7911;a OS/2</P>
<B></blockquote>

<P>&nbsp;&nbsp;&nbsp;
<img border="0" src="images/bullet.gif" width="12" height="14">  M&aacute;y &#7843;o </P>

</B><blockquote>

<P ALIGN="JUSTIFY">Th&ocirc;ng th&#432;&#7901;ng, m&#7897;t h&#7879; th&#7889;ng m&aacute;y t&iacute;nh bao g&#7891;m nhi&#7873;u l&#7899;p. Ph&#7847;n c&#7913;ng &#7903; l&#7899;p th&#7845;p nh&#7845;t. H&#7841;t nh&acirc;n &#7903; l&#7899;p k&#7871; d&ugrave;ng c&aacute;c ch&#7881; th&#7883; c&#7911;a ph&#7847;n c&#7913;ng <FONT FACE="Times New Roman">&#273;&#7875; t&#7841;o m&#7897;t t&#7853;p h&#7907;p các l&#7901;i g&#7885;i h&#7879; th&#7889;ng. Các ch</FONT>&#432;&#417;ng tr&igrave;nh h&#7879; th&#7889;ng c&oacute; th&#7875; s&#7917; d&#7909;ng ho&#7863;c l&agrave; c&aacute;c l&#7901;i g&#7885;i h&#7879; th&#7889;ng ho&#7863;c l&agrave; c&aacute;c ch&#7881; th&#7883; c&#7911;a ph&#7847;n c&#7913;ng. V&igrave; v&#7853;y n&oacute; xem ph&#7847;n c&#7913;ng v&agrave; l&#7901;i g&#7885;i h&#7879; th&#7889;ng nh&#432; c&ugrave;ng l&#7899;p.</P>
<P ALIGN="JUSTIFY">M&#7897;t s&#7889; h&#7879; th&#7889;ng c&oacute; t&#7893; ch&#7913;c sao cho c&aacute;c ch&#432;&#417;ng tr&igrave;nh &#7913;ng d&#7909;ng c&oacute; th&#7875; g&#7885;i d&#7877; d&agrave;ng c&aacute;c ch&#432;&#417;ng tr&igrave;nh h&#7879; th&#7889;ng. M&#7863;c d&ugrave; ch&#432;&#417;ng tr&igrave;nh h&#7879; th&#7889;ng &#7903; l&#7899;p cao h&#417;n c&aacute;c ph&#7847;n kh&aacute;c nh&#432;ng ch&#432;&#417;ng tr&igrave;nh &#7913;ng d&#7909;ng c&oacute; th&#7875; xem m&#7885;i ph&#7847;n d&#432;&#7899;i n&oacute; l&agrave; m&#7897;t ph&#7847;n c&#7911;a m&aacute;y. L&#7899;p &#7913;ng d&#7909;ng n&agrave;y s&#7917; d&#7909;ng m&#7897;t kh&aacute;i ni&#7879;m l&agrave; m&aacute;y &#7843;o. V&iacute; d&#7909; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh m&aacute;y &#7843;o c&#7911;a IBM.</P>
<P ALIGN="JUSTIFY">B&#7857;ng c&aacute;ch s&#7917; d&#7909;ng l&#7853;p l&#7883;ch cho CPU v&agrave; k&#7929; thu&#7853;t b&#7897; nh&#7899; &#7843;o, m&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&oacute; th&#7875; t&#7841;o nhi&#7873;u ti&#7871;n tr&igrave;nh ph&#7913;c &#7843;o, m&#7895;i c&aacute;i s&#7869; th&#7921;c hi&#7879;n tr&ecirc;n m&#7897;t b&#7897; x&#7917; l&yacute; v&agrave; b&#7897; nh&#7899; ri&ecirc;ng. Nh&#7919;ng ti&#7871;n tr&igrave;nh n&agrave;y c&oacute; nh&#7919;ng <FONT FACE="Times New Roman">&#273;&#7863;c &#273;i&#7875;m ri</FONT>&ecirc;ng nh&#432; l&#7901;i g&#7885;i h&#7879; th&#7889;ng v&agrave; h&#7879; th&#7889;ng t&#7853;p tin kh&ocirc;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c cung c&#7845;p ph&#7847;n c&#7913;ng tr&#7921;c ti&#7871;p.&nbsp;</P>
<P ALIGN="JUSTIFY">T&agrave;i nguy&ecirc;n c&#7911;a h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia x&#7867; <FONT FACE="Times New Roman">&#273;&#7875; t&#7841;o nh&#7919;ng máy &#7843;o. L&#7853;p l&#7883;ch CPU chia x&#7867; CPU cho các ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng. Spooling v&agrave; h&#7879; th&#7889;ng t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia th&agrave;nh nh&#7919;ng card <FONT FACE="Times New Roman">&#273;&#7885;c &#7843;o v</FONT>&agrave; m&aacute;y in &#7843;o. M&#7897;t terminal cung c&#7845;p c&aacute;c ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng t&#7841;o các thao tác m</FONT>&agrave;n h&igrave;nh &#7843;o.</P>
<P ALIGN="JUSTIFY">V&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; ph&#7913;c t&#7841;p nh&#7845;t c&#7911;a máy &#7843;o l</FONT>&agrave; h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#297;a. Gi&#7843; s&#7917; h&#7879; th&#7889;ng ch&#7881; có ba b&#7897; &#273;i&#7873;u khi&#7875;n &#273;&#297;a nh</FONT>&#432;ng c&oacute; t&#7899;i b&#7843;y m&aacute;y &#7843;o. Nh&#432; v&#7853;y kh&ocirc;ng th&#7875; g&aacute;n cho m&#7895;i m&aacute;y &#7843;o m&#7897;t b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n &#273;&#297;a v</FONT>&agrave; gi&#7843;i ph&aacute;p l&agrave; x&acirc;y d&#7921;ng h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#297;a &#7843;o.</P>
</FONT><P ALIGN="JUSTIFY">M&#7863;c d&ugrave; kh&aacute;i ni&#7879;m m&aacute;y &#7843;o r&#7845;t h&#7919;u &iacute;ch nh&#432;ng kh&oacute; c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t. Máy &#7843;o ph&#7843;i th&#7921;c hi&#7879;n &#7903; hai d&#7841;ng: d&#7841;ng giám sát (monitor) v</FONT>&agrave; d&#7841;ng ng&#432;&#7901;i s&#7917; d&#7909;ng. Ngo&agrave;i ra m&aacute;y &#7843;o c&ograve;n ph&#7843;i gi&#7843;i quy&#7871;t c&aacute;c v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; v&#7873; v&#7853;n chuy&#7875;n d&#7919; li&#7879;u v</FONT>&agrave; th&#7901;i gian.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/hinh1.7.gif" width="438" height="346"></P>
<B>
</blockquote>
<P>&nbsp;&nbsp;&nbsp;
<img border="0" src="images/bullet.gif" width="12" height="14">  M&ocirc; h&igrave;nh Client-Server</P>
</B><blockquote>

<P ALIGN="JUSTIFY">Khuynh h&#432;&#7899;ng c&#7911;a c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh hi&#7879;n <FONT FACE="Times New Roman">&#273;&#7841;i l</FONT>&agrave; chuy&#7875;n d&#7847;n c&aacute;c <FONT FACE="Times New Roman">&#273;o&#7841;n m</FONT>&atilde; c&#7911;a h&#7879; th&#7889;ng l&ecirc;n nh&#7919;ng l&#7899;p cao h&#417;n v&agrave; b&#7887; d&#7847;n c&aacute;c ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng trong h&#7841;t nhân, ch&#7881; c</FONT>&ograve;n l&#7841;i m&#7897;t h&#7841;t nh&acirc;n t&#7889;i thi&#7875;u. C&aacute;ch ti&#7871;p c&#7853;n l&agrave; c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t h&#7847;u h&#7871;t nh&#7919;ng ch&#7913;c n&#259;ng c&#7911;a h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh trong c&aacute;c x&#7917; l&yacute; c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng. <FONT FACE="Times New Roman">&#272;&#7875; y</FONT>&ecirc;u c&#7847;u m&#7897;t d&#7883;ch v&#7909;, nh&#432; <FONT FACE="Times New Roman">&#273;&#7885;c m&#7897;t kh&#7889;i t&#7915; t&#7853;p tin, m&#7897;t x&#7917; lý c&#7911;a ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng (c&ograve;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; ti&#7871;n tr&igrave;nh client) s&#7869; g&#7917;i nh&#7919;ng y&ecirc;u c&#7847;u <FONT FACE="Times New Roman">&#273;ó cho m&#7897;t x&#7917; lý c&#7911;a b&#7897; ph&#7853;n d&#7883;ch v&#7909; (c</FONT>&ograve;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; ti&#7871;n tr&igrave;nh server). Sau <FONT FACE="Times New Roman">&#273;ó, nó s&#7869; th&#7921;c hi&#7879;n v</FONT>&agrave; g&#7917;i k&#7871;t qu&#7843; tr&#7903; l&#7841;i.</P>
<P ALIGN="JUSTIFY">Trong m&ocirc; h&igrave;nh n&agrave;y, ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a h&#7841;t nhân ch&#7881; l</FONT>&agrave; ki&#7875;m so&aacute;t qu&aacute; tr&igrave;nh th&ocirc;ng tin gi&#7919;a client v&agrave; server. B&#7857;ng c&aacute;ch chia h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh th&agrave;nh nh&#7919;ng ph&#7847;n nh&#7887;, m&#7895;i ph&#7847;n ch&#7881; ki&#7875;m so&aacute;t m&#7897;t m&#7863;t c&#7911;a h&#7879; th&#7889;ng nh&#432; c&aacute;c d&#7883;ch v&#7909; v&#7873; t&#7853;p tin, ti&#7871;n tr&igrave;nh, terminal, b&#7897; nh&#7899;, m&#7895;i ph&#7847;n s&#7869; g&#7885;n h&#417;n v&agrave; d&#7875; qu&#7843;n l&yacute; h&#417;n. H&#417;n n&#7919;a, t&#7845;t c&#7843; server th&#7921;c hi&#7879;n nh&#432; nh&#7919;ng ti&#7871;n tr&igrave;nh &#7903; m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; ng</FONT>&#432;&#7901;i d&ugrave;ng (user-mode) kh&ocirc;ng ph&#7843;i &#7903; m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; h&#7841;t nhân (kernel-mode), n</FONT>&ecirc;n n&oacute; kh&ocirc;ng truy xu&#7845;t tr&#7921;c ti&#7871;p ph&#7847;n c&#7913;ng. Do <FONT FACE="Times New Roman">&#273;ó, n&#7871;u server t&#7853;p tin b&#7883; l&#7895;i, các d&#7883;ch v&#7909; v&#7873; t&#7853;p tin có th&#7875; b&#7883; h&#7887;ng nh</FONT>&#432;ng n&oacute; th&#432;&#7901;ng kh&ocirc;ng g&acirc;y &#7843;nh h&#432;&#7903;ng <FONT FACE="Times New Roman">&#273;&#7871;n to</FONT>&agrave;n b&#7897; h&#7879; th&#7889;ng.</P>
<P ALIGN="JUSTIFY">M&#7897;t &#432;u <FONT FACE="Times New Roman">&#273;i&#7875;m khác c&#7911;a mô h</FONT>&igrave;nh client-server l&agrave; n&oacute; c&oacute; th&#7875; t&#432;&#417;ng th&iacute;ch d&#7875; d&agrave;ng v&#7899;i m&ocirc; h&igrave;nh h&#7879; th&#7889;ng ph&acirc;n t&aacute;n. N&#7871;u m&#7897;t client giao ti&#7871;p v&#7899;i m&#7897;t server b&#7857;ng c&aacute;ch g&#7917;i nh&#7919;ng th&ocirc;ng <FONT FACE="Times New Roman">&#273;i&#7879;p, h&#7885; không bi&#7871;t l</FONT>&agrave; khi n&agrave;o th&ocirc;ng <FONT FACE="Times New Roman">&#273;i&#7879;p &#273;ó &#273;ang &#273;</FONT>&#432;&#7907;c x&#7917; l&yacute; c&#7909;c b&#7897; t&#7841;i m&aacute;y hay <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7917;i v&agrave;o m&#7841;ng <FONT FACE="Times New Roman">&#273;&#7871;n server tr</FONT>&ecirc;n m&#7897;t m&aacute;y t&#7915; xa. Khi client quan t&acirc;m <FONT FACE="Times New Roman">&#273;&#7871;n, m&#7897;t y</FONT>&ecirc;u c&#7847;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7917;i <FONT FACE="Times New Roman">&#273;i v</FONT>&agrave; m&#7897;t tr&#7843; l&#7901;i <FONT FACE="Times New Roman">&#273;áp &#7913;ng di&#7877;n ra nh</FONT>&#432; nhau.</P>


<P ALIGN="center"><img border="0" src="images/hinh1.8.gif" width="445" height="336"></P>


<P ALIGN="center"><img border="0" src="images/hinh1.81.gif" width="466" height="242"></P>


</body>

</html>
