<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<LINK REL="stylesheet" TYPE="text/css" HREF="style.css" TITLE="MTD">
<TITLE>Cac phuong phap cai dat HTQLTT</TITLE>
</HEAD>
<BODY LINK="#0000ff">

<B><P ALIGN="CENTER"><font face="Verdana" size="2">BÀI 9</font><font size="5" face="Verdana">
C&Aacute;C PH&#431;&#416;NG PH&Aacute;P C&Agrave;I &#272;&#7862;T</font></B>

<B><font size="5" face="Verdana">H&#7878; TH&#7888;NG QU&#7842;N L&Yacute; T&#7852;P TIN</font></P>
<blockquote>
  <P ALIGN="JUSTIFY"></B><i>Ng&#432;&#7901;i s&#7917; d&#7909;ng th&igrave; quan t&acirc;m <FONT FACE="Times New Roman">&#273;&#7871;n cách &#273;&#7863;t t</FONT>&ecirc;n t&#7853;p tin, c&aacute;c thao t&aacute;c tr&ecirc;n t&#7853;p tin, c&acirc;y th&#432; m&#7909;c...Nh&#432;ng <FONT FACE="Times New Roman">&#273;&#7889;i ng</FONT>&#432;&#7901;i c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t th</FONT>&igrave; quan t&acirc;m <FONT FACE="Times New Roman">&#273;&#7871;n t&#7853;p tin v</FONT>&agrave; th&#432; m&#7909;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; nh&#432; th&#7871; n&agrave;o, v&ugrave;ng nh&#7899; tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a &#273;</FONT>&#432;&#7907;c qu&#7843;n l&yacute; nh&#432; th&#7871; n&agrave;o v&agrave; l&agrave;m sao cho to&agrave;n b&#7897; h&#7879; th&#7889;ng l&agrave;m vi&#7879;c h&#7919;u hi&#7879;u v&agrave; tin c&#7853;y. H&#7879; th&#7889;ng t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a. &#272;&#7875; gia t&#259;ng hi&#7879;u qu&#7843; trong vi&#7879;c truy xu&#7845;t, m&#7895;i &#273;</FONT>&#417;n v&#7883; d&#7919; li&#7879;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c truy xu&#7845;t g&#7885;i l&agrave; m&#7897;t kh&#7889;i. M&#7897;t kh&#7889;i d&#7919; li&#7879;u bao g&#7891;m m&#7897;t ho&#7863;c nhi&#7873;u sector. B&#7897; ph&#7853;n t&#7893; ch&#7913;c t&#7853;p tin qu&#7843;n l&yacute; vi&#7879;c l&#432;u tr&#7919; t&#7853;p tin tr&ecirc;n nh&#7919;ng kh&#7889;i v&#7853;t l&yacute; b&#7857;ng c&aacute;ch s&#7917; d&#7909;ng c&aacute;c b&#7843;ng c&oacute; c&#7845;u tr&uacute;c.
  Trong b&agrave;i h&#7885;c n&agrave;y ch&uacute;ng ta s&#7869; t&igrave;m hi&#7875;u c&aacute;c ph&#432;&#417;ng ph&aacute;p t&#7893; ch&#7913;c qu&#7843;n l&yacute; t&#7853;p tin tr&ecirc;n b&#7897; nh&#7899; ph&#7909; th&ocirc;ng qua c&aacute;c n&#7897;i dung nh&#432; sau:</i> </P>
<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#bang">B&#7843;ng
  qu&#7843;n lý th&#432; m&#7909;c, t&#7853;p tin</a> </P>
  <P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#bangphanphoi">B&#7843;ng
  phân ph&#7889;i vùng nh&#7899;</a> </P>
  <P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#chiase">T&#7853;p
  tin chia s&#7867;</a> </P>
  <P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#dia">Qu&#7843;n
  lý &#273;&#297;a</a> </P>
  <P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#doantoan">&#272;&#7897;
  an toàn c&#7911;a h&#7879; th&#7889;ng t&#7853;p tin</a> </P>
</blockquote>
</blockquote>
<DIR>
<P ALIGN="JUSTIFY">B&agrave;i h&#7885;c n&agrave;y gi&uacute;p ch&uacute;ng ta n&#7855;m <FONT FACE="Times New Roman">&#273;&#7863;c &#273;i&#7875;m c&#361;ng nh</FONT>&#432; &#432;u v&agrave; khuy&#7871;t <FONT FACE="Times New Roman">&#273;i&#7875;m c&#7911;a các ph</FONT>&#432;&#417;ng ph&aacute;p t&#7893; ch&#7913;c qu&#7843;n l&yacute; t&#7853;p tin tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a v</FONT>&agrave; m&#7897;t s&#7889; v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; li</FONT>&ecirc;n quan kh&aacute;c nh&#7901; <FONT FACE="Times New Roman">&#273;ó có th&#7875; hi&#7875;u &#273;</FONT>&#432;&#7907;c c&aacute;ch c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#7909; th&#7875; qu&#7843;n l&yacute; t&#7853;p tin nh&#432; th&#7871; n&agrave;o.</P>
<P ALIGN="JUSTIFY">B&agrave;i h&#7885;c n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&ograve;i h&#7887;i nh&#7919;ng ki&#7871;n th&#7913;c v&#7873; :m&ocirc; h&igrave;nh t&#7893; ch&#7913;c c&aacute;c t&#7853;p tin v&agrave; th&#432; m&#7909;c c&#361;ng v&agrave; m&#7897;t s&#7889; c&#7845;u tr&uacute;c d&#7919; li&#7879;u.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<STRONG></DIR>

<P ALIGN="JUSTIFY" class="cap1"><a name="bang">I.B&#7842;NG QU&#7842;N L&Yacute; TH&#431; M&#7908;C, T&#7852;P TIN</a></P></STRONG>

<FONT SIZE=4><P ALIGN="JUSTIFY" class="cap2"><STRONG><img border="0" src="images/read_single.gif" width="15" height="12">
</STRONG><b><a name="khainiem">I.1 Kh&aacute;i ni&#7879;m</a></b> </P>
<DIR>
</FONT><P ALIGN="JUSTIFY">Tr&#432;&#7899;c khi t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7885;c, t&#7853;p tin ph&#7843;i &#273;</FONT>&#432;&#7907;c m&#7903;, <FONT FACE="Times New Roman">&#273;&#7875; m&#7903; t&#7853;p tin h&#7879; th&#7889;ng ph&#7843;i bi&#7871;t &#273;</FONT>&#432;&#7901;ng d&#7851;n do ng&#432;&#7901;i s&#7917; d&#7909;ng cung c&#7845;p v&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;nh v&#7883; trong c&#7845;u trúc &#273;&#7847;u v</FONT>&agrave;o th&#432; m&#7909;c (directory entry). Directory entry cung c&#7845;p c&aacute;c th&ocirc;ng tin c&#7847;n thi&#7871;t <FONT FACE="Times New Roman">&#273;&#7875; t</FONT>&igrave;m ki&#7871;m c&aacute;c kh&#7889;i. Tu&#7923; thu&#7897;c v&agrave;o m&#7895;i h&#7879; th&#7889;ng, th&ocirc;ng tin l&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a c&#7911;a to</FONT>&agrave;n b&#7897; t&#7853;p tin, s&#7889; hi&#7879;u c&#7911;a kh&#7889;i <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n, ho&#7863;c l&agrave; s&#7889; I-node.</P></DIR>

<B>

</B><FONT SIZE=4><STRONG><P class="cap2"><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="caidat">II.2 C&agrave;i </a> </FONT><FONT FACE="Times New Roman" SIZE=4><a name="caidat">&#273;&#7863;t</a></P>

</FONT></STRONG><B><DIR>

</B><P ALIGN="JUSTIFY">B&#7843;ng n&agrave;y th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t &#7903; ph&#7847;n &#273;&#7847;u c&#7911;a &#273;&#297;a. B&#7843;ng l</FONT>&agrave; d&atilde;y c&aacute;c ph&#7847;n t&#7917; c&oacute; k&iacute;ch th&#432;&#7899;c x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh, m&#7895;i ph&#7847;n t&#7917; &#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; m&#7897;t entry. M&#7895;i entry s&#7869; l&#432;u th&ocirc;ng tin v&#7873; t&ecirc;n , thu&#7897;c t&iacute;nh, v&#7883; tr&iacute; l&#432;u tr&#7919; .... c&#7911;a m&#7897;t t&#7853;p tin hay th&#432; m&#7909;c.</P>
</DIR>

<blockquote>

<P ALIGN="JUSTIFY">V&iacute; d&#7909; qu&#7843;n l&yacute; th&#432; m&#7909;c trong CP/M&nbsp;:</P>

<P ALIGN="center"><img border="0" src="images/hinh9.1.gif" width="446" height="136"></P>
</blockquote>
<DIR>

<B>
</B><STRONG></DIR>

<P ALIGN="JUSTIFY">&nbsp;</P><P ALIGN="JUSTIFY" class="cap1"><a name="bangphanphoi">II.
B&#7842;NG PH&Acirc;N PH&#7888;I V&Ugrave;NG NH&#7898;</a></P>

<FONT SIZE=4><P ALIGN="JUSTIFY" class="cap2"><a name="khainiem1"><img border="0" src="images/read_single.gif" width="15" height="12">
II.1 Kh&aacute;i ni&#7879;m</a> </P>
<DIR>

</FONT></STRONG><P ALIGN="JUSTIFY">B&#7843;ng n&agrave;y th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;n ph&#7889;i h&#7907;p v&#7899;i b&#7843;ng qu&#7843;n l&yacute; th&#432; m&#7909;c t&#7853;p tin, m&#7909;c ti&ecirc;u l&agrave; cho bi&#7871;t v&#7883; tr&iacute; kh&#7889;i v&#7853;t l&yacute; c&#7911;a m&#7897;t t&#7853;p tin hay th&#432; m&#7909;c n&agrave;o <FONT FACE="Times New Roman">&#273;ó nói khác &#273;i l</FONT>&agrave; l&#432;u gi&#7919; d&atilde;y c&aacute;c kh&#7889;i tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a c&#7845;p phát cho t&#7853;p tin l</FONT>&#432;u d&#7919; li&#7879;u hay th&#432; m&#7909;c. C&oacute; m&#7897;t s&#7889; ph&#432;&#417;ng ph&aacute;p <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t.

</FONT></P></DIR>

<FONT SIZE=4><STRONG><P class="cap2"><a name="phuongphap"><img border="0" src="images/read_single.gif" width="15" height="12">
II.2 C&aacute;c ph&#432;&#417;ng ph&aacute;p</a></P>
</STRONG>
</FONT><B><I>
</I><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp; <img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
&#272;&#7883;nh v&#7883; li</FONT>&ecirc;n ti&#7871;p :</P>

</B>
<blockquote>
  <p ALIGN="JUSTIFY">L&#432;u tr&#7919; t&#7853;p tin tr&ecirc;n d&atilde;y c&aacute;c kh&#7889;i li&ecirc;n ti&#7871;p.</p>

<P ALIGN="JUSTIFY">Ph&#432;&#417;ng ph&aacute;p n&agrave;y c&oacute; 2 &#432;u <FONT FACE="Times New Roman">&#273;i&#7875;m </FONT>: th&#7913; nh&#7845;t, d&#7875; d&agrave;ng c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t. Th&#7913; hai, d&#7875; d</FONT>&agrave;ng thao t&aacute;c v&igrave; to&agrave;n b&#7897; t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7885;c t&#7915; &#273;&#297;a b&#7857;ng thao tác &#273;</FONT>&#417;n gi&#7843;n kh&ocirc;ng c&#7847;n <FONT FACE="Times New Roman">&#273;&#7883;nh v&#7883; l&#7841;i.</FONT>&nbsp;</P>
<P ALIGN="JUSTIFY">Ph&#432;&#417;ng ph&aacute;p n&agrave;y c&#361;ng c&oacute; 2 khuy&#7871;t <FONT FACE="Times New Roman">&#273;i&#7875;m : không linh &#273;&#7897;ng tr&#7915; khi bi&#7871;t tr</FONT>&#432;&#7899;c k&iacute;ch th&#432;&#7899;c t&#7889;i <FONT FACE="Times New Roman">&#273;a c&#7911;a t&#7853;p tin. S&#7921; phân m&#7843;nh</FONT> tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a, gây l</FONT>&atilde;ng ph&iacute; l&#7899;n.</P>
</blockquote>

<B><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp; <img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
&#272;&#7883;nh v&#7883; b&#7857;ng danh sách li</FONT>&ecirc;n k&#7871;t :</P>
<P ALIGN="center"><img border="0" src="images/hinh9.2.gif" width="438" height="360"></P>
</B>
<DIR>

<P ALIGN="JUSTIFY">M&#7885;i kh&#7889;i <FONT FACE="Times New Roman">&#273;&#7873;u &#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t, kh&ocirc;ng b&#7883; l&atilde;ng ph&iacute; trong tr&#432;&#7901;ng h&#7907;p ph&acirc;n m&#7843;nh v&agrave; directory entry ch&#7881; c&#7847;n ch&#7913;a <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#7911;a kh&#7889;i &#273;&#7847;u ti</FONT>&ecirc;n.</P>
<P ALIGN="JUSTIFY">Tuy nhi&ecirc;n kh&#7889;i d&#7919; li&#7879;u b&#7883; thu h&#7865;p l&#7841;i v&agrave; truy xu&#7845;t ng&#7851;u nhi&ecirc;n s&#7869; ch&#7853;m.</P>
<B></DIR>

<P ALIGN="JUSTIFY"><FONT FACE="Times New Roman">&nbsp;&nbsp;&nbsp; <img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
</FONT>Danh s&aacute;ch li&ecirc;n k&#7871;t s&#7917; d&#7909;ng index :</P>
</B><DIR>

<P ALIGN="center"><img border="0" src="images/hinh9.3.gif" width="432" height="433"></P>

<P ALIGN="JUSTIFY">T&#432;&#417;ng t&#7921; nh&#432; hai nh&#432;ng thay v&igrave; d&ugrave;ng con tr&#7887; th&igrave; d&ugrave;ng m&#7897;t b&#7843;ng index. Khi <FONT FACE="Times New Roman">&#273;ó to</FONT>&agrave;n b&#7897; kh&#7889;i ch&#7881; ch&#7913;a d&#7919; li&#7879;u. Truy xu&#7845;t ng&#7851;u nhi&ecirc;n s&#7869; d&#7877; d&agrave;ng h&#417;n. K&iacute;ch th&#432;&#7899;c t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c m&#7903; r&#7897;ng h&#417;n. H&#7841;n ch&#7871; l&agrave; b&#7843;n n&agrave;y b&#7883; gi&#7899;i h&#7841;n b&#7903;i k&iacute;ch th&#432;&#7899;c b&#7897; nh&#7899; .<B><I>&nbsp;</P>
</DIR>

</I><P ALIGN="JUSTIFY"><FONT FACE="Times New Roman">&nbsp;&nbsp;&nbsp; <img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
</FONT>I-nodes :</P>

</B><DIR>

<P ALIGN="JUSTIFY">M&#7897;t I-node bao g&#7891;m hai ph&#7847;n. Ph&#7847;n th&#7913; nh&#7845;t l&agrave; thu&#7897;c t&iacute;nh c&#7911;a t&#7853;p tin. Ph&#7847;n n&agrave;y l&#432;u tr&#7919; c&aacute;c th&ocirc;ng tin li&ecirc;n quan <FONT FACE="Times New Roman">&#273;&#7871;n t&#7853;p tin nh</FONT>&#432; ki&#7875;u, ng&#432;&#7901;i s&#7903; h&#7919;u, k&iacute;ch th&#432;&#7899;c, v.v...Ph&#7847;n th&#7913; hai ch&#7913;a <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#7911;a kh&#7889;i d&#7919; li&#7879;u. Ph&#7847;n n</FONT>&agrave;y chia l&agrave;m hai ph&#7847;n nh&#7887;. Ph&#7847;n nh&#7887; th&#7913; nh&#7845;t bao g&#7891;m 10 ph&#7847;n t&#7917;, m&#7895;i ph&#7847;n t&#7917; ch&#7913;a <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; kh&#7889;i d&#7919; li&#7879;u c&#7911;a </FONT>t&#7853;p tin. Ph&#7847;n t&#7917; th&#7913; 11 ch&#7913;a <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; gián ti&#7871;p c&#7845;p 1 (single indirect), ch&#7913;a &#273;&#7883;a ch&#7881; c&#7911;a m&#7897;t kh&#7889;i, tron</FONT>g kh&#7889;i <FONT FACE="Times New Roman">&#273;ó ch&#7913;a m&#7897;t b&#7843;ng có th&#7875; t&#7915;  2</FONT><SUP>10</SUP> <FONT FACE="Times New Roman">&#273;&#7871;n 2</FONT><SUP>32</SUP> ph&#7847;n t&#7917; m&agrave; m&#7895;i ph&#7847;n t&#7917; m&#7899;i ch&#7913;a <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#7911;a kh&#7889;i d&#7919; li&#7879;u. Ph&#7847;n t&#7917; th&#7913; 12 ch&#7913;a &#273;&#7883;a ch&#7881; gián ti&#7871;p c&#7845;p 2 (double indirect), ch&#7913;a &#273;&#7883;a ch&#7881; c&#7911;a b&#7843;ng các kh&#7889;i single indirect.  Ph&#7847;n t&#7917; th&#7913; 13 ch&#7913;a &#273;&#7883;a ch&#7881; gián ti&#7871;p c&#7845;p 3 (double indirect), ch&#7913;a &#273;&#7883;a ch&#7881; c&#7911;a b&#7843;ng các kh&#7889;i double indirect.
</FONT></P>
<P ALIGN="JUSTIFY">C&aacute;ch t&#7893; ch&#7913;c n&agrave;y t&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i linh &#273;&#7897;ng. Ph</FONT>&#432;&#417;ng ph&aacute;p n&agrave;y hi&#7879;u qu&#7843; trong tr&#432;&#7901;ng h&#7907;p s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7875; quán lý nh&#7919;ng h&#7879; th&#7889;ng t&#7853;p tin l&#7899;n.  H&#7879; &#273;i&#7873;u h</FONT>&agrave;nh s&#7917; d&#7909;ng ph&#432;&#417;ng ph&aacute;p n&agrave;y l&agrave; Unix (V&iacute; d&#7909; : BSD Unix)</P>
<B>
</B>
<P ALIGN="center"><img border="0" src="images/hinh9.4.gif" width="458" height="453"></P><STRONG></DIR>

<P ALIGN="JUSTIFY" class="cap1"><a name="chiase">III. T&#7852;P TIN CHIA S&#7866;</a></P></STRONG><DIR>

<P ALIGN="JUSTIFY">Khi c&oacute; nhi&#7873;u ng&#432;&#7901;i s&#7917; d&#7909;ng c&ugrave;ng l&agrave;m vi&#7879;c trong m&#7897;t <FONT FACE="Times New Roman">&#273;&#7873; án, h&#7885; c&#7847;n </FONT><B><I>chia s&#7867;</B></I> c&aacute;c t&#7853;p tin. C&aacute;ch chia s&#7867; th&ocirc;ng th&#432;&#7901;ng l&agrave; t&#7853;p tin xu&#7845;t hi&#7879;n trong c&aacute;c th&#432; m&#7909;c l&agrave; nh&#432; nhau ngh&#297;a l&agrave; m&#7897;t t&#7853;p tin c&oacute; th&#7875; li&ecirc;n k&#7871;t v&#7899;i nhi&#7873;u th&#432; m&#7909;c kh&aacute;c nhau. </P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#7875; c</FONT>&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t &#273;</FONT>&#432;&#7907;c, kh&#7889;i <FONT FACE="Times New Roman">&#273;&#297;a không &#273;</FONT>&#432;&#7907;c li&#7879;t k&ecirc; trong th&#432; m&#7909;c m&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thay th&#7871; b&#7857;ng m&#7897;t c&#7845;u tr&uacute;c d&#7919; li&#7879;u, th&#432; m&#7909;c s&#7869; tr&#7887; t&#7899;i c&#7845;u tr&uacute;c n&agrave;y. M&#7897;t c&aacute;ch kh&aacute;c l&agrave; h&#7879; th&#7889;ng t&#7841;o m&#7897;t t&#7853;p tin m&#7899;i c&oacute; ki&#7875;u LINK, t&#7853;p tin m&#7899;i n&agrave;y ch&#7881; ch&#7913;a <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng d&#7851;n c&#7911;a t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c li&ecirc;n k&#7871;t, khi c&#7847;n truy xu&#7845;t s&#7869; d&#7921;a tr&ecirc;n t&#7853;p tin LINK <FONT FACE="Times New Roman">&#273;&#7875; xác &#273;&#7883;nh t&#7853;p tin c&#7847;n truy xu&#7845;t, ph</FONT>&#432;&#417;ng ph&aacute;p n&agrave;y g&#7885;i l&agrave; li&ecirc;n k&#7871;t h&igrave;nh th&#7913;c. M&#7893;i ph&#432;&#417;ng ph&aacute;p <FONT FACE="Times New Roman">&#273;&#7873;u có nh&#7919;ng </FONT>&#432;u v&agrave; khuy&#7871;t <FONT FACE="Times New Roman">&#273;i&#7875;m ri</FONT>&ecirc;ng. </P>
<P ALIGN="JUSTIFY">&#7902; ph&#432;&#417;ng ph&aacute;p th&#7913; nh&#7845;t h&#7879; th&#7889;ng bi&#7871;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&oacute; bao nhi&ecirc;u th&#432; m&#7909;c li&ecirc;n k&#7871;t v&#7899;i t&#7853;p tin nh&#7901; v&agrave;o ch&#7881; s&#7889; li&ecirc;n k&#7871;t. &#7902; ph&#432;&#417;ng ph&aacute;p th&#7913; hai khi lo&#7841;i b&#7887; li&ecirc;n k&#7871;t h&igrave;nh th&#7913;c, t&#7853;p tin kh&ocirc;ng b&#7883; &#7843;nh h&#432;&#7903;ng.</P>
<P ALIGN="center">&nbsp;<img border="0" src="images/hinh9.51.gif" width="365" height="209"></P>
<P ALIGN="center"><img border="0" src="images/hinh9.52.gif" width="406" height="285"></P>
<P ALIGN="center"><b>Hình 9.5</b></P><STRONG></DIR>

<P ALIGN="JUSTIFY" class="cap1"><a name="dia">IV. QU&#7842;N LÝ &#272;&#296;A</a></P>
</STRONG>

<I><P ALIGN="JUSTIFY">T&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a, do &#273;ó vi&#7879;c qu&#7843;n tr&#7883; &#273;&#297;a l</FONT>&agrave; h&#7871;t s&#7913;c quan tr&#7885;ng trong vi&#7879;c c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t h&#7879; th&#7889;ng t&#7853;p tin. Có hai ph</FONT>&#432;&#417;ng ph&aacute;p l&#432;u tr&#7919; : m&#7897;t l&agrave; ch&#7913;a tu&#7847;n t&#7921; tr&ecirc;n n byte li&ecirc;n ti&#7871;p, hai l&agrave; t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia l&agrave;m th&agrave;nh t&#7915;ng kh&#7889;i. C&aacute;ch th&#7913; nh&#7845;t kh&ocirc;ng hi&#7879;u qu&#7843; khi truy xu&#7845;t nh&#7919;ng t&#7853;p tin c&oacute; k&iacute;ch th&#432;&#7899;c l&#7899;n, do <FONT FACE="Times New Roman">&#273;ó h&#7847;u h&#7871;t các h&#7879; th&#7889;ng t&#7853;p tin &#273;&#7873;u d</FONT>&ugrave;ng kh&#7889;i c&oacute; k&iacute;ch th&#432;&#7899;c c&#7889; <FONT FACE="Times New Roman">&#273;&#7883;nh.</P>

</FONT>
</I><FONT SIZE=4><STRONG><P ALIGN="JUSTIFY" class="cap2"><a name="kichthuoc"><img border="0" src="images/read_single.gif" width="15" height="12">
IV.1 K&iacute;ch th&#432;&#7899;c kh&#7889;i</a> </P>
</STRONG></FONT><DIR>

<P ALIGN="JUSTIFY">M&#7897;t v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; &#273;&#7863;t ra l</FONT>&agrave; k&iacute;ch th&#432;&#7899;c kh&#7889;i ph&#7843;i b&#7857;ng bao nhi&ecirc;u. <FONT FACE="Times New Roman">&#272;i&#7873;u n</FONT>&agrave;y ph&#7909; thu&#7897;c v&agrave;o t&#7893; ch&#7913;c c&#7911;a <FONT FACE="Times New Roman">&#273;&#297;a nh</FONT>&#432; s&#7889; sector, s&#7889; track, s&#7889; cylinder. N&#7871;u d&ugrave;ng m&#7897;t cylinder cho m&#7897;t kh&#7889;i cho m&#7897;t t&#7853;p tin th&igrave; theo t&iacute;nh to&aacute;n s&#7869; l&atilde;ng ph&iacute; <FONT FACE="Times New Roman">&#273;&#7871;n 97% dung l</FONT>&#432;&#7907;ng <FONT FACE="Times New Roman">&#273;&#297;a. N</FONT>&ecirc;n th&ocirc;ng th&#432;&#7901;ng m&#7895;i t&#7853;p tin th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&ecirc;n m&#7897;t s&#7889; kh&#7889;i. V&iacute; d&#7909; m&#7897;t <FONT FACE="Times New Roman">&#273;&#297;a có 32768 byte tr</FONT>&ecirc;n m&#7897;t track, th&#7901;i gian quay l&agrave; 16.67 msec, th&#7901;i gian t&igrave;m ki&#7871;m trung b&igrave;nh l&agrave; 30 msec th&igrave; th&#7901;i gian t&iacute;nh b&#7857;ng msec <FONT FACE="Times New Roman">&#273;&#7875; &#273;&#7885;c m&#7897;t kh&#7889;i kích th</FONT>&#432;&#7899;c k byte l&agrave;  :</P>
<P ALIGN="JUSTIFY">30 + 8.3 + (k/32768) x 16.67</P>
<P ALIGN="JUSTIFY">T&#7915;  <FONT FACE="Times New Roman">&#273;ó th&#7889;ng k</FONT>&ecirc; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c k&iacute;ch th&#432;&#7899;c kh&#7889;i th&iacute;ch h&#7907;p ph&#7843;i &lt; 2K . </P>
<P ALIGN="JUSTIFY">Th&ocirc;ng th&#432;&#7901;ng k&iacute;ch th&#432;&oacute;c kh&#7889;i l&agrave; 512, 1K hay 2K.</P></DIR>

<FONT SIZE=4><STRONG><P class="cap2"><a name="luu"><img border="0" src="images/read_single.gif" width="15" height="12">
IV.2 L&#432;u gi&#7919;a c&aacute;c kh&#7889;i tr&#7889;ng</a></P>
<DIR>

</STRONG></FONT><B><I>
</B></I><P ALIGN="JUSTIFY">C&oacute; hai ph&#432;&#417;ng ph&aacute;p. M&#7897;t l&agrave; s&#7917; d&#7909;ng danh s&aacute;ch li&ecirc;n k&#7871;t c&#7911;a kh&#7889;i <FONT FACE="Times New Roman">&#273;&#297;a. M&#7895;i kh&#7889;i ch&#7913;a m&#7897;t s&#7889; các &#273;&#7883;a ch&#7881; các kh&#7889;i tr&#7889;ng. Ví d&#7909; m&#7897;t kh&#7889;i có kích th</FONT>&#432;&#7899;c 1 K c&oacute; th&#7875; l&#432;u tr&#7919; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c 511 <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; 16 bit. M&#7897;t &#273;&#297;a 20M c&#7847;n kho&#7843;ng 40 kh&#7889;i. Hai l</FONT>&agrave;, s&#7917; d&#7909;ng bitmap. M&#7897;t <FONT FACE="Times New Roman">&#273;&#297;a</FONT> n kh&#7889;i s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c &aacute;nh x&#7841; th&agrave;nh n bit v&#7899;i gi&aacute; tr&#7883; 1 l&agrave; c&ograve;n tr&#7889;ng, gi&aacute; tr&#7883; 0 l&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&atilde; l&#432;u d&#7919; li&#7879;u. Nh&#432; v&#7853;y m&#7897;t <FONT FACE="Times New Roman">&#273;&#297;a 20M c&#7847;n 20K bit &#273;&#7875; l</FONT>&#432;u tr&#7919; ngh&#297;a l&agrave; ch&#7881; c&oacute; kho&#7843;ng 3 kh&#7889;i. Ph&#432;&#417;ng ph&aacute;p th&#7913; hai n&agrave;y th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng h&#417;n.</P>
<P ALIGN="center">&nbsp;<img border="0" src="images/hinh9.6.gif" width="423" height="359"></P><FONT FACE="Times New Roman"><STRONG></DIR>

<P ALIGN="JUSTIFY" class="cap1">V. <a name="doantoan">&#272;&#7896; AN TO</a></STRONG></FONT><STRONG><a name="doantoan">&Agrave;N C&#7910;A H&#7878; TH&#7888;NG T&#7852;P TIN</a></P></STRONG><DIR>

<P ALIGN="JUSTIFY">M&#7897;t h&#7879; th&#7889;ng t&#7853;p tin b&#7883; h&#7887;ng c&ograve;n nguy hi&#7875;m h&#417;n m&aacute;y t&iacute;nh b&#7883; h&#7887;ng v&igrave; nh&#7919;ng h&#432; h&#7887;ng tr&ecirc;n thi&#7871;t b&#7883; s&#7869; &iacute;t chi ph&iacute; h&#417;n l&agrave; h&#7879; th&#7889;ng t&#7853;p tin v&igrave; n&oacute; &#7843;nh h&#432;&#7903;ng <FONT FACE="Times New Roman">&#273;&#7871;n các ph&#7847;n m&#7873;m tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;ó. H</FONT>&#417;n n&#7919;a h&#7879; th&#7889;ng t&#7853;p tin kh&ocirc;ng th&#7875; ch&#7889;ng l&#7841;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c nh&#432; h&#432; h&ograve;ng do ph&#7847;n c&#7913;ng g&acirc;y ra, v&igrave; v&#7853;y ch&uacute;ng ph&#7843;i c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t m&#7897;t s&#7889; ch&#7913;c n&#259;ng &#273;&#7875; b&#7843;o v&#7879;.</P>
</FONT><FONT SIZE=4><STRONG></DIR>

<P ALIGN="JUSTIFY" class="cap2"><a name="quanly"><img border="0" src="images/read_single.gif" width="15" height="12">
V.1 Qu&#7843;n l&yacute; kh&#7889;i b&#7883; h&#7887;ng</a> </P>
</STRONG></FONT><DIR>

<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#297;a th</FONT>&#432;&#7901;ng c&oacute; nh&#7919;ng kh&#7889;i b&#7883; h&#7887;ng trong qu&aacute; tr&igrave;nh s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t &#273;&#7889;i v&#7899;i &#273;&#297;a c&#7913;ng v</FONT>&igrave; kh&oacute; ki&#7875;m tra <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c h&#7871;t t&#7845;t c&#7843;.&nbsp;</P>
<P ALIGN="JUSTIFY">C&oacute; hai gi&#7843;i ph&aacute;p : ph&#7847;n m&#7873;m v&agrave; ph&#7847;n c&#7913;ng.</P>
<P ALIGN="JUSTIFY">Ph&#7847;n c&#7913;ng l&agrave; d&ugrave;ng m&#7897;t sector tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a &#273;&#7875; l</FONT>&#432;u gi&#7919; danh s&aacute;ch c&aacute;c kh&#7889;i b&#7883; h&#7887;ng. Khi b&#7897; ki&#7875;m so&aacute;t t&#7921;c hi&#7879;n l&#7847;n <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n, n&oacute; <FONT FACE="Times New Roman">&#273;&#7885;c nh&#7919;ng kh&#7889;i b&#7883; h&#7887;ng v</FONT>&agrave; d&ugrave;ng m&#7897;t kh&#7889;i th&#7915;a <FONT FACE="Times New Roman">&#273;&#7875; l</FONT>&#432;u gi&#7919;. T&#7915; <FONT FACE="Times New Roman">&#273;ó không cho truy c&#7853;p nh&#7919;ng kh&#7889;i h&#7887;ng n&#7919;a.
</FONT></P>
<P ALIGN="JUSTIFY">Ph&#7847;n m&#7873;m l&agrave; h&#7879; th&#7889;ng t&#7853;p tin x&acirc;y d&#7921;ng m&#7897;t t&#7853;p tin ch&#7913;a c&aacute;c kh&#7889;i h&#7887;ng. K&#7929; thu&#7853;t n&agrave;y lo&#7841;i tr&#7915; ch&uacute;ng ra kh&#7887;i danh s&aacute;ch c&aacute;c kh&#7889;i tr&#7889;ng, do <FONT FACE="Times New Roman">&#273;ó nó s&#7869; không &#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t cho t&#7853;p tin.</P></DIR>

<FONT SIZE=4><STRONG><P class="cap2"><a name="backup"><img border="0" src="images/read_single.gif" width="15" height="12">
V.2 Backup</a></P>
<DIR>

</STRONG>
</FONT><P ALIGN="JUSTIFY">M&#7863;c d&ugrave; c&oacute; c&aacute;c chi&#7871;n l&#432;&#7885;c qu&#7843;n l&yacute; c&aacute;c kh&#7889;i h&#7887;ng, nh&#432;ng m&#7897;t c&ocirc;ng vi&#7879;c h&#7871;t s&#7913;c quan tr&#7885;ng l&agrave; ph&#7843;i backup t&#7853;p tin th&#432;&#7901;ng xuy&ecirc;n.</P>
<P ALIGN="JUSTIFY">T&#7853;p tin tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a m&#7873;m &#273;</FONT>&#432;&#7907;c backup b&#7857;ng c&aacute;ch ch&eacute;p l&#7841;i to&agrave;n b&#7897; qua m&#7897;t <FONT FACE="Times New Roman">&#273;&#297;a khác. D&#7919; li&#7879;u tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a c&#7913;ng nh&#7887; th</FONT>&igrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c backup tr&ecirc;n c&aacute;c b<FONT FACE="Times New Roman">&#259;ng t&#7915;.</FONT>&nbsp;</P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#7889;i v&#7899;i các &#273;&#297;a c&#7913;ng l&#7899;n, vi&#7879;c backup th</FONT>&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ti&#7871;n h&agrave;nh ngay tr&ecirc;n n&oacute;. M&#7897;t chi&#7871;n l&#432;&#7907;c d&#7875; c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t nh</FONT>&#432;ng l&atilde;ng ph&iacute; m&#7897;t n&#7919;a <FONT FACE="Times New Roman">&#273;&#297;a l</FONT>&agrave; chia <FONT FACE="Times New Roman">&#273;&#297;a c&#7913;ng l</FONT>&agrave;m hai ph&#7847;n  m&#7897;t ph&#7847;n d&#7919; li&#7879;u v&agrave; m&#7897;t ph&#7847;n l&agrave; backup. M&#7895;i t&#7889;i, d&#7919; li&#7879;u t&#7915; ph&#7847;n d&#7919; li&#7879;u s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ch&eacute;p sang ph&#7847;n backup.</P>
<P ALIGN="center"><img border="0" src="images/hinh9.7.gif" width="353" height="250"></P>
<FONT SIZE=4><STRONG>
</DIR>

<P class="cap2"><a name="tinhkhongdoi"><img border="0" src="images/read_single.gif" width="15" height="12">
V.3 T&iacute;nh kh&ocirc;ng </a></STRONG> </FONT><STRONG><a name="tinhkhongdoi"><FONT FACE="Times New Roman" SIZE=4>&#273;&#7893;i c&#7911;a h&#7879; th&#7889;ng t&#7853;p tin</FONT></a></STRONG> </P>
<DIR>

<P ALIGN="JUSTIFY">M&#7897;t v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; n&#7919;a v&#7873; &#273;&#7897; an to</FONT>&agrave;n l&agrave; <B><I>t&iacute;nh kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7893;i</B></I></FONT>. Khi truy xu&#7845;t m&#7897;t t&#7853;p tin, trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n, n&#7871;u c&oacute; x&#7843;y ra nh&#7919;ng s&#7921; c&#7889; l&agrave;m h&#7879; th&#7889;ng ng&#7915;ng ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng &#273;&#7897;t ng&#7897;t, lúc &#273;ó h</FONT>&agrave;ng lo&#7841;t th&ocirc;ng tin ch&#432;a <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7853;p nh&#7853;t l&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a. V</FONT>&igrave; v&#7853;y m&#7895;i l&acirc;n kh&#7903;i <FONT FACE="Times New Roman">&#273;&#7897;ng ,h&#7879; th&#7889;ng s&#7869; th&#7921;c hi&#7879;n vi&#7879;c ki&#7875;m tra tr</FONT>&ecirc;n hai ph&#7847;n kh&#7889;i v&agrave; t&#7853;p tin. Vi&#7879;c ki&#7875;m tra th&#7921;c hi&#7879;n , khi ph&aacute;t hi&#7879;n ra l&#7895;i s&#7869; ti&#7871;n h&agrave;nh s&#7919;a ch&#7919;a cho c&aacute;c tr&#432;&#7901;ng h&#7907;p c&#7909; th&#7875;:</P>

<P ALIGN="center"><img border="0" src="images/hinh9.8.gif" width="498" height="456"></P>
<P ALIGN="center"><b>Hình 9.8 </b>Tr&#7841;ng thái c&#7911;a h&#7879; th&#7889;ng t&#7853;p tin</P>
</DIR>

<P ALIGN="JUSTIFY"><b><font color="#FF0000"><a name="cauhoi"><img border="0" src="images/blebul1a.gif" width="20" height="20">
<font size="4">C&acirc;u h&#7887;i ki&#7875;m tra ki&#7871;n th&#7913;c</font></a></font></b></P>
<blockquote>
  <P>1. Vai tr&ograve; c&#7911;a b&#7843;ng th&#432; m&#7909;c t&#7853;p tin</P>
<P>2. So s&aacute;nh c&aacute;c ph&#432;&#417;ng ph&aacute;p c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t b&#7843;ng phân ph&#7889;i v</FONT>&ugrave;ng nh&#7899;.</P>
<P>3. T&#7853;p tin chia s&#7867; l&agrave; g&igrave; ?</P>
<P>4. V&igrave; sao ph&#7843;i l&#432;u &yacute; <FONT FACE="Times New Roman">&#273;&#7871;n &#273;&#7897; an to</FONT>&agrave;n c&#7911;a h&#7879; th&#7889;ng t&#7853;p tin ?</P>
</blockquote>
<STRONG><P><a name="baitap"><img border="0" src="images/blebul1a.gif" width="20" height="20">
<font color="#FF0000" size="4">B&agrave;i t&#7853;p</font></a></P>
</STRONG>
<blockquote>
  <P ALIGN="JUSTIFY">&nbsp;Gi&#7843; s&#7917; m&#7897;t <FONT FACE="Times New Roman">&#273;&#297;a m&#7873;m có 2 side, m&#7895;i side có 128 track, m&#7895;i track có 18 sector. Th</FONT>&#432; m&#7909;c g&#7889;c c&#7911;a <FONT FACE="Times New Roman">&#273;&#297;a</FONT> c&oacute; t&#7889;i <FONT FACE="Times New Roman">&#273;a l</FONT>&agrave; 251 t&#7853;p tin (ho&#7863;c th&#432; m&#7909;c), m&#7895;i entry c&oacute; k&iacute;ch th&#432;&#7899;c 32 bytes. M&#7897;t cluster = 2 sector. <FONT FACE="Times New Roman">&#272;&#297;a s&#7917; d&#7909;ng ph</FONT>&#432;&#417;ng ph&aacute;p <FONT FACE="Times New Roman">&#273;&#7883;nh b&#7857;ng b&#7843;ng ch&#7881; m&#7909;c m&#7895;i ph&#7847;n t&#7917; trong b&#7843;ng có kích th</FONT>&#432;&#7899;c 12 bits. H&#7887;i mu&#7889;n truy xu&#7845;t cluster 10 th&igrave; ph&#7843;i <FONT FACE="Times New Roman">&#273;&#7885;c nh&#7919;ng sector n</FONT>&agrave;o ?</P>
<P>&nbsp; </P>
</blockquote>
<P ALIGN="JUSTIFY"></P></BODY>
</HTML>
