<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 4.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<LINK REL="stylesheet" TYPE="text/css" HREF="style.css" TITLE="MTD">
<title>Cap phat khung trang</title>
</head>

<body>

<B><P ALIGN="JUSTIFY"><font color="#FF0000" size="4" face="Verdana"><a name="capphat">III. C&#7845;p ph&aacute;t khung trang</a></font></P>
</B><P ALIGN="JUSTIFY"><font color="#000066">V&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; &#273;&#7863;t ra l</FONT>&agrave; l&agrave;m th&#7871; n&agrave;o <FONT FACE="Times New Roman">&#273;&#7875; c&#7845;p phát m&#7897;t v</FONT>&ugrave;ng nh&#7899; t&#7921; do c&oacute; k&iacute;ch th&#432;&#7899;c c&#7889; <FONT FACE="Times New Roman">&#273;&#7883;nh cho các ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c nhau?</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">Trong tr&#432;&#7901;ng h&#7907;p <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n nh&#7845;t c&#7911;a b&#7897; nh&#7899; &#7843;o l&agrave; h&#7879; <FONT FACE="Times New Roman">&#273;</FONT>&#417;n nhi&#7879;m, c&oacute; th&#7875; c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh duy nh&#7845;t c&#7911;a ng&#432;&#7901;i d&ugrave;ng t&#7845;t c&#7843; c&aacute;c khung trang tr&#7889;ng.</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">V&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; n&#7843;y sinh khi k&#7871;t h&#7907;p k&#7929; thu&#7853;t phân trang theo y</FONT>&ecirc;u c&#7847;u v&#7899;i s&#7921; <FONT FACE="Times New Roman">&#273;a ch</FONT>&#432;&#417;ng&nbsp;: c&#7847;n ph&#7843;i duy tr&igrave; nhi&#7873;u ti&#7871;n tr&igrave;nh trong b&#7897; nh&#7899; c&ugrave;ng l&uacute;c, v&#7853;y m&#7895;i ti&#7871;n tr&igrave;nh s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p bao nhi&ecirc;u khung trang.</font></P>

<B><P ALIGN="JUSTIFY"><font color="#000066">&nbsp;&nbsp;&nbsp; <img border="0" src="images/bullet.gif" width="12" height="14">
S&#7889; khung trang t&#7889;i thi&#7875;u</font></B><font color="#000066">:</font></P>
<blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">V&#7899;i m&#7895;i ti&#7871;n tr&igrave;nh, c&#7847;n ph&#7843;i c&#7845;p ph&aacute;t m&#7897;t s&#7889; khung trang t&#7889;i thi&#7875;u n&agrave;o <FONT FACE="Times New Roman">&#273;ó &#273;&#7875; ti&#7871;n tr</FONT>&igrave;nh c&oacute; th&#7875; ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng. S&#7889; khung trang t&#7889;i thi&#7875;u n</FONT>&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c quy <FONT FACE="Times New Roman">&#273;&#7883;nh b&#7903;i ki&#7871;n trúc c&#7911;a c&#7911;a m&#7897;t ch&#7881; th&#7883;.Khi m&#7897;t l&#7895;i trang x&#7843;y ra tr</FONT>&#432;&#7899;c khi ch&#7881; th&#7883; hi&#7879;n h&agrave;nh ho&agrave;n t&#7845;t, ch&#7881; th&#7883; <FONT FACE="Times New Roman">&#273;ó c&#7847;n &#273;</FONT>&#432;&#7907;c t&aacute;i kh&#7903;i <FONT FACE="Times New Roman">&#273;&#7897;ng, lúc &#273;ó c&#7847;n có &#273;&#7911; các khung trang &#273;&#7875; n&#7841;p t&#7845;t c&#7843; các trang m</FONT>&agrave; m&#7897;t ch&#7881; th&#7883; duy nh&#7845;t c&oacute; th&#7875; truy xu&#7845;t.</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">S&#7889; khung trang t&#7889;i thi&#7875;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c qui <FONT FACE="Times New Roman">&#273;&#7883;nh b&#7903;i ki&#7871;n trúc máy tính, trong khi s&#7889; khung trang t&#7889;i &#273;a &#273;</FONT>&#432;&#7907;c x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh b&#7903;i dung l</FONT>&#432;&#7907;ng b&#7897; nh&#7899; v&#7853;t l&yacute; c&oacute; th&#7875; s&#7917; d&#7909;ng.</font></P>
<B>
</blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">&nbsp;&nbsp;&nbsp; <img border="0" src="images/bullet.gif" width="12" height="14">
C&aacute;c thu&#7853;t to&aacute;n c&#7845;p ph&aacute;t khung trang</font></P>
</B><blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">C&oacute; hai h&#432;&#7899;ng ti&#7871;p c&#7853;n:</font></P><blockquote>

<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
C&#7845;p ph&aacute;t c&#7889; </font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7883;nh:</font></P><blockquote>
<blockquote>

</FONT><P ALIGN="JUSTIFY"><font color="#000066">C&#7845;p ph&aacute;t c&ocirc;ng b&#7857;ng</font></U><font color="#000066">: n&#7871;u c&oacute;   <I>m</I> khung trang v&agrave; <I>n</I> ti&#7871;n tr&igrave;nh, m&#7895;i ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p <I>m&nbsp;/n</I> khung trang.</font></P>
<U><P ALIGN="JUSTIFY"><font color="#000066">C&#7845;p ph&aacute;t theo t&#7927; l&#7879;</font></U><font color="#000066">: t&ugrave;y v&agrave;o k&iacute;ch th&#432;&#7899;c c&#7911;a ti&#7871;n tr&igrave;nh
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7875; c&#7845;p phát s&#7889; khung trang&nbsp;:</font> </P>
</FONT><I><P ALIGN="JUSTIFY"><font color="#000066">si</font></I>  <font color="#000066">  = k&iacute;ch th&#432;&#7899;c c&#7911;a b&#7897; nh&#7899; &#7843;o cho ti&#7871;n tr&igrave;nh
</font> <I><font color="#000066">pi</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">S</font></I>  <font color="#000066">  = <FONT FACE="Symbol">&#83;</FONT>
<I> si</I> </font> </P>
<I><P ALIGN="JUSTIFY"><font color="#000066">m</font></I>  <font color="#000066">  = s&#7889; l&#432;&#7907;ng t&#7893;ng c&#7897;ng khung trang c&oacute; th&#7875; s&#7917; d&#7909;ng</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066">C&#7845;p ph&aacute;t <I>ai</I> khung trang cho ti&#7871;n tr&igrave;nh <I>pi<SUB> </I></SUB> : <I>ai</I> =
(<I>si</I> / <I>S</I>) </font> <I><font color="#000066">m</font></P></blockquote>
</blockquote>

</I><U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
C&#7845;p ph&aacute;t theo <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n </font> </U><font color="#000066">: s&#7917; d&#7909;ng &yacute; t&#432;&#7903;ng c&#7845;p ph&aacute;t theo t&#7927; l&#7879;, nh&#432;ng nh&#432;ng s&#7889; l&#432;&#7907;ng khung trang c&#7845;p cho ti&#7871;n tr&igrave;nh ph&#7909; thu&#7897;c v&agrave;o <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n c&#7911;a ti&#7871;n tr&igrave;nh, h&#417;n l&agrave; ph&#7909; thu&#7897;c k&iacute;ch th&#432;&#7899;c ti&#7871;n tr&igrave;nh:</font></P><blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">N&#7871;u ti&#7871;n tr&igrave;nh <I>pi</I> ph&aacute;t sinh m&#7897;t l&#7895;i trang, ch&#7885;n m&#7897;t trong c&aacute;c khung trang c&#7911;a n&oacute; <FONT FACE="Times New Roman">&#273;&#7875; thay th&#7871;, ho&#7863;c ch&#7885;n m&#7897;t khung trang c&#7911;a ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c v&#7899;i <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n th&#7845;p h&#417;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7875; thay th&#7871;.</font></P>
<P ALIGN="JUSTIFY"></P></blockquote>
</blockquote>

</FONT><B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bullet.gif" width="12" height="14">
Thay th&#7871; trang to&agrave;n c&#7909;c hay c&#7909;c b&#7897;</font></P>
</B><P ALIGN="JUSTIFY"><font color="#000066">C&oacute; th&#7875; ph&acirc;n c&aacute;c thu&#7853;t to&aacute;n thay th&#7871; trang th&agrave;nh hai l&#7899;p ch&iacute;nh:</font></P><blockquote>

<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
Thay th&#7871; to&agrave;n c&#7909;c</font></U><font color="#000066">: khi l&#7895;i trang x&#7843;y ra v&#7899;i m&#7897;t ti&#7871;n tr&igrave;nh , ch&#7885;n trang «&nbsp;n&#7841;n nh&acirc;n&nbsp;» t&#7915; t&#7853;p t&#7845;t c&#7843; c&aacute;c khung trang trong h&#7879; th&#7889;ng, b&#7845;t k&#7875; khung trang <FONT FACE="Times New Roman">&#273;ó &#273;ang &#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t cho m&#7897;t ti&#7871;n tr&igrave;nh kh&aacute;c.</font></P>
<U><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
Thay th&#7871; c&#7909;c b&#7897;</font></U><font color="#000066">: y&ecirc;u c&#7847;u ch&#7881; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ch&#7885;n trang thay th&#7871; trong t&#7853;p c&aacute;c khung trang <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p cho ti&#7871;n tr&igrave;nh ph&aacute;t sinh l&#7895;i trang.</font></P></blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">M&#7897;t khuy&#7871;t <FONT FACE="Times New Roman">&#273;i&#7875;m c&#7911;a thu&#7853;t toán thay th&#7871; to</FONT>&agrave;n c&#7909;c l&agrave; c&aacute;c ti&#7871;n tr&igrave;nh kh&ocirc;ng th&#7875; ki&#7875;m so&aacute;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7927; l&#7879; ph&aacute;t sinh l&#7895;i trang c&#7911;a m&igrave;nh. V&igrave; th&#7871;, tuy thu&#7853;t to&aacute;n thay th&#7871; to&agrave;n c&#7909;c nh&igrave;n chung cho ph&eacute;p h&#7879; th&#7889;ng c&oacute; nhi&#7873;u kh&#7843; n<FONT FACE="Times New Roman">&#259;ng x&#7917; lý h</FONT>&#417;n, nh&#432;ng n&oacute; c&oacute; th&#7875; d&#7851;n h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#7871;n t</FONT>&igrave;nh tr&#7841;ng <I>tr&igrave; tr&#7879; to&agrave;n b&#7897;</I> (<I>thrashing</I>).</font></P>

<B>
</blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><a name="tritrue"><img border="0" src="images/read_single.gif" width="15" height="12">
 </a>
</font><a name="tritrue"><font color="#800000">III.1. Tr&igrave;  tr&#7879; to&agrave;n b&#7897; h&#7879; th&#7889;ng (Thrashing)</font></a></P>

</B>
<blockquote>
<blockquote>
  <P ALIGN="JUSTIFY"><font color="#000066">N&#7871;u m&#7897;t ti&#7871;n tr&igrave;nh kh&ocirc;ng c&oacute; <FONT FACE="Times New Roman">&#273;&#7911; các khung trang &#273;&#7875; ch&#7913;a nh&#7919;ng trang c&#7847;n thi&#7871;t cho x&#7917; lý, th</FONT>&igrave; n&oacute; s&#7869; th&#432;&#7901;ng xuy&ecirc;n ph&aacute;t sinh c&aacute;c l&#7895;i trang , v&agrave; v&igrave; th&#7871; ph&#7843;i d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7871;n r&#7845;t nhi&#7873;u th&#7901;i gian s&#7917; d&#7909;ng CPU &#273;&#7875; th&#7921;c hi&#7879;n thay th&#7871; trang. M&#7897;t ho&#7841;t &#273;&#7897;ng phân trang nh</FONT>&#432; th&#7871; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; <I>s&#7921; tr&igrave; tr&#7879;</I> ( thrashing). M&#7897;t ti&#7871;n tr&igrave;nh l&acirc;m v&agrave;o tr&#7841;ng th&aacute;i tr&igrave; tr&#7879; n&#7871;u n&oacute; s&#7917; d&#7909;ng nhi&#7873;u th&#7901;i gian <FONT FACE="Times New Roman">&#273;&#7875; thay th&#7871; trang h</FONT>&#417;n l&agrave;
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7875; x&#7917; lý&nbsp;!</font> </P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066">Hi&#7879;n t&#432;&#7907;ng tr&igrave; tr&#7879; n&agrave;y &#7843;nh h&#432;&#7903;ng nghi&ecirc;m tr&#7885;ng <FONT FACE="Times New Roman">&#273;&#7871;n ho&#7841;t &#273;&#7897;ng h&#7879; th&#7889;ng, xét t</FONT>&igrave;nh hu&#7889;ng sau&nbsp;:</font> </P><blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh gi&aacute;m s&aacute;t vi&#7879;c s&#7917; d&#7909;ng CPU.</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
N&#7871;u hi&#7879;u su&#7845;t s&#7917; d&#7909;ng CPU qu&aacute; th&#7845;p, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh s&#7869; n&acirc;ng m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; &#273;a ch</FONT>&#432;&#417;ng b&#7857;ng c&aacute;ch <FONT FACE="Times New Roman">&#273;</FONT>&#432;a th&ecirc;m m&#7897;t ti&#7871;n tr&igrave;nh m&#7899;i v&agrave;o h&#7879; th&#7889;ng.</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
H&#7879; th&#7889;ng c&oacute; th&#7875; s&#7917; d&#7909;ng thu&#7853;t to&aacute;n thay th&#7871; to&agrave;n c&#7909;c <FONT FACE="Times New Roman">&#273;&#7875; ch&#7885;n các trang n&#7841;n nhân thu&#7897;c m&#7897;t ti&#7871;n tr</FONT>&igrave;nh b&#7845;t k&#7923; <FONT FACE="Times New Roman">&#273;&#7875; có ch&#7895; n&#7841;p ti&#7871;n tr</FONT>&igrave;nh m&#7899;i, c&oacute; th&#7875; s&#7869; thay th&#7871; c&#7843; c&aacute;c trang c&#7911;a ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang x&#7917; lý hi&#7879;n h</FONT>&agrave;nh.</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
Khi c&oacute; nhi&#7873;u ti&#7871;n tr&igrave;nh trong h&#7879; th&#7889;ng h&#417;n, th&igrave; m&#7897;t ti&#7871;n tr&igrave;nh s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p &iacute;t khung trang h&#417;n, v&agrave; do <FONT FACE="Times New Roman">&#273;ó phát sinh nhi&#7873;u l&#7895;i trang h</FONT>&#417;n.</font> </P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
Khi c&aacute;c ti&#7871;n tr&igrave;nh ph&aacute;t sinh nhi&#7873;u l&#7895;i trang , ch&uacute;ng ph&#7843;i tr&#7843;i qua nhi&#7873;u th&#7901;i gian ch&#7901; c&aacute;c thao t&aacute;c thay th&#7871; trang ho&agrave;n t&#7845;t, l&uacute;c
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;ó hi&#7879;u su&#7845;t s&#7917; d&#7909;ng CPU l&#7841;i gi&#7843;m</font></P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&#7841;i quay tr&#7903; l&#7841;i b&#432;&#7899;c 1...</font> </P></blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">Theo k&#7883;ch b&#7843;n tr&ecirc;n <FONT FACE="Times New Roman">&#273;ây, h&#7879; th&#7889;ng s&#7869; lâm v</FONT>&agrave;o t&igrave;nh tr&#7841;ng lu&#7849;n qu&#7849;n&nbsp;c&#7911;a vi&#7879;c gi&#7843;i ph&oacute;ng c&aacute;c trang <FONT FACE="Times New Roman">&#273;&#7875; c&#7845;p phát th</FONT>&ecirc;m khung trang cho m&#7897;t ti&#7871;n tr&igrave;nh, v&agrave; c&aacute;c ti&#7871;n tr&igrave;nh kh&aacute;c l&#7841;i thi&#7871;u khung trang...v&agrave; c&aacute;c ti&#7871;n tr&igrave;nh kh&ocirc;ng th&#7875; ti&#7871;p t&#7909;c x&#7917; l&yacute;. <FONT FACE="Times New Roman">&#272;ây chính l</FONT>&agrave; t&igrave;nh tr&#7841;ng <I>tr&igrave; tr&#7879; to&agrave;n b&#7897;</I> h&#7879; th&#7889;ng. Khi t&igrave;nh tr&#7841;ng tr&igrave; tr&#7879; n&agrave;y x&#7843;y ra, h&#7879; th&#7889;ng g&#7847;n nh&#432; m&#7845;t kh&#7843; n<FONT FACE="Times New Roman">&#259;ng x&#7917; lý, t&#7889;c &#273;&#7897; phát sinh l&#7895;i trang t&#259;ng cao kh&#7911;ng khi&#7871;p, không công vi&#7879;c n</FONT>&agrave;o c&oacute; th&#7875; k&#7871;t th&uacute;c v&igrave; t&#7845;t c&#7843; c&aacute;c ti&#7871;n tr&igrave;nh
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7873;u b&#7853;n r&#7897;n v&#7899;i vi&#7879;c phân trang&nbsp;!</font></P>
<P ALIGN="JUSTIFY"><font color="#000066">&#272;&#7875; ng&#259;n c&#7843;n t</font></FONT><font color="#000066">&igrave;nh tr&#7841;ng tr&igrave; tr&#7879; n&agrave;y x&#7843;y ra, c&#7847;n ph&#7843;i c&#7845;p cho ti&#7871;n tr&igrave;nh <I><FONT FACE="Times New Roman">&#273;&#7911;</FONT> </I> c&aacute;c khung trang c&#7847;n thi&#7871;t <FONT FACE="Times New Roman">&#273;&#7875; ho&#7841;t &#273;&#7897;ng. V&#7845;n &#273;&#7873; c&#7847;n gi&#7843;i quy&#7871;t l</FONT>&agrave; l&agrave;m sao bi&#7871;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ti&#7871;n tr&igrave;nh c&#7847;n bao nhi&ecirc;u&nbsp;trang?</font> </P>

<B><P ALIGN="JUSTIFY"><font color="#000066">M&ocirc; h&igrave;nh c&#7909;c b&#7897; ( Locality)
</font> </B><font color="#000066">: theo l&yacute; thuy&#7871;t c&#7909;c b&#7897;, th&igrave; khi m&#7897;t ti&#7871;n tr&igrave;nh x&#7917; l&yacute;, n&oacute; c&oacute; khuynh h&#432;&#7899;ng di chuy&#7875;n t&#7915;  nh&oacute;m trang c&#7909;c b&#7897; n&agrave;y <FONT FACE="Times New Roman">&#273;&#7871;n nhóm trang c&#7909;c b&#7897; khác . M&#7897;t nhóm trang c&#7909;c b&#7897; l</FONT>&agrave; m&#7897;t t&#7853;p c&aacute;c trang <FONT FACE="Times New Roman">&#273;ang &#273;</FONT>&#432;&#7907;c ti&#7871;n tr&igrave;nh d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7871;n trong m&#7897;t kho&#7843;ng th&#7901;i gian. M&#7897;t ch</FONT>&#432;&#417;ng tr&igrave;nh th&#432;&#7901;ng bao g&#7891;m nhi&#7873;u nh&oacute;m trang c&#7909;c b&#7897; kh&aacute;c nhau v&agrave; ch&uacute;ng c&oacute; th&#7875; giao nhau.</font></P>

<B><I>

</blockquote>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
 III.1.1. M&ocirc; h&igrave;nh «&nbsp;t&#7853;p l&agrave;m vi&#7879;c&nbsp;» (working set)</font></P>

</I></B> 
<blockquote>

<B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">Ti&#7871;p c&#7853;n :</font></B> &nbsp;</P>
  <blockquote>
    <P ALIGN="JUSTIFY"> <font color="#000066"> M&ocirc; h&igrave;nh working set <FONT FACE="Times New Roman">&#273;&#7863;t c</FONT>&#417; s&#7903; tr&ecirc;n l&yacute; thuy&#7871;t c&#7909;c b&#7897;. M&ocirc; h&igrave;nh n&agrave;y s&#7917; d&#7909;ng m&#7897;t tham s&#7889; <FONT FACE="Symbol">&#68;</FONT>
, <FONT FACE="Times New Roman">&#273;&#7875; &#273;&#7883;nh ngh&#297;a m&#7897;t c&#7917;a s&#7893; cho </FONT><I>working set</I>. Gi&#7843; s&#7917; kh&#7843;o s&aacute;t  <FONT FACE="Symbol">&#68;</FONT>
 <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; th&#7901;i gian (l&#7847;n truy xu&#7845;t trang) cu&#7889;i c&ugrave;ng, t&#7853;p c&aacute;c trang <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ti&#7871;n tr&igrave;nh truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7871;n trong  <FONT FACE="Symbol">&#68;</FONT>
</FONT> l&#7847;n truy c&#7853;p cu&#7889;i c&ugrave;ng n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; <I>working set</I> c&#7911;a ti&#7871;n tr&igrave;nh t&#7841;i th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m hi&#7879;n t&#7841;i. N&#7871;u m&#7897;t</FONT> trang <FONT FACE="Times New Roman">&#273;ang &#273;</FONT>&#432;&#7907;c ti&#7871;n tr&igrave;nh truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7871;n, nó s&#7869; n&#7857;m trong working set, n&#7871;u nó không &#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng n&#7919;a , n&oacute; s&#7869; b&#7883; lo&#7841;i ra kh&#7887;i working set c&#7911;a ti&#7871;n tr&igrave;nh sau <FONT FACE="Symbol">&#68;</FONT>
 <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; th&#7901;i gian k&#7875; t&#7915; l&#7847;n truy xu&#7845;t cu&#7889;i c&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7871;n nó. Nh</FONT>&#432; v&#7853;y working set ch&iacute;nh l&agrave; m&#7897;t s&#7921; x&#7845;p x&#7881; c&#7911;a kh&aacute;i ni&#7879;m nh&oacute;m trang c&#7909;c b&#7897;.</font><center><img border="0" src="images/hinh4.30.gif" width="578" height="101"></P>

<P ALIGN="center"><font color="#000066"><b>Hình 2.30 </b>Mô hình working set</font></P>

<P ALIGN="JUSTIFY"><font color="#000066">M&#7897;t thu&#7897;c t&iacute;nh r&#7845;t quan tr&#7885;ng c&#7911;a working set l&agrave; k&iacute;ch th&#432;&#7899;c c&#7911;a n&oacute;. N&#7871;u t&iacute;nh to&aacute;n k&iacute;ch th&#432;&#7899;c working set, WSSi, cho m&#7895;i ti&#7871;n tr&igrave;nh trong h&#7879; th&#7889;ng, th&igrave; c&oacute; th&#7875; xem nh&#432;&nbsp;:</font></P>
<P ALIGN="CENTER"><font color="#000066">D = <FONT FACE="Symbol">&#83;</FONT>
 WSSi</font></P>
<P ALIGN="JUSTIFY">    <font color="#000066">    v&#7899;i D l&agrave; t&#7893;ng s&#7889; khung trang y&ecirc;u c&#7847;u cho to&agrave;n h&#7879; th&#7889;ng. M&#7895;i ti&#7871;n tr&igrave;nh s&#7917; d&#7909;ng c&aacute;c trang trong working set c&#7911;a n&oacute;, ngh&#297;a l&agrave; ti&#7871;n tr&igrave;nh  <I>i</I> y&ecirc;u c&#7847;u  <I>WSSi </I>khung trang. N&#7871;u t&#7893;ng s&#7889; trang y&ecirc;u c&#7847;u v&#432;&#7907;t qu&aacute; t&#7893;ng s&#7889; trang c&oacute; th&#7875; s&#7917; d&#7909;ng trong h&#7879; th&#7889;ng (D &gt; m), th&igrave; s&#7869; x&#7843;y ra t&igrave;nh tr&#7841;ng tr&igrave; tr&#7879; to&agrave;n b&#7897;.</font> </P>
<B>
  </blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">S&#7917; d&#7909;ng:</font></P>
</B> 
<blockquote>
<P ALIGN="JUSTIFY">&nbsp; <font color="#000066"> H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh gi&aacute;m s&aacute;t working set c&#7911;a m&#7895;i ti&#7871;n tr&igrave;nh v&agrave; c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh t&#7889;i thi&#7875;u c&aacute;c khung trang <FONT FACE="Times New Roman">&#273;&#7875; ch&#7913;a &#273;&#7911; working set c&#7911;a nó. Nh</FONT>&#432; v&#7853;y m&#7897;t ti&#7871;n tr&igrave;nh m&#7899;i ch&#7881; c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o h&#7879; th&#7889;ng khi c&oacute; <FONT FACE="Times New Roman">&#273;&#7911; khung trang t&#7921; do cho working set c&#7911;a nó. N&#7871;u t&#7893;ng s&#7889; khung trang y</FONT>&ecirc;u c&#7847;u c&#7911;a c&aacute;c ti&#7871;n tr&igrave;nh trong h&#7879; th&#7889;ng v&#432;&#7907;t qu&aacute; c&aacute;c khung trang c&oacute; th&#7875; s&#7917; d&#7909;ng, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ch&#7885;n m&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7875; t&#7841;m d&#7915;ng, gi&#7843;i phóng b&#7899;t các khung trang cho </FONT>c&aacute;c ti&#7871;n tr&igrave;nh kh&aacute;c ho&agrave;n t&#7845;t.</font></P>
<B></blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#7843;o lu&#7853;n:</font></P><blockquote>

</B><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">Chi&#7871;n l&#432;&#7907;c working set <FONT FACE="Times New Roman">&#273;</FONT>&atilde; lo&#7841;i tr&#7915; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&igrave;nh tr&#7841;ng tr&igrave; tr&#7879; trong khi v&#7851;n <FONT FACE="Times New Roman">&#273;&#7843;m b&#7843;o m&#7913;c &#273;&#7897; &#273;a ch</FONT>&#432;&#417;ng c&#7911;a h&#7879; th&#7889;ng l&agrave; cao nh&#7845;t c&oacute; th&#7875;, cho ph&eacute;p s&#7917; d&#7909;ng t&#7889;i &#432;u CPU.</font></P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">&#272;i&#7875;m khó kh&#259;n c&#7911;a mô h</font></FONT><font color="#000066">&igrave;nh n&agrave;y l&agrave; theo v&#7871;t c&#7911;a c&aacute;c working set c&#7911;a ti&#7871;n tr&igrave;nh trong t&#7915;ng th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m. Có th&#7875; x&#7845;p x&#7881;  mô h</FONT>&igrave;nh working set v&#7899;i m&#7897;t ng&#7855;t <FONT FACE="Times New Roman">&#273;&#7891;ng h&#7891; sau t&#7915;ng chu k&#7923; nh&#7845;t &#273;&#7883;nh v</FONT>&agrave; m&#7897;t bit reference:</font></P><blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
ph&aacute;t sinh m&#7897;t ng&#7855;t </font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7891;ng h&#7891; sau t&#7915;ng T l&#7847;n truy xu&#7845;t b&#7897; nh&#7899;.</font></P>
</FONT><P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
khi x&#7843;y ra m&#7897;t ng&#7855;t <FONT FACE="Times New Roman">&#273;&#7891;ng h&#7891;, ki&#7875;m tra các trang </FONT>c&oacute; bit reference l&agrave; 1, c&aacute;c trang n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c xem nh&#432; thu&#7897;c v&#7873; working set. </font> </P></blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">M&#7897;t h&#7879; th&#7889;ng s&#7917; d&#7909;ng k&#7929; thu&#7853;t ph&acirc;n trang theo y&ecirc;u c&#7847;u thu&#7847;n t&uacute;y (m&#7897;t trang kh&ocirc;ng bao gi&#7901; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p tr&#432;&#7899;c khi c&oacute; y&ecirc;u c&#7847;u truy xu&#7845;t) <FONT FACE="Times New Roman">&#273;&#7875; l&#7897; m&#7897;t &#273;&#7863;c &#273;i&#7875;m khá b&#7845;t l&#7907;i&nbsp;: m&#7897;t s&#7889; l</FONT>&#432;&#7907;ng l&#7899;n l&#7895;i trang x&#7843;y ra khi kh&#7903;i <FONT FACE="Times New Roman">&#273;&#7897;ng ti&#7871;n tr</FONT>&igrave;nh. T&igrave;nh tr&#7841;ng n&agrave;y l&agrave; h&#7853;u qu&#7843; c&#7911;a khuynh h&#432;&#7899;ng <FONT FACE="Times New Roman">&#273;&#7841;t t&#7899;i vi&#7879;c &#273;</FONT>&#432;a nh&oacute;m trang c&#7909;c b&#7897; v&agrave;o b&#7897; nh&#7899;. T&igrave;nh tr&#7841;ng n&agrave;y c&#361;ng c&oacute; th&#7875; x&#7843;y ra khi m&#7897;t ti&#7871;n tr&igrave;nh b&#7883; chuy&#7875;n t&#7841;m th&#7901;i ra b&#7897; nh&#7899; ph&#7909;, khi <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&aacute;i k&iacute;ch ho&#7841;t, t&#7845;t c&#7843; c&aacute;c trang c&#7911;a ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chuy&#7875;n l&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a ph&#7843;i &#273;</FONT>&#432;&#7907;c mang tr&#7903; l&#7841;i v&agrave;o b&#7897; nh&#7899;, v&agrave; m&#7897;t lo&#7841;t l&#7895;i trang l&#7841;i x&#7843;y ra. <FONT FACE="Times New Roman">&#272;&#7875; ng&#259;n c&#7843;n t</FONT>&igrave;nh h&igrave;nh l&#7895;i trang x&#7843;y ra qu&aacute; nhi&#7873;u t&#7841;i th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m kh&#7903;i &#273;&#7897;ng ti&#7871;n tr</FONT>&igrave;nh, c&oacute; th&#7875; s&#7917; d&#7909;ng k&#7929; thu&#7853;t ti&#7873;n ph&acirc;n trang (prepaging)&nbsp;: n&#7841;p v&agrave;o b&#7897; nh&#7899; m&#7897;t l&#7847;n t&#7845;t c&#7843; c&aacute;c trang trong working set c&#7911;a ti&#7871;n tr&igrave;nh.</font></P>

<P ALIGN="JUSTIFY">&nbsp;</P>
</blockquote>

</blockquote>
</blockquote>

<B><P ALIGN="JUSTIFY"><font color="#800000"><a name="tansuat"><img border="0" src="images/read_single.gif" width="15" height="12">
 III.2. T&#7847;n su&#7845;t x&#7843;y ra l&#7895;i trang</a></font></P>
<blockquote>
<P ALIGN="JUSTIFY"><font color="#000066">Ti&#7871;p c&#7853;n:</font></B> <font color="#000066"> T&#7847;n su&#7845;t l&#7895;i trang r&#7845;t cao khi&#7871;n t&igrave;nh tr&#7841;ng tr&igrave; tr&#7879; h&#7879; th&#7889;ng c&oacute; th&#7875;   x&#7843;y ra.</font> </P><blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">Khi t&#7847;n su&#7845;t l&#7895;i trang qu&aacute; cao, ti&#7871;n tr&igrave;nh c&#7847;n th&ecirc;m m&#7897;t s&#7889; khung trang.</font></P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">Khi t&#7847;n su&#7845;t l&#7895;i trang qu&aacute; th&#7845;p, ti&#7871;n tr&igrave;nh c&oacute; th&#7875; s&#7905; h&#7919;u nhi&#7873;u khung trang h&#417;n m&#7913;c c&#7847;n thi&#7871;t.</font></P></blockquote>

<P ALIGN="JUSTIFY"><font color="#000066">C&oacute; th&#7875; thi&#7871;t l&#7853;p m&#7897;t gi&aacute; tr&#7883; ch&#7863;n tr&ecirc;n v&agrave; ch&#7863;n d&#432;&#7899;i cho t&#7847;n su&#7845;t x&#7843;y ra l&#7895;i trang, v&agrave; tr&#7921;c ti&#7871;p &#432;&#7899;c l&#432;&#7907;ng v&agrave; ki&#7875;m so&aacute;t t&#7847;n su&#7845;t l&#7895;i trang <FONT FACE="Times New Roman">&#273;&#7875; ng&#259;n ch&#7863;n t</FONT>&igrave;nh trang tr&igrave; tr&#7879; x&#7843;y ra&nbsp;:</font></P><blockquote>

<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">N&#7871;u t&#7847;n su&#7845;t l&#7895;i trang v&#432;&#7907;t qu&aacute; ch&#7863;n tr&ecirc;n, c&#7845;p cho ti&#7871;n tr&igrave;nh th&ecirc;m m&#7897;t khung trang</font></P>
<P ALIGN="JUSTIFY"><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">N&#7871;u t&#7847;n su&#7845;t l&#7895;i trang th&#7845;p h&#417;n ch&#7863;n d&#432;&#7899;i, thu h&#7891;i b&#7899;t m&#7897;t khung trang t&#7915; ti&#7871;n tr&igrave;nh</font></P>
<P ALIGN="JUSTIFY">&nbsp;</P></blockquote>
</blockquote>

<B><P ALIGN="JUSTIFY"><font color="#FF0000" face="Verdana" size="4"><a name="tomtat">IV. T&oacute;m t&#7855;t</a></font></P>
</B></center>
<blockquote>
  <P align="left"><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
  C&aacute;c k&#7929; thu&#7853;t h&#7895; tr&#7907; c&aacute;c m&ocirc; h&igrave;nh t&#7893; ch&#7913;c b&#7897; nh&#7899; hi&#7879;n
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7841;i :</font></P>
<blockquote>

</FONT><I><P align="left"><font color="#000066"><img border="0" src="images/dotgreen.gif" width="9" height="9">Swapping&nbsp;</font></I><font color="#000066">: s&#7917; d&#7909;ng th&ecirc;m b&#7897; nh&#7899; ph&#7909; <FONT FACE="Times New Roman">&#273;&#7875; l</FONT>&#432;u tr&#7919; t&#7841;m c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang b&#7883; khóa, nh&#7901; v&#7853;y  có th&#7875; t&#259;ng m&#7913;c &#273;&#7897; &#273;a ch</FONT>&#432;&#417;ng c&#7911;a h&#7879; th&#7889;ng  v&#7899;i c&#7845;u h&igrave;nh m&aacute;y c&oacute; dung l&#432;&#7907;ng b&#7897; nh&#7899; ch&iacute;nh th&#7845;p.</font></P>
  <P align="left"><I><font color="#000066"><img border="0" src="images/dotgreen.gif" width="9" height="9"></font></I><I><font color="#000066">B&#7897; nh&#7899; &#7843;o&nbsp;</font></I><font color="#000066">: s&#7917; d&#7909;ng k&#7929; thu&#7853;t ph&acirc;n trang theo y&ecirc;u c&#7847;u, k&#7871;t h&#7907;p th&ecirc;m k&#7929; thu&#7853;t swapping <FONT FACE="Times New Roman">&#273;&#7875; m&#7903; r&#7897;ng b&#7897; nh&#7899; chính. Tách bi&#7879;t không gian &#273;&#7883;a ch&#7881; v</FONT>&agrave; kh&ocirc;ng gian v&#7853;t l&yacute;, nh&#7901; <FONT FACE="Times New Roman">&#273;ó có th&#7875; x&#7917; lý các ch</FONT>&#432;&#417;ng tr&igrave;nh c&oacute; k&iacute;ch th&#432;&#7899;c l&#7899;n h&#417;n b&#7897; nh&#7899; v&#7853;t l&yacute; th&#7853;t s&#7921;</font></P>
  </blockquote>


<P><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
Khi c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t b&#7897; nh&#7899; &#7843;o, ph&#7843;i s&#7917; d&#7909;ng m&#7897;t thu&#7853;t toán thay th&#7871; trang thích h&#7907;p &#273;&#7875; ch&#7885;n các trang b&#7883; chuy&#7875;n t&#7841;m th&#7901;i ra b&#7897; nh&#7899; ph&#7909;, d</FONT>&agrave;nh ch&#7895; trong b&#7897; nh&#7899; ch&iacute;nh cho trang m&#7899;i. C&aacute;c thu&#7853;t to&aacute;n thay th&#7871; th&#432;&#7901;ng s&#7917; d&#7909;ng l&agrave; FIFO, LRU v&agrave; c&aacute;c thu&#7853;t to&aacute;n x&#7845;p x&#7881; LRU, c&aacute;c thu&#7853;t to&aacute;n th&#7889;ng k&ecirc; NFU, MFU...
</font> </P>
<P><font color="#000066"><img border="0" src="images/rightarrow.gif" width="6" height="12">
Khi m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; &#273;a ch</FONT>&#432;&#417;ng t<FONT FACE="Times New Roman">&#259;ng cao &#273;&#7871;n m&#7897;t ch&#7915;ng m&#7921;c n</FONT>&agrave;o <FONT FACE="Times New Roman">&#273;ó, h&#7879; th&#7889;ng có th&#7875; lâm v</FONT>&agrave;o t&igrave;nh tr&#7841;ng tr&igrave; tr&#7879; do t&#7845;t c&#7843; c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7873;u thi&#7871;u khung trang. Có th&#7875;  áp d&#7909;ng mô h</FONT>&igrave;nh working set <FONT FACE="Times New Roman">&#273;&#7875; d</FONT>&agrave;nh cho m&#7895;i ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7911; các khung trang c&#7847;n thi&#7871;t t&#7841;i m&#7897;t th&#7901;i &#273;i&#7875;m, t&#7915; &#273;ó có th&#7875; ng&#259;n ch&#7863;n t</FONT>&igrave;nh tr&#7841;ng tr&igrave; tr&#7879; x&#7843;y ra.
</font> </P>

  </blockquote>

<P>&nbsp;</P>
<P><a name="cauhoi"><img border="0" src="images/blebul1a.gif" width="20" height="20"> <b><font color="#FF0000" face="Times New Roman" size="4">C&#7911;ng
c&#7889; bài h&#7885;c</font></b></a></P>
<blockquote>
<P><font color="#000066">&nbsp;C&aacute;c c&acirc;u h&#7887;i c&#7847;n tr&#7843; l&#7901;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c sau b&agrave;i h&#7885;c n&agrave;y :</font></P>
<P><font color="#000066">1. B&#7897; nh&#7899; &#7843;o l&agrave; g&igrave; ?</font></P>
<P><font color="#000066">2. S&#7921; th&#7853;t </font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7857;ng sau &#7843;o giác: gi&#7899;i h&#7841;n c&#7911;a b&#7897; nh&#7899; &#7843;o ? Chi phí th&#7921;c hi&#7879;n?</font></P>
</FONT><P><font color="#000066">3. C&aacute;c v&#7845;n </font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7873; c&#7911;a b&#7897; nh&#7899; &#7843;o : thay th&#7871; trang, c&#7845;p phát khung trang ?</font></P>
</FONT><P><font color="#000066">4. M&ocirc; h&igrave;nh working set : kh&aacute;i ni&#7879;m, c&aacute;ch t&iacute;nh trong th&#7921;c t&#7871;,  s&#7917; d&#7909;ng ?</font></P>
</blockquote>
<p><a name="baitap"><img border="0" src="images/blebul1a.gif" width="20" height="20"> <b><font color="#FF0000" face="Times New Roman" size="4">Bài
T&#7853;p&nbsp;</font></b></a></p>
<blockquote>

<P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 1.</b> Khi n&agrave;o th&igrave; x&#7843;y ra l&#7895;i trang ? M&ocirc; t&#7843; x&#7917; l&yacute; c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh khi c&oacute; l&#7895;i trang.</font></P>
<P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 2.</b> Gi&#7843; s&#7917; c&oacute; m&#7897;t chu&#7895;i truy xu&#7845;t b&#7897; nh&#7899; c&oacute; chi&#7873;u d&agrave;i <I>p</I> v&#7899;i <I>n</I> s&#7889; hi&#7879;u trang kh&aacute;c nhau xu&#7845;t hi&#7879;n trong chu&#7895;i. Gi&#7843; s&#7917; h&#7879; th&#7889;ng s&#7917; d&#7909;ng <I>m</I> khung trang ( kh&#7903;i
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7897;ng tr&#7889;ng). V&#7899;i m&#7897;t thu&#7853;t toán thay th&#7871; trang b&#7845;t k&#7923; :</font></P><blockquote>

</FONT><P><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
Cho bi&#7871;t s&#7889; l&#432;&#7907;ng t&#7889;i thi&#7875;u c&aacute;c l&#7895;i trang x&#7843;y ra ?</font></P>
<P><font color="#000066"><img border="0" src="images/red.gif" width="7" height="10">
Cho bi&#7871;t s&#7889; l&#432;&#7907;ng t&#7889;i </font> <FONT FACE="Times New Roman"><font color="#000066">&#273;a các l&#7895;i trang x&#7843;y ra ?</font></P></blockquote>

</FONT><P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
  Bài 3.</b> M&#7897;t m&aacute;y t&iacute;nh 32-bit <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881;, s&#7917; d&#7909;ng m&#7897;t b&#7843;ng trang nh&#7883; c&#7845;p. &#272;&#7883;a ch&#7881; &#7843;o  &#273;</FONT>&#432;&#7907;c ph&acirc;n b&#7893; nh&#432; sau : 9 bit d&agrave;nh cho b&#7843;ng trang c&#7845;p 1, 11 bit cho b&#7843;ng trang c&#7845;p 2, v&agrave; cho offset. Cho bi&#7871;t k&iacute;ch th&#432;&#7899;c m&#7897;t trang trong h&#7879; th&#7889;ng, v&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o có bao nhi</FONT>&ecirc;u trang ?</font></P>
<P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 4.</b> Gi&#7843; s&#7917; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o 32-bit &#273;</FONT>&#432;&#7907;c ph&acirc;n t&aacute;ch th&agrave;nh 4 tr&#432;&#7901;ng <I>a,b,c,d</I>. 3 tr&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c d&ugrave;ng cho b&#7843;ng trang tam c&#7845;p, tr&#432;&#7901;ng th&#7913; 4 d&agrave;nh cho offset. S&#7889; l&#432;&#7907;ng trang c&oacute; ph&#7909; thu&#7897;c v&agrave;o c&#7843; k&iacute;ch th&#432;&#7899;c 4 tr&#432;&#7901;ng n&agrave;y kh&ocirc;ng ? N&#7871;u kh&ocirc;ng, nh&#7919;ng tr&#432;&#7901;ng n&agrave;o &#7843;nh h&#432;&#7903;ng <FONT FACE="Times New Roman">&#273;&#7871;n s&#7889; l</FONT>&#432;&#7907;ng trang, v&agrave; nh&#7919;ng tr&#432;&#7901;ng n&agrave;o kh&ocirc;ng ?</font></P>
<P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 5.</b> M&#7897;t m&aacute;y t&iacute;nh c&oacute; 48-bit <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o, v</FONT>&agrave; 32-bit <FONT FACE="Times New Roman">&#273;&#7883;a</FONT> ch&#7881; v&#7853;t l&yacute;. K&iacute;ch th&#432;&#7899;c m&#7897;t trang l&agrave; 8K. C&oacute; bao nhi&ecirc;u ph&#7847;n t&#7917; trong m&#7897;t b&#7843;ng trang ( th&ocirc;ng th&#432;&#7901;ng)? Trong b&#7843;ng trang ngh&#7883;ch
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7843;o ?</font></P>
</FONT><P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
  Bài 6.</b> M&#7897;t m&aacute;y t&iacute;nh cung c&#7845;p cho ng&#432;&#7901;i d&ugrave;ng m&#7897;t kh&ocirc;ng gian <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o 2</FONT><SUP>32 </SUP>bytes. M&aacute;y t&iacute;nh n&agrave;y c&oacute; b&#7897; nh&#7899; v&#7853;t l&yacute; 2<SUP>18 </SUP>bytes. B&#7897; nh&#7899; &#7843;o <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n v&#7899;i k&#7929; thu&#7853;t ph&acirc;n trang, k&iacute;ch th&#432;&#7899;c trang l&agrave; 4096 bytes. M&#7897;t ti&#7871;n tr&igrave;nh c&#7911;a ng&#432;&#7901;i d&ugrave;ng ph&aacute;t sinh <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o 11123456. Gi&#7843;i thích cách h&#7879; th&#7889;ng chuy&#7875;n &#273;&#7893;i &#273;&#7883;a ch&#7881; &#7843;o n</FONT>&agrave;y th&agrave;nh <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; v&#7853;t lý t</FONT>&#432;&#417;ng &#7913;ng. Ph&acirc;n bi&#7879;t c&aacute;c thao t&aacute;c ph&#7847;n m&#7873;m v&agrave; ph&#7847;n c&#7913;ng.</font></P>
<P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 7.</b> Gi&#7843; s&#7917; c&oacute; m&#7897;t h&#7879; th&#7889;ng s&#7917; d&#7909;ng k&#7929; thu&#7853;t ph&acirc;n trang theo y&ecirc;u c&#7847;u. B&#7843;ng trang <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; trong c&aacute;c thanh ghi. <FONT FACE="Times New Roman">&#272;&#7875; x&#7917; lý m&#7897;t l&#7895;i trang t&#7889;n 8 miliseconds n&#7871;u có s&#7861;n m&#7897;t khung trang tr&#7889;ng, ho&#7863;c trang b&#7883; thay th&#7871; không b&#7883; s&#7917;a &#273;&#7893;i n&#7897;i dung, v</FONT>&agrave; t&#7889;n 20 miliseconds n&#7871;u trang b&#7883; thay th&#7871; b&#7883; s&#7917;a <FONT FACE="Times New Roman">&#273;&#7893;i n&#7897;i dung. M&#7895;i truy xu&#7845;t b&#7897; nh&#7899; t&#7889;n 100nanoseconds. Gi&#7843; s&#7917; trang b&#7883; thay th&#7871; có xác su&#7845;t b&#7883; s&#7917; &#273;&#7893;i l</FONT>&agrave; 70%. T&#7927; l&#7879; ph&aacute;t sinh l&#7895;i trang ph&#7843;i l&agrave; bao nhi&ecirc;u <FONT FACE="Times New Roman">&#273;&#7875; có th&#7875; duy tr</FONT>&igrave; th&#7901;i gian truy xu&#7845;t b&#7897; nh&#7899; ( effective acess time) kh&ocirc;ng v&#432;&#7907;t qu&aacute; 200nanoseconds ?</font></P>
<P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 8.</b> X&eacute;t c&aacute;c thu&#7853;t to&aacute;n thay th&#7871; trang sau <FONT FACE="Times New Roman">&#273;ây. X&#7871;p th&#7913; t&#7921; chúng d&#7921;a theo t&#7927; l&#7879; phát sinh l&#7895;i trang c&#7911;a chúng. Phân bi&#7879;t các thu&#7853;t toán ch&#7883;u &#273;&#7921;ng ngh&#7883;ch lý Belady v</FONT>&agrave; c&aacute;c thu&#7853;t to&aacute;n kh&ocirc;ng b&#7883; ngh&#7883;ch l&yacute; n&agrave;y &#7843;nh h&#432;&#7903;ng.</font> </P><blockquote>

<FONT SIZE=3><PRE><font color="#000066">a)LRU
b)FIFO
c)Chi&#7871;n l&#432;&#7907;c thay th&#7871; t&#7889;i &#432;u
d)C&#417; h&#7897;i th&#7913; hai</font></PRE>
</blockquote>

</FONT><P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
  Bài 9.</b> M&#7897;t m&aacute;y t&iacute;nh c&oacute; 4 khung trang. Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m n&#7841;p, th&#7901;i &#273;i&#7875;m truy c&#7853;p cu&#7889;i c</FONT>&ugrave;ng, v&agrave; c&aacute;c bit reference (R), modify (M) c&#7911;a m&#7895;i trang trong b&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c cho trong b&#7843;ng sau :</font> </P>

  <CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=7 WIDTH=429>
<TR><TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">Trang</font></P>
<P ALIGN="CENTER"></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">N&#7841;p</font></TD>
<TD WIDTH="24%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">Truy c&#7853;p cu&#7889;i</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">R</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">M</font></TD>
</TR>
<TR><TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">0</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">126</font></TD>
<TD WIDTH="24%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">279</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">0</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">0</font></TD>
</TR>
<TR><TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">1</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">230</font></TD>
<TD WIDTH="24%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">260</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">1</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">0</font></TD>
</TR>
<TR><TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">2</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">120</font></TD>
<TD WIDTH="24%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">272</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">1</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">1</font></TD>
</TR>
<TR><TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">3</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">160</font></TD>
<TD WIDTH="24%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">280</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">1</font></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<P ALIGN="CENTER"><font color="#000066">1</font></TD>
</TR>
</TABLE>
</CENTER>

<P><font color="#000066">&nbsp;&nbsp;&nbsp; Trang n&agrave;o s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ch&#7885;n thay th&#7871; theo :</font></P><blockquote>

<P><font color="#000066">a) thu&#7853;t to&aacute;n NRU</font></P>
<P><font color="#000066">b) thu&#7853;t to&aacute;n FIFO</font></P>
<P><font color="#000066">c) thu&#7853;t to&aacute;n LRU</font></P>
<P><font color="#000066">d) thu&#7853;t to&aacute;n &quot; c&#417; h&#7897;i th&#7913; 2&quot;</font></P></blockquote>

<P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 10.</b> X&eacute;t m&#7843;ng hai chi&#7873;u A:</font></P>

<blockquote>

<font color="#000066">            var A: array [1 ..100, 1..100] of integer;</font>

</blockquote>
<p>

<font color="#000066">            &nbsp;V&#7899;i  A[1][1] <FONT FACE="Times New Roman" SIZE=3>&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; t&#7841;i v&#7883; trí 200, trong b&#7897; nh&#7899; t&#7893; ch&#7913;c theo k&#7929; thu&#7853;t phân trang v&#7899;i kích th&#432;&#7899;c trang là 200. M&#7897;t ti&#7871;n trình trong trang  0 (chi&#7871;m v&#7883; trí t&#7915; 0 <FONT FACE="Times New Roman" SIZE=3>&#273;&#7871;n 199) s&#7869; thao tác ma tr&#7853;n n</FONT>ày&nbsp;; nh&#432; v&#7853;y m&#7895;i ch&#7881; th&#7883; s&#7869; <FONT FACE="Times New Roman" SIZE=3>&#273;</FONT>&#432;&#7907;c n&#7841;p t&#7915; trang 0.  
   V&#7899;i 3 khung trang, có bao nhiêu l&#7895;i trang s&#7869; phát sinh khi th&#7921;c hi&#7879;n vòng l&#7863;p sau <FONT FACE="Times New Roman" SIZE=3>&#273;ây &#273;&#7875; kh&#7903;i &#273;&#7897;ng m&#7843;ng, s&#7917; d&#7909;ng thu&#7853;t toán thay th&#7871; LRU , v</FONT>à gi&#7843; s&#7917; khung trang 1 ch&#432;á ti&#7871;n trình, hai khung trang còn l&#7841;i <FONT FACE="Times New Roman" SIZE=3>&#273;</FONT>&#432;&#7907;c kh&#7903;i <FONT FACE="Times New Roman">&#273;&#7897;ng &#7903; tr&#7841;ng thái tr&#7889;ng&nbsp;:&nbsp; 
</FONT></font>

</p>
<blockquote>
  <p>

<font color="#000066">            a.    for j:= 1 to 100 do&nbsp;</font>

  </p>
  <blockquote>
    <p><font color="#000066">for i :=1 to 100 do
                 A[i][j]:= 0;&nbsp;</font></p>
  </blockquote>
  <p><font color="#000066">
    b.    for i :=1 to 100 do&nbsp;</font></p>
  <blockquote>
    <p><font color="#000066">
            for j:=1 to 100 do
                 A[i][j]:= 0;</font></p>
  </blockquote>
</blockquote>

<P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
 Bài 11.</b> X&eacute;t chu&#7895;i truy xu&#7845;t b&#7897; nh&#7899; sau:</font></P>
  <blockquote>

<P align="left"><font color="#000066">1, 2 , 3 , 4 , 2 , 1 , 5 , 6 , 2 , 1 , 2 , 3 , 7 , 6 , 3 , 2 , 1 , 2 , 3 , 6</font></P>
</blockquote>
<P><font color="#000066">C&oacute; bao nhi&ecirc;u l&#7895;i trang x&#7843;y ra khi s&#7917; d&#7909;ng c&aacute;c thu&#7853;t to&aacute;n thay th&#7871; sau
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;ây, gi&#7843; s&#7917; có 1, 2, 3, 4, 5, 6, 7 khung trang ?</font> </P>

</FONT>
  <blockquote>

<blockquote>

<P><font color="#000066">a) LRU</font></P>
<P><font color="#000066">b) FIFO</font></P>
<P><font color="#000066">c) Chi&#7871;n l&#432;&#7907;c t&#7889;i &#432;u</font></P></blockquote>

</blockquote>

<P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
 Bài 12.</b>  Trong m&#7897;t h&#7879; th&#7889;ng s&#7917; d&#7909;ng k&#7929; thu&#7853;t ph&acirc;n trang theo y&ecirc;u c&#7847;u, x&eacute;t hai <FONT FACE="Times New Roman">&#273;o&#7841;n ch</FONT>&#432;&#417;ng tr&igrave;nh sau
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;ây:</font></P>
</FONT>
  <blockquote>

<FONT FACE="Courier New" SIZE=2><P><font color="#000066">const N = 1024*1024</font></P>
<P><font color="#000066">var A,B : array [1..N] of integer;</font></P></blockquote>
<blockquote>

<P> <font color="#000066"> [Program 1]</font></P>
<P><font color="#000066">for i:=1 to N do</font></P>
<P><font color="#000066">   A[i]:=i;</font></P>
<P><font color="#000066">for i:=1 to N do</font></P>
<P><font color="#000066">   B[A[i]]:=random(N);</font></P>
<P><font color="#000066">[Program 2]</font></P>
<P><font color="#000066">for i:=1 to N do</font></P>
<P><font color="#000066">   A[i]:= random(N);</font></P>
<P><font color="#000066">for i:=1 to N do</font></P>
<P><font color="#000066">   B[A[i]]:=i;</font></P></blockquote>

</FONT><P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
 Bài 13.</b>  Gi&#7843; s&#7917; c&oacute; m&#7897;t m&aacute;y t&iacute;nh <FONT FACE="Times New Roman">&#273;&#7891; ch</FONT>&#417;i s&#7917; d&#7909;ng 7-bit <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881;. Kích th</FONT>&#432;&#7899;c m&#7897;t trang l&agrave; 8 bytes, v&agrave; h&#7879; th&#7889;ng s&#7917; d&#7909;ng m&#7897;t b&#7843;ng trang nh&#7883; c&#7845;p, d&ugrave;ng 2-bit l&agrave;m ch&#7881; m&#7909;c <FONT FACE="Times New Roman">&#273;&#7871;n b&#7843;ng trang c&#7845;p 1 , 2-bit l</FONT>&agrave;m ch&#7881; m&#7909;c <FONT FACE="Times New Roman">&#273;&#7871;n b&#7843;ng trang c&#7845;p 2. Xét m&#7897;t ti&#7871;n tr</FONT>&igrave;nh s&#7917; d&#7909;ng c&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; trong nh&#7919;ng ph&#7841;m vi sau : 0..15, 21..29, 94</FONT>..106, v&agrave; 115..127.</font></P>
<blockquote>

<P><font color="#000066">a) V&#7869; chi ti&#7871;t to&agrave;n b&#7897; b&#7843;ng trang cho ti&#7871;n tr&igrave;nh n&agrave;y</font></P>
<P><font color="#000066">b) Ph&#7843;i c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh bao nhi&ecirc;u khung trang, gi&#7843; s&#7917; t&#7845;t c&#7843;
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7873;u n&#7857;m trong b&#7897; nh&#7899; chính ?</font></P>
</FONT><P><font color="#000066">c) Bao nhi&ecirc;u bytes &#7913;ng v&#7899;i c&aacute;c v&ugrave;ng ph&acirc;n m&#7843;nh n&#7897;i vi trong ti&#7871;n tr&igrave;nh n&agrave;y?</font></P>
<P><font color="#000066">d) C&#7847;n bao nhi&ecirc;u b&#7897; nh&#7899; cho b&#7843;ng trang c&#7911;a ti&#7871;n tr&igrave;nh n&agrave;y ?</font></P>


  </blockquote>


<P><font color="#000066"><b><img border="0" src="images/help.gif" width="16" height="16">
 Bài 14.</b>  Gi&#7843; s&#7917; c&oacute; m&#7897;t m&aacute;y t&iacute;nh s&#7917; d&#7909;ng 16-bit <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881;. B&#7897; nh&#7899; &#7843;o &#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n v&#7899;i k&#7929; thu&#7853;t ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n k&#7871;t h&#7907;p phân trang, kích th</FONT>&#432;&#7899;c t&#7889;i <FONT FACE="Times New Roman">&#273;a c&#7911;a m&#7897;t phân &#273;o&#7841;n l</FONT>&agrave; 4096 bytes. B&#7897; nh&#7899; v&#7853;t l&yacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&acirc;n th&agrave;nh c&aacute;c khung trang c&oacute; k&iacute;ch th&#432;&#7899;c 512 bytes.</font></P>
<blockquote>

<P><font color="#000066">a) Th&#7875; hi&#7879;n c&aacute;ch <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#7843;o &#273;</FONT>&#432;&#7907;c ph&acirc;n t&iacute;ch
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7875; ph&#7843;n ánh segment, page, offset</font></P>
</FONT><P><font color="#000066">b) X&eacute;t m&#7897;t ti&#7871;n tr&igrave;nh s&#7917; d&#7909;ng c&aacute;c mi&#7873;n <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; sau, xác &#273;&#7883;nh s&#7889; hi&#7879;u segment v</FONT>&agrave; s&#7889; hi&#7879;u page t&#432;&#417;ng &#7913;ng trong segment m&agrave; ch&#432;&#417;ng tr&igrave;nh truy c&#7853;p
</font> <FONT FACE="Times New Roman"><font color="#000066">&#273;&#7871;n :</font></P>
</FONT><P><font color="#000066">350..1039, 3046..3904, 7100..9450,  33056..39200, 61230..63500</font></P>
<P><font color="#000066">c) Bao nhi&ecirc;u bytes &#7913;ng v&#7899;i c&aacute;c v&ugrave;ng ph&acirc;n m&#7843;nh n&#7897;i vi trong ti&#7871;n tr&igrave;nh n&agrave;y?</font></P>
<P><font color="#000066">d) C&#7847;n bao nhi&ecirc;u b&#7897; nh&#7899; cho b&#7843;ng ph&acirc;n <FONT FACE="Times New Roman">&#273;o&#7841;n v</FONT>&agrave; b&#7843;ng trang c&#7911;a ti&#7871;n tr&igrave;nh n&agrave;y ?</font></P>


  </blockquote>


</body>

</html>
