<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 4.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<LINK REL="stylesheet" TYPE="text/css" HREF="style.css" TITLE="MTD">
<title>Lich su phat trien cac HDH</title>
</head>

<body>
<STRONG><P ALIGN="JUSTIFY" class="cap1">IV. L&#7882;CH S&#7916; PH&Aacute;T TRI&#7874;N C&Aacute;C H&#7878;
&#272;I&#7872;U HÀNH</P>
<FONT SIZE=4><P ALIGN="JUSTIFY" class="cap2"><a name="thehe1"><img border="0" src="images/read_single.gif" width="15" height="12">
IV.1 Th&#7871; h&#7879; 1 (1945 – 1955)</a></P></FONT></STRONG>
<blockquote>
  <P ALIGN="JUSTIFY">V&agrave;o kho&#7843;ng gi&#7919;a th&#7853;p ni&ecirc;n 1940, Howard Aiken &#7903; Havard v&agrave; John von Neumann &#7903; Princeton, <FONT FACE="Times New Roman">&#273;</FONT>&atilde; th&agrave;nh c&ocirc;ng trong vi&#7879;c x&acirc;y d&#7921;ng m&aacute;y t&iacute;nh d&ugrave;ng &#7889;ng ch&acirc;n kh&ocirc;ng. Nh&#7919;ng m&aacute;y n&agrave;y r&#7845;t l&#7899;n v&#7899;i h&#417;n 10000 &#7889;ng ch&acirc;n kh&ocirc;ng nh&#432;ng ch&#7853;m h&#417;n nhi&#7873;u so v&#7899;i m&aacute;y r&#7867; nh&#7845;t ng&agrave;y nay.</P>
<P ALIGN="JUSTIFY">M&#7895;i m&aacute;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c m&#7897;t nh&oacute;m th&#7921;c hi&#7879;n t&#7845;t c&#7843; t&#7915; thi&#7871;t k&#7871;, x&acirc;y d&#7921;ng l&#7853;p tr&igrave;nh, thao t&aacute;c <FONT FACE="Times New Roman">&#273;&#7871;n qu&#7843;n lý. L&#7853;p tr</FONT>&igrave;nh b&#7857;ng ng&ocirc;n ng&#7919; m&aacute;y tuy&#7879;t <FONT FACE="Times New Roman">&#273;&#7889;i, th</FONT>&#432;&#7901;ng l&agrave; b&#7857;ng c&aacute;ch d&ugrave;ng b&#7843;ng <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n &#273;&#7875; th&#7921;c hi&#7879;n các ch&#7913;c n&#259;ng c</FONT>&#417; b&#7843;n. Ng&ocirc;n ng&#7919; l&#7853;p tr&igrave;nh ch&#432;a <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c bi&#7871;t <FONT FACE="Times New Roman">&#273;&#7871;n v</FONT>&agrave; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#361;ng ch&#432;a nghe <FONT FACE="Times New Roman">&#273;&#7871;n.</FONT>&nbsp;</P>
<P ALIGN="JUSTIFY">V&agrave;o <FONT FACE="Times New Roman">&#273;&#7847;u th&#7853;p ni</FONT>&ecirc;n 1950, phi&#7871;u <FONT FACE="Times New Roman">&#273;&#7909;c l&#7893; ra &#273;&#7901;i v</FONT>&agrave; c&oacute; th&#7875; vi&#7871;t ch&#432;&#417;ng tr&igrave;nh tr&ecirc;n phi&#7871;u thay cho d&ugrave;ng b&#7843;ng <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n.</P>
  </blockquote>
</FONT>

<FONT SIZE=4><STRONG><P class="cap2"><a name="thehe2"><img border="0" src="images/read_single.gif" width="15" height="12">
IV.2 Th&#7871; h&#7879; 2 (1955 – 1965)</a></P><blockquote>
</FONT></STRONG>

<P ALIGN="JUSTIFY">S&#7921; ra <FONT FACE="Times New Roman">&#273;&#7901;i c&#7911;a thi&#7871;t b&#7883; bán d&#7851;n v</FONT>&agrave;o gi&#7919;a th&#7853;p ni&ecirc;n 1950 l&agrave;m thay <FONT FACE="Times New Roman">&#273;&#7893;i b&#7913;c tranh t&#7893;ng th&#7875;. Máy tính tr&#7903; n</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;&#7911; tin c&#7853;y h</FONT>&#417;n. N&oacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7843;n xu&#7845;t v&agrave; cung c&#7845;p cho c&aacute;c kh&aacute;ch h&agrave;ng. L&#7847;n <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n c&oacute; s&#7921; ph&acirc;n chia r&otilde; r&agrave;ng gi&#7919;a ng&#432;&#7901;i thi&#7871;t k&#7871;, ng&#432;&#7901;i x&acirc;y d&#7921;ng, ng&#432;&#7901;i v&#7853;n h&agrave;nh, ng&#432;&#7901;i l&#7853;p tr&igrave;nh, v&agrave; ng&#432;&#7901;i b&#7843;o tr&igrave;.</P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#7875; th&#7921;c hi&#7879;n m&#7897;t công vi&#7879;c (m&#7897;t ch</FONT>&#432;&#417;ng tr&igrave;nh hay m&#7897;t t&#7853;p h&#7907;p c&aacute;c ch&#432;&#417;ng tr&igrave;nh), l&#7853;p tr&igrave;nh vi&ecirc;n tr&#432;&#7899;c h&#7871;t vi&#7871;t ch&#432;&#417;ng tr&igrave;nh tr&ecirc;n gi&#7845;y (b&#7857;ng h&#7907;p ng&#7919; hay FORTRAN) sau <FONT FACE="Times New Roman">&#273;ó &#273;&#7909;c l&#7895; tr</FONT>&ecirc;n phi&#7871;u v&agrave; cu&#7889;i c&ugrave;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;a phi&#7871;u v&agrave;o m&aacute;y. Sau khi th&#7921;c hi&#7879;n xong n&oacute; s&#7869; xu&#7845;t k&#7871;t qu&#7843; ra m&aacute;y in.</P>
<B><I><P ALIGN="JUSTIFY">H&#7879; th&#7889;ng x&#7917; l&yacute; theo l&ocirc;</I> </B> ra <FONT FACE="Times New Roman">&#273;&#7901;i, nó l</FONT>&#432;u c&aacute;c y&ecirc;u c&#7847;u c&#7847;n th&#7921;c hi&#7879;n l&ecirc;n b<FONT FACE="Times New Roman">&#259;ng t&#7915;, v</FONT>&agrave; h&#7879; th&#7889;ng s&#7869; <FONT FACE="Times New Roman">&#273;&#7885;c v</FONT>&agrave; thi h&agrave;nh l&#7847;n l&#432;&#7907;t. Sau <FONT FACE="Times New Roman">&#273;ó, nó s&#7869; ghi k&#7871;t qu&#7843; l</FONT>&ecirc;n b<FONT FACE="Times New Roman">&#259;ng t&#7915; xu&#7845;t v</FONT>&agrave; cu&#7889;i c&ugrave;ng ng&#432;&#7901;i s&#7917; d&#7909;ng s&#7869; <FONT FACE="Times New Roman">&#273;em b&#259;ng t&#7915; xu&#7845;t &#273;i in.</FONT><B><I>&nbsp; </P>
</I>
</B><P ALIGN="JUSTIFY">H&#7879; th&#7889;ng x&#7917; l&yacute; theo l&ocirc; ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng d</FONT>&#432;&#7899;i s&#7921; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n c&#7911;a m&#7897;t ch</FONT>&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t l</FONT>&agrave; ti&#7873;n th&acirc;n c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh sau n&agrave;y. Ng&ocirc;n ng&#7919; l&#7853;p tr&igrave;nh s&#7917; d&#7909;ng trong giai <FONT FACE="Times New Roman">&#273;o&#7841;n n</FONT>&agrave;y ch&#7911; y&#7871;u l&agrave; FORTRAN v&agrave; h&#7907;p ng&#7919;.</P><FONT SIZE=4><STRONG>
</blockquote>

<I><P ALIGN="JUSTIFY" class="cap2"><a name="thehe3"><img border="0" src="images/read_single.gif" width="15" height="12">
</a>

</I><a name="thehe3">IV.3 Th&#7871; h&#7879; 3 (1965 – 1980)</a> </P></STRONG></FONT><blockquote>
<P ALIGN="JUSTIFY">Trong giai <FONT FACE="Times New Roman">&#273;o&#7841;n n</FONT>&agrave;y, m&aacute;y t&iacute;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng r&#7897;ng r&atilde;i trong khoa h&#7885;c c&#361;ng nh&#432; trong th&#432;&#417;ng m&#7841;i. M&aacute;y IBM 360 l&agrave; m&aacute;y t&iacute;nh <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n s&#7917; d&#7909;ng m&#7841;ch t&iacute;ch h&#7907;p (IC). T&#7915; <FONT FACE="Times New Roman">&#273;ó kích th</FONT>&#432;&#7899;c v&agrave; gi&aacute; c&#7843; c&#7911;a c&aacute;c h&#7879; th&#7889;ng m&aacute;y gi&#7843;m <FONT FACE="Times New Roman">&#273;áng k&#7875; v</FONT>&agrave; m&aacute;y t&iacute;nh c&agrave;ng ph&#7895; bi&#7871;n h&#417;n. C&aacute;c thi&#7871;t b&#7883; ngo&#7841;i vi d&agrave;nh cho m&aacute;y xu&#7845;t hi&#7879;n ng&agrave;y c&agrave;ng nhi&#7873;u v&agrave; thao t&aacute;c <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n b&#7855;t &#273;&#7847;u ph&#7913;c t&#7841;p.</FONT>&nbsp;</P>
<P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ra <FONT FACE="Times New Roman">&#273;&#7901;i nh&#7857;m &#273;i&#7873;u ph&#7889;i, ki&#7875;m soát ho&#7841;t &#273;&#7897;ng v</FONT>&agrave; gi&#7843;i quy&#7871;t c&aacute;c y&ecirc;u c&#7847;u tranh ch&#7845;p thi&#7871; b&#7883;. Ch&#432;&#417;ng tr&igrave;nh h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh d&agrave;i c&#7843; tri&#7879;u d&ograve;ng h&#7907;p ng&#7919; v&agrave; do h&agrave;ng ng&agrave;n l&#7853;p tr&igrave;nh vi&ecirc;n th&#7921;c hi&#7879;n.</P>
<P ALIGN="JUSTIFY">Sau <FONT FACE="Times New Roman">&#273;ó, </FONT>h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ra <FONT FACE="Times New Roman">&#273;&#7901;i khái ni&#7879;m <B><I>&#273;a ch</FONT>&#432;&#417;ng</B></I>. CPU kh&ocirc;ng ph&#7843;i ch&#7901; th&#7921;c hi&#7879;n c&aacute;c thao t&aacute;c nh&#7853;p xu&#7845;t. B&#7897; nh&#7899; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia l&agrave;m nhi&#7873;u ph&#7847;n, m&#7895;i ph&#7847;n c&oacute; m&#7897;t c&ocirc;ng vi&#7879;c (job) kh&aacute;c nhau, khi m&#7897;t c&ocirc;ng vi&#7879;c ch&#7901; th&#7921;c hi&#7879;n nh&#7853;p xu&#7845;t CPU s&#7869; x&#7917; l&yacute; c&aacute;c c&ocirc;ng vi&#7879;c c&ograve;n l&#7841;i. Tuy nhi&ecirc;n khi c&oacute; nhi&#7873;u c&ocirc;ng vi&#7879;c c&ugrave;ng xu&#7845;t hi&#7879;n trong b&#7897; nh&#7899;, v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; l</FONT>&agrave; ph&#7843;i c&oacute; m&#7897;t c&#417; ch&#7871; b&#7843;o v&#7879; tr&aacute;nh c&aacute;c c&ocirc;ng vi&#7879;c &#7843;nh h&#432;&#7903;ng <FONT FACE="Times New Roman">&#273;&#7871;n nhau. H&#7879;</FONT> <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#361;ng c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t thu&#7897;c tính spool.
</FONT></P>
<P ALIGN="JUSTIFY">Giai <FONT FACE="Times New Roman">&#273;o&#7841;n n</FONT>&agrave;y c&#361;ng <FONT FACE="Times New Roman">&#273;ánh d&#7845;u s&#7921; ra &#273;&#7901;i c&#7911;a </FONT><B><I>h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh chia x&#7867; th&#7901;i gian</B></I> nh&#432; CTSS c&#7911;a MIT. <FONT FACE="Times New Roman">&#272;&#7891;ng th&#7901;i các h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh l&#7899;n ra <FONT FACE="Times New Roman">&#273;&#7901;i nh</FONT>&#432; MULTICS, UNIX v&agrave; h&#7879; th&#7889;ng c&aacute;c m&aacute;y mini c&#361;ng xu&#7845;t hi&#7879;n nh&#432; DEC PDP-1.</P><FONT SIZE=4><STRONG>
</blockquote>
<P ALIGN="JUSTIFY" class="cap2"><a name="thehe4"><img border="0" src="images/read_single.gif" width="15" height="12">
IV.4 Th&#7871; h&#7879; 4 (1980 - )</a></P></STRONG></FONT><blockquote>
<P ALIGN="JUSTIFY">Giai <FONT FACE="Times New Roman">&#273;o&#7841;n n</FONT>&agrave;y <FONT FACE="Times New Roman">&#273;ánh d&#7845;u s&#7921; ra &#273;&#7901;i c&#7911;a máy tính cá nhân, &#273;&#7863;c bi&#7879;t l</FONT>&agrave; h&#7879; th&#7889;ng IBM PC v&#7899;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh MS-DOS v&agrave; Windows sau n&agrave;y.  B&ecirc;n c&#7841;nh <FONT FACE="Times New Roman">&#273;ó l</FONT>&agrave; s&#7921; ph&aacute;t tri&#7875;n m&#7841;nh c&#7911;a c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh t&#7921;a Unix tr&ecirc;n nhi&#7873;u h&#7879; m&aacute;y kh&aacute;c nhau nh&#432; Linux. Ngo&agrave;i ra, t&#7915; <FONT FACE="Times New Roman">&#273;&#7847;u th&#7853;p ni</FONT>&ecirc;n 90 c&#361;ng <FONT FACE="Times New Roman">&#273;ánh d&#7845;u s&#7921; phát tri&#7875;n m&#7841;nh m&#7869; c&#7911;a </FONT><B><I>h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh m&#7841;ng</B></I> v&agrave; <B><I>h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ph&acirc;n t&aacute;n</B></I>.</P>

</body>

</html>
