<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<LINK REL="stylesheet" TYPE="text/css" HREF="style.css" TITLE="MTD">
<TITLE>He thong quan ly tap tin</TITLE>
</HEAD>
<BODY LINK="#0000ff">

<B><P ALIGN="CENTER"><font face="Verdana" color="#00007f" size="2">BÀI 8</font><font face="Verdana" color="#00007f" size="5">
H&#7878; TH&#7888;NG QU&#7842;N L&Yacute; T&#7852;P TIN</font></P><blockquote>

</B><EM><P>Trong h&#7847;u h&#7871;t c&aacute;c &#7913;ng d&#7909;ng, t&#7853;p tin l&agrave; th&agrave;nh ph&#7847;n ch&#7911; y&#7871;u. Cho d&ugrave; m&#7909;c ti&ecirc;u c&#7911;a &#7913;ng d&#7909;ng l&agrave; g&igrave; n&oacute; c&#361;ng ph&#7843;i bao g&#7891;m ph&aacute;t sinh v&agrave; s&#7917; d&#7909;ng th&ocirc;ng tin. Th&ocirc;ng th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;&#7847;u v</FONT>&agrave;o c&#7911;a c&aacute;c &#7913;ng d&#7909;ng l&agrave; t&#7853;p tin v&agrave; <FONT FACE="Times New Roman">&#273;&#7847;u ra c&#361;ng l</FONT>&agrave; t&#7853;p tin cho vi&#7879;c truy xu&#7845;t c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng v&agrave; c&aacute;c ch&#432;&#417;ng tr&igrave;nh kh&aacute;c sau n&agrave;y. Trong b&agrave;i h&#7885;c n&agrave;y ch&uacute;ng ta s&#7869; t&igrave;m hi&#7875;u nh&#7919;ng kh&aacute;i ni&#7879;m v&agrave; c&#417; ch&#7871; c&#7911;a h&#7879; th&#7889;ng qu&#7843;n l&yacute; t&#7853;p tin th&ocirc;ng qua c&aacute;c n&#7897;i dung nh&#432; sau: </P>
</EM>
<blockquote>
  <P><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#khainiem">Các
  khái ni&#7879;m c&#417; b&#7843;n</a></P>
  <P><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#mohinh">Mô
  hình t&#7893; ch&#7913;c và qu&#7843;n lý các t&#7853;p tin</a></P>
</blockquote>
<P ALIGN="JUSTIFY">B&agrave;i h&#7885;c n&agrave;y gi&uacute;p ch&uacute;ng ta hi&#7875;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7853;p tin l&agrave; g&igrave;, c&aacute;ch th&#7913;c t&#7893; ch&#7913;c v&agrave; qu&#7843;n l&yacute; t&#7853;p tin nh&#432; th&#7871; n&agrave;o. T&#7915; <FONT FACE="Times New Roman">&#273;ó giúp chúng ta hi&#7875;u &#273;</FONT>&#432;&#7907;c c&aacute;c c&#417; ch&#7871; c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t h&#7879; th&#7889;ng t&#7853;p tin tr</FONT>&ecirc;n c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh.</P>
<P ALIGN="JUSTIFY">B&agrave;i h&#7885;c n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&ograve;i h&#7887;i nh&#7919;ng ki&#7871;n th&#7913;c v&#7873; : c&aacute;c thao t&aacute;c v&#7899;i t&#7853;p tin, m&#7897;t s&#7889; t&iacute;nh ch&#7845;t c&#7911;a t&#7853;p tin &#7903; g&oacute;c <FONT FACE="Times New Roman">&#273;&#7897; ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng v&agrave; nh&#7919;ng ki&#7871;n th&#7913;c v&#7873; c&#7845;u tr&uacute;c d&#7919; li&#7879;u c&#361;ng nh&#432; v&#7873; ki&#7871;n tr&uacute;c m&aacute;y t&iacute;nh ph&#7847;n c&#7845;u tr&uacute;c v&agrave; t&#7893; ch&#7913;c l&#432;u tr&#7919; c&#7911;a <FONT FACE="Times New Roman">&#273;&#297;a.</P>
</FONT><P ALIGN="JUSTIFY">&nbsp;</P><FONT COLOR="#007f7f"><STRONG></blockquote>

<P ALIGN="JUSTIFY" class="cap1"><a name="khainiem">I. C&Aacute;C KH&Aacute;I NI&#7878;M C&#416; B&#7842;N</a></P>
</STRONG>
</FONT><STRONG><P ALIGN="JUSTIFY" class="cap2"><FONT SIZE=4><a name="bonhongoai"><img border="0" src="images/read_single.gif" width="15" height="12">
I.1 B&#7897; nh&#7899; ngo&agrave;i</a></FONT> </P><blockquote>

</STRONG><P ALIGN="JUSTIFY">M&aacute;y t&iacute;nh ph&#7843;i s&#7917; d&#7909;ng thi&#7871;t b&#7883; c&oacute; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng l</FONT>&#432;u tr&#7919; trong th&#7901;i gian d&agrave;i (long-term) v&igrave; :</P><blockquote>

<blockquote>

<P ALIGN="JUSTIFY">Ph&#7843;i ch&#7913;a nh&#7919;ng l&#432;&#7907;ng th&ocirc;ng tin r&#7845;t l&#7899;n (gi&#7919; v&eacute; m&aacute;y bay, ng&acirc;n h&agrave;ng...)</P>
<P ALIGN="JUSTIFY">Th&ocirc;ng tin ph&#7843;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u gi&#7919; m&#7897;t th&#7901;i gian d&agrave;i tr&#432;&#7899;c khi x&#7917; l&yacute; </P>
<P ALIGN="JUSTIFY">Nhi&#7873;u ti&#7871;n tr&igrave;nh c&oacute; th&#7875; truy c&#7853;p th&ocirc;ng tin c&ugrave;ng l&uacute;c.</P></blockquote>

</blockquote>

<P ALIGN="JUSTIFY">Gi&#7843;i ph&aacute;p l&agrave; s&#7917; d&#7909;ng c&aacute;c thi&#7871;t b&#7883; l&#432;u tr&#7919; b&ecirc;n ngo&agrave;i g&#7885;i l&agrave; b&#7897; nh&#7899; ngo&agrave;i.</P>
<STRONG></blockquote>

<P class="cap2"><img border="0" src="images/read_single.gif" width="15" height="12"><FONT SIZE=4>
<a name="taptinthumuc">I.2 T&#7853;p tin v&agrave; th&#432; m&#7909;c</a>

</FONT></P></STRONG>

<B><I><P ALIGN="JUSTIFY"> &nbsp;&nbsp;&nbsp; <img border="0" src="images/red.gif" width="7" height="10">T&#7853;p tin</P><blockquote>

</I>

</B>

<P ALIGN="JUSTIFY">T&#7853;p tin l&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; l&#432;u tr&#7919; th&ocirc;ng tin c&#7911;a b&#7897; nh&#7899; ngo&agrave;i. C&aacute;c ti&#7871;n tr&igrave;nh c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;&#7885;c hay t&#7841;o m&#7899;i t&#7853;p tin n&#7871;u c&#7847;n thi&#7871;t. Thông tin tr</FONT>&ecirc;n t&#7853;p tin l&agrave; v&#7919;ng b&#7873;n kh&ocirc;ng b&#7883; &#7843;nh h&#432;&#7903;ng b&#7903;i c&aacute;c x&#7917; l&yacute; t&#7841;o hay k&#7871;t th&uacute;c c&aacute;c ti&#7871;n tr&igrave;nh, ch&#7881; m&#7845;t <FONT FACE="Times New Roman">&#273;i khi user th&#7853;t s&#7921; mu&#7889;n xóa. T&#7853;p tin &#273;</FONT>&#432;&#7907;c  qu&#7843;n l&yacute; b&#7903;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh.</P>
</blockquote>

<B><I><P ALIGN="JUSTIFY"> &nbsp;&nbsp;&nbsp; <img border="0" src="images/red.gif" width="7" height="10">Th&#432; m&#7909;c</P><blockquote>

</B></I><P ALIGN="JUSTIFY">&nbsp;<FONT FACE="Times New Roman">&#272;&#7875; l</FONT>&#432;u tr&#7919; d&atilde;y c&aacute;c t&#7853;p tin, h&#7879; th&#7889;ng qu&#7843;n l&yacute; t&#7853;p tin cung c&#7845;p th&#432; m&#7909;c, m&agrave; trong nhi&#7873;u h&#7879; th&#7889;ng c&oacute; th&#7875; coi nh&#432; l&agrave; t&#7853;p tin.</P>
<STRONG></blockquote>

<P ALIGN="JUSTIFY" class="cap2"><FONT SIZE=4><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="htqltt">I.3 H&#7879; th&#7889;ng qu&#7843;n l&yacute; t&#7853;p tin</a></FONT></P>
</STRONG><blockquote>

<P ALIGN="JUSTIFY">C&aacute;c t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c qu&#7843;n l&yacute; b&#7903;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh v&#7899;i c&#417; ch&#7871; g&#7885;i l&agrave; h&#7879; th&#7889;ng qu&#7843;n l&yacute; t&#7853;p tin. Bao g&#7891;m : c&aacute;ch hi&#7875;n th&#7883;, c&aacute;c y&#7871;u t&#7889; c&#7845;u th&agrave;nh t&#7853;p tin, c&aacute;ch <FONT FACE="Times New Roman">&#273;&#7863;t t</FONT>&ecirc;n, c&aacute;ch truy xu&#7845;t, c&aacute;ch s&#7917; d&#7909;ng  v&agrave; b&#7843;o v&#7879; t&#7853;p tin, c&aacute;c thao t&aacute;c tr&ecirc;n t&#7853;p tin. C&aacute;ch t&#7893; ch&#7913;c th&#432; m&#7909;c, c&aacute;c <FONT FACE="Times New Roman">&#273;&#7863;c tính v</FONT>&agrave; c&aacute;c thao t&aacute;c tr&ecirc;n th&#432; m&#7909;c.</P>
<STRONG></blockquote>

<P>&nbsp;</P>
<P class="cap1"><a name="mohinhtochuc">II. M&Ocirc; H&Igrave;NH T&#7892; CH&#7912;C V&Agrave; QU&#7842;N L&Yacute; C&Aacute;C T&#7852;P TIN</a></P>
<P ALIGN="JUSTIFY" class="cap2"><FONT SIZE=4><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="mohinh">II.1 M&ocirc; h&igrave;nh</a></FONT> </P>
</STRONG><B>
<blockquote>
  <P> <img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#mhtaptin">T&#7853;p
  tin</a></P><P><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#mhthumuc">Th&#432;
  m&#7909;c</a></P>
</blockquote>
<P> <a name="mhtaptin">&nbsp;&nbsp;&nbsp; <img border="0" src="images/bulletjock.gif" width="18" height="18">T&#7853;p tin :</a></P>

<I>
<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">T&ecirc;n t&#7853;p tin :</P>
</blockquote>
</I>
</B><blockquote>

<blockquote>

<P ALIGN="JUSTIFY">T&#7853;p tin l&agrave; m&#7897;t c&#417; ch&#7871; tr&#7915;u t&#432;&#7907;ng v&agrave; <FONT FACE="Times New Roman">&#273;&#7875; qu&#7843;n lý m&#7895;i &#273;&#7889;i t</FONT>&#432;&#7907;ng ph&#7843;i c&oacute; m&#7897;t t&ecirc;n. Khi ti&#7871;n tr&igrave;nh t&#7841;o m&#7897;t t&#7853;p tin, n&oacute; s&#7869; <FONT FACE="Times New Roman">&#273;&#7863;t m&#7897;t t</FONT>&ecirc;n, khi ti&#7871;n tr&igrave;nh k&#7871;t th&uacute;c t&#7853;p tin v&#7851;n t&#7891;n t&#7841;i v&agrave; c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c truy xu&#7845;t b&#7903;i c&aacute;c ti&#7871;n tr&igrave;nh kh&aacute;c v&#7899;i t&ecirc;n t&#7853;p tin <FONT FACE="Times New Roman">&#273;ó.</P>
</FONT>
<P ALIGN="JUSTIFY">C&aacute;ch <FONT FACE="Times New Roman">&#273;&#7863;t t</FONT>&ecirc;n t&#7853;p tin c&#7911;a m&#7895;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&agrave; kh&aacute;c nhau, <FONT FACE="Times New Roman">&#273;a s&#7889; các h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh cho ph&eacute;p s&#7917; d&#7909;ng 8 ch&#7919; c&aacute;i <FONT FACE="Times New Roman">&#273;&#7875; &#273;&#7863;t t</FONT>&ecirc;n t&#7853;p tin nh&#432; ctdl, caycb, tamhghau v.v…, th&#432;&#7901;ng th&#432;&#7901;ng th&igrave; c&aacute;c k&yacute; t&#7921; s&#7889; v&agrave; k&yacute; t&#7921; <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t c&#361;ng &#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng nh&#432; baitap2…,</P>
<P ALIGN="JUSTIFY">H&#7879; th&#7889;ng t&#7853;p tin c&oacute; th&#7875; c&oacute; hay kh&ocirc;ng ph&acirc;n bi&#7879;t ch&#7919; th&#432;&#7901;ng v&agrave; ch&#7919; hoa. V&iacute; d&#7909;&nbsp;: UNIX ph&acirc;n bi&#7879;t ch&#7919; th&#432;&#7901;ng v&agrave; hoa c&ograve;n MS-DOS th&igrave; kh&ocirc;ng ph&acirc;n bi&#7879;t.</P>
<P ALIGN="JUSTIFY">Nhi&#7873;u h&#7879; th&#7889;ng t&#7853;p tin h&#7895; tr&#7907; t&ecirc;n t&#7853;p tin g&#7891;m 2 ph&#7847;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&acirc;n c&aacute;ch b&#7903;i d&#7845;u ‘.’ m&agrave; ph&#7847;n sau <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; ph&#7847;n m&#7903; r&#7897;ng. V&iacute; d&#7909;&nbsp;: vidu.txt. Trong MS-DOS t&ecirc;n t&#7853;p tin c&oacute; t&#7915; 1 <FONT FACE="Times New Roman">&#273;&#7871;n 8 ký t</FONT>&#432;, ph&#7847;n m&#7903; r&#7897;ng c&oacute; t&#7915; 1 <FONT FACE="Times New Roman">&#273;&#7871;n 3 ký t&#7921;. Trong UNIX có th&#7875; có nhi&#7873;u phân cách nh</FONT>&#432; prog.c.Z. M&#7897;t s&#7889; ki&#7875;u m&#7903; r&#7897;ng th&ocirc;ng th&#432;&#7901;ng l&agrave;&nbsp;:</P>
<P ALIGN="JUSTIFY">.bak, .bas, .bin, .c, .dat, .doc, .ftn, .hlp, .lib, .obj, .pas, .tex, .txt.</P>
<P ALIGN="JUSTIFY">Tr&ecirc;n th&#7921;c t&#7871; ph&#7847;n m&#7903; r&#7897;ng c&oacute; h&#7919;u &iacute;ch trong m&#7897;t s&#7889; tr&#432;&#7901;ng h&#7907;p, v&iacute; d&#7909; nh&#432; c&oacute; nh&#7919;ng tr&igrave;nh d&#7883;ch C ch&#7881; nh&#7853;n bi&#7871;t c&aacute;c t&#7853;p tin c&oacute; ph&#7847;n m&#7903; r&#7897;ng l&agrave; .C</P>
<B><I></blockquote>

</blockquote>

<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">C&#7845;u tr&uacute;c c&#7911;a t&#7853;p tin :</P></I>

</B>
<blockquote>
<P ALIGN="JUSTIFY">G&#7891;m 3 lo&#7841;i :</P>
</blockquote>
</blockquote>
<blockquote>

<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10"> D&atilde;y tu&#7847;n t&#7921; c&aacute;c byte kh&ocirc;ng c&#7845;u tr&uacute;c : h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh kh&ocirc;ng bi&#7871;t n&#7897;i dung c&#7911;a t&#7853;p tin:MS-DOS v&agrave; UNIX s&#7917; d&#7909;ng lo&#7841;i n&agrave;y.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10"> D&atilde;y c&aacute;c record c&oacute; chi&#7873;u d&agrave;i c&#7889; <FONT FACE="Times New Roman">&#273;&#7883;nh.</P>
</FONT>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10"> C&#7845;u tr&uacute;c c&acirc;y : g&#7891;m c&acirc;y c&#7911;a nh&#7919;ng record, kh&ocirc;ng c&#7847;n thi&#7871;t c&oacute; c&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7897; d</FONT>&agrave;i, m&#7895;i record c&oacute; m&#7897;t tr&#432;&#7901;ng kh&oacute;a gi&uacute;p cho vi&#7879;c t&igrave;m ki&#7871;m nhanh h&#417;n.</P>
<B><I></blockquote>

</blockquote>

<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">Ki&#7875;u t&#7853;p tin :</P>
</blockquote>
</I>
</B><blockquote>

<blockquote>

<P ALIGN="JUSTIFY">N&#7871;u h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh nh&#7853;n bi&#7871;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c lo&#7841;i t&#7853;p tin, n&oacute; c&oacute; th&#7875; thao t&aacute;c m&#7897;t c&aacute;ch h&#7907;p l&yacute; tr&ecirc;n t&#7853;p tin <FONT FACE="Times New Roman">&#273;ó. Các </FONT>h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh h&#7895; tr&#7907; cho nhi&#7873;u lo&#7841;i t&#7853;p tin kh&aacute;c nhau bao g&#7891;m c&aacute;c ki&#7875;u nh&#432; : t&#7853;p tin th&#432;&#7901;ng, th&#432; m&#7909;c, t&#7853;p tin c&oacute; k&yacute; t&#7921; <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t, t&#7853;p tin kh&#7889;i.</P>
</FONT><P ALIGN="JUSTIFY"><I><img border="0" src="images/red.gif" width="7" height="10">T&#7853;p tin th&#432;&#7901;ng</I> : l&agrave; t&#7853;p tin text hay t&#7853;p tin nh&#7883; ph&acirc;n ch&#7913;a th&ocirc;ng tin c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng.</P>
<P ALIGN="JUSTIFY"><I><img border="0" src="images/red.gif" width="7" height="10">Th&#432; m&#7909;c</I> : l&agrave; nh&#7919;ng t&#7853;p tin h&#7879; th&#7889;ng d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7875; l</FONT>&#432;u gi&#7919; c&#7845;u tr&uacute;c c&#7911;a h&#7879; th&#7889;ng t&#7853;p tin.</P>
<P ALIGN="JUSTIFY"><I><img border="0" src="images/red.gif" width="7" height="10">T&#7853;p tin c&oacute; k&yacute; t&#7921; <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t</I></FONT> : li&ecirc;n quan <FONT FACE="Times New Roman">&#273;&#7871;n nh&#7853;p xu&#7845;t thông qua các thi&#7871;t b&#7883; nh&#7853;p xu&#7845;t tu&#7847;n t&#7921; nh</FONT>&#432; m&agrave;n h&igrave;nh, m&aacute;y in, m&#7841;ng.</P>
<P ALIGN="JUSTIFY"><I><img border="0" src="images/red.gif" width="7" height="10">T&#7853;p tin kh&#7889;i</I> : d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7875; truy xu&#7845;t tr</FONT>&ecirc;n thi&#7871;t b&#7883; <FONT FACE="Times New Roman">&#273;&#297;a.</P>
</FONT>
<P ALIGN="JUSTIFY"><I><img border="0" src="images/red.gif" width="7" height="10"></I>T&#7853;p tin th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia l&agrave;m hai lo&#7841;i l&agrave; t&#7853;p tin v<FONT FACE="Times New Roman">&#259;n b&#7843;n v</FONT>&agrave; t&#7853;p tin nh&#7883; ph&acirc;n.</P>
<B><I><P ALIGN="JUSTIFY">T&#7853;p tin v<FONT FACE="Times New Roman">&#259;n b&#7843;n</B></I></FONT> ch&#7913;a c&aacute;c d&ograve;ng v<FONT FACE="Times New Roman">&#259;n b&#7843;n cu&#7889;i d</FONT>&ograve;ng c&oacute; k&yacute; hi&#7879;u enter. M&#7895;i d&ograve;ng c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; d</FONT>&agrave;i c&oacute; th&#7875; kh&aacute;c nhau. &#431;u <FONT FACE="Times New Roman">&#273;i&#7875;m c&#7911;a ki&#7875;u t&#7853;p tin n</FONT>&agrave;y l&agrave; n&oacute; c&oacute; th&#7875; hi&#7875;n th&#7883;, in hay so&#7841;n th&#7843;o v&#7899;i m&#7897;t editor th&ocirc;ng th&#432;&#7901;ng.<FONT FACE="Times New Roman">&#272;a s&#7889; các ch</FONT>&#432;&#417;ng tr&igrave;nh d&ugrave;ng t&#7853;p tin v<FONT FACE="Times New Roman">&#259;n b&#7843;n  &#273;&#7875; nh&#7853;p xu&#7845;t, nó c&#361;ng d&#7877; d</FONT>&agrave;ng l&agrave;m <FONT FACE="Times New Roman">&#273;&#7847;u v</FONT>&agrave;o v&agrave; <FONT FACE="Times New Roman">&#273;&#7847;u ra cho c</FONT>&#417; ch&#7871; pipeline.</P>
<B><I><P ALIGN="JUSTIFY">T&#7853;p tin nh&#7883; ph&acirc;n :</I> </B> c&oacute; c&#7845;u tr&uacute;c kh&aacute;c t&#7853;p tin v<FONT FACE="Times New Roman">&#259;n b&#7843;n. M&#7863;c d</FONT>&ugrave; v&#7873; m&#7863;t k&#7929; thu&#7853;t , t&#7853;p tin nh&#7883; ph&acirc;n g&#7891;m d&atilde;y c&aacute;c byte , nh&#432;ng h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ch&#7881; th&#7921;c thi t&#7853;p tin <FONT FACE="Times New Roman">&#273;ó n&#7871;u nó có c&#7845;u trúc &#273;úng. Ví d&#7909; m&#7897;t m&#7897;t </FONT>t&#7853;p tin nh&#7883; ph&acirc;n thi h&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7911;a UNIX. Th&#432;&#7901;ng th&#432;&#7901;ng n&oacute; bao g&#7891;m n<FONT FACE="Times New Roman">&#259;m th</FONT>&agrave;nh ph&#7847;n : header, text, data, relocation bits, symbol table. Header b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u b&#7903;i byte nh&#7853;n di&#7879;n cho</FONT> bi&#7871;t <FONT FACE="Times New Roman">&#273;ó l</FONT>&agrave; t&#7853;p tin thi h&agrave;nh. Sau <FONT FACE="Times New Roman">&#273;ó l</FONT>&agrave; 16 bit cho bi&#7871;t k&iacute;ch th&#432;&#7899;c c&aacute;c th&agrave;nh ph&#7847;n c&#7911;a t&#7853;p tin, <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; b&#7855;t &#273;&#7847;u th&#7921;c hi&#7879;n v</FONT>&agrave; m&#7897;t s&#7889; bit c&#7901;. Sau header l&agrave; d&#7919; li&#7879;u v&agrave; text c&#7911;a t&#7853;p tin. N&oacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o b&#7897; nh&#7899; v&agrave; <FONT FACE="Times New Roman">&#273;&#7883;nh v&#7883; l&#7841;i b&#7903;i nh&#7919;ng bit relocation. B&#7843;ng symbo</FONT>l <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7875; debug.</P>
</FONT>
<P ALIGN="JUSTIFY">M&#7897;t v&iacute; d&#7909; kh&aacute;c l&agrave; t&#7853;p tin nh&#7883; ph&acirc;n ki&#7875;u archive. N&oacute; ch&#7913;a c&aacute;c th&#432; vi&#7879;n <FONT FACE="Times New Roman">&#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c d&#7883;ch nh&#432;ng ch&#432;a <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c li&ecirc;n k&#7871;t. Bao g&#7891;m m&#7897;t header cho bi&#7871;t t&ecirc;n, ng&agrave;y t&#7841;o, ng&#432;&#7901;i s&#7903; h&#7919;u, m&atilde; b&#7843;o v&#7879;, v&agrave; k&iacute;ch th&#432;&#7899;c…</P>

<P ALIGN="center"><img border="0" src="images/hinh8.1.gif" width="376" height="480"></P>

<B><I></blockquote>

</blockquote>

<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">Truy xu&#7845;t t&#7853;p tin :</P>
</blockquote>
</I>
</B><blockquote>

<blockquote>

<P ALIGN="JUSTIFY">T&#7853;p tin l&#432;u tr&#7919; c&aacute;c th&ocirc;ng tin. Khi t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng, c&aacute;c th&ocirc;ng tin n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o b&#7897; nh&#7899; c&#7911;a m&aacute;y t&iacute;nh. C&oacute; nhi&#7873;u c&aacute;ch <FONT FACE="Times New Roman">&#273;&#7875; truy xu&#7845;t chúng. M&#7897;t s&#7889; h&#7879; th&#7889;ng cung c&#7845;p ch&#7881; m&#7897;t ph</FONT>&#432;&#417;ng ph&aacute;p truy xu&#7845;t, m&#7897;t s&#7889; h&#7879; th&#7889;ng kh&aacute;c, nh&#432; IBM ch&#7859;ng h&#7841;n cho ph&eacute;p nhi&#7873;u c&aacute;ch truy xu&#7845;t.</P>
<P ALIGN="JUSTIFY"> Ki&#7875;u truy xu&#7845;t t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n nh&#7845;t l&agrave; truy xu&#7845;t  tu&#7847;n t&#7921; . Ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7885;c t&#7845;t c&#7843; các byte trong t&#7853;p tin theo th&#7913; t&#7921; t&#7915; &#273;&#7847;u. Các tr</FONT>&igrave;nh so&#7841;n th&#7843;o hay tr&igrave;nh bi&ecirc;n d&#7883;ch c&#361;ng truy xu&#7845;t t&#7853;p tin theo c&aacute;ch n&agrave;y. Hai thao t&aacute;c ch&#7911; y&#7871;u tr&ecirc;n t&#7853;p tin l&agrave; <FONT FACE="Times New Roman">&#273;&#7885;c v</FONT>&agrave; ghi. Thao t&aacute;c <FONT FACE="Times New Roman">&#273;&#7885;c s&#7869; &#273;&#7885;c m&#7897;t m&#7851;u tin ti&#7871;p theo tr</FONT>&ecirc;n t&#7853;p tin v&agrave; t&#7921; <FONT FACE="Times New Roman">&#273;&#7897;ng t&#259;ng con tr&#7887; t&#7853;p tin. Thao tác ghi c&#361;ng t</FONT>&#432;&#417;ng t&#7921; nh&#432; v&#7853;y. T&#7853;p tin c&oacute; th&#7875; t&#7921; kh&#7903;i <FONT FACE="Times New Roman">&#273;&#7897;ng l&#7841;i t&#7915; v&#7883; trí &#273;&#7847;u ti</FONT>&ecirc;n v&agrave; trong m&#7897;t s&#7889; h&#7879; th&#7889;ng t&#7853;p tin cho ph&eacute;p di chuy&#7875;n con tr&#7887; t&#7853;p tin <FONT FACE="Times New Roman">&#273;i</FONT> t&#7899;i ho&#7863;c <FONT FACE="Times New Roman">&#273;i lui  n  m&#7851;u tin.</P>
</FONT>
<P ALIGN="JUSTIFY">Truy xu&#7845;t ki&#7875;u n&agrave;y thu&#7853;n l&#7907;i cho c&aacute;c lo&#7841;i b<FONT FACE="Times New Roman">&#259;ng t&#7915; v</FONT>&agrave; c&#361;ng l&agrave; c&aacute;ch truy xu&#7845;t kh&aacute; th&ocirc;ng d&#7909;ng.  Truy xu&#7845;t tu&#7847;n t&#7921; c&#7847;n thi&#7871;t cho nhi&#7873;u &#7913;ng d&#7909;ng. C&oacute; hai c&aacute;ch truy xu&#7845;t.  C&aacute;ch truy xu&#7845;t th&#7913; nh&#7845;t thao t&aacute;c <FONT FACE="Times New Roman">&#273;&#7885;c b&#7855;t &#273;&#7847;u &#7903; v&#7883; trí &#273;&#7847;u t&#7853;p tin, cách th&#7913; hai có m&#7897;t thao tác &#273;&#7863;c bi&#7879;t g&#7885;i l</FONT>&agrave; SEEK cung c&#7845;p v&#7883; tr&iacute; hi&#7879;n th&#7901;i l&agrave;m v&#7883; tr&iacute; b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u. Sau &#273;ó t&#7853;p tin &#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7885;c tu&#7847;n t&#7921; t&#7915; v&#7883; trí b&#7855;t &#273;&#7847;u.

</FONT></P>
<P ALIGN="center"><img border="0" src="images/hinh8.2.gif" width="361" height="138"></P></blockquote>

<blockquote>

<P ALIGN="JUSTIFY">M&#7897;t ki&#7875;u truy xu&#7845;t kh&aacute;c l&agrave; truy xu&#7845;t tr&#7921;c ti&#7871;p. M&#7897;t t&#7853;p tin c&oacute; c&#7845;u tr&uacute;c l&agrave; c&aacute;c m&#7851;u tin logic c&oacute; k&iacute;ch th&#432;&#7899;c b&#7857;ng nhau, n&oacute; cho ph&eacute;p ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7885;c ho&#7863;c ghi nhanh chóng m</FONT>&agrave; kh&ocirc;ng c&#7847;n theo th&#7913; t&#7921;. Ki&#7875;u truy xu&#7845;t n&agrave;y d&#7921;a tr&ecirc;n m&ocirc; h&igrave;nh c&#7911;a <FONT FACE="Times New Roman">&#273;&#297;a. &#272;&#297;a cho phép truy xu&#7845;t ng&#7851;u nhi</FONT>&ecirc;n b&#7845;t k&#7923; kh&#7889;i d&#7919; li&#7879;u n&agrave;o c&#7911;a t&#7853;p tin. Truy xu&#7845;t tr&#7921;c ti&#7871;p <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng trong tr&#432;&#7901;ng h&#7907;p ph&#7843;i truy xu&#7845;t m&#7897;t kh&#7889;i l&#432;&#7907;ng th&ocirc;ng tin l&#7899;n nh&#432; trong c&#417; s&#7903; d&#7919; li&#7879;u ch&#7859;ng h&#7841;n. Ngo&agrave;i ra c&ograve;n c&oacute; m&#7897;t s&#7889; c&aacute;ch truy xu&#7845;t kh&aacute;c d&#7921; tr&ecirc;n ki&#7875;u truy xu&#7845;t n&agrave;y nh&#432; truy xu&#7845;t theo ch&#7881; m&#7909;c ...</P>

<B><I>
</blockquote>

</blockquote>

<blockquote>
  <p ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">Thu&#7897;c t&iacute;nh t&#7853;p tin :</p>
</blockquote>
</I>
</B><blockquote>

<blockquote>

<P ALIGN="JUSTIFY">Ngo&agrave;i t&ecirc;n v&agrave; d&#7919; li&#7879;u, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh cung c&#7845;p th&ecirc;m m&#7897;t s&#7889; th&ocirc;ng tin cho t&#7853;p tin g&#7885;i l&agrave; thu&#7897;c t&iacute;nh. </P>
<P ALIGN="JUSTIFY">C&aacute;c thu&#7897;c t&iacute;nh th&ocirc;ng d&#7909;ng trong m&#7897;t s&#7889; h&#7879; th&#7889;ng t&#7853;p tin : </P>
<P ALIGN="CENTER"><CENTER><TABLE BORDER="1" CELLSPACING=1 CELLPADDING=7 WIDTH=482>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD1">
<P ALIGN="CENTER">T&ecirc;n thu&#7897;c t&iacute;nh</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD1">
<P ALIGN="CENTER">&Yacute; ngh&#297;a</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">B&#7843;o v&#7879;</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Ai c&oacute; th&#7875; truy xu&#7845;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c v&agrave; b&#7857;ng c&aacute;ch n&agrave;o</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">M&#7853;t kh&#7849;u</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">M&#7853;t kh&#7849;u c&#7847;n thi&#7871;t <FONT FACE="Times New Roman">&#273;&#7875; truy xu&#7845;t t&#7853;p tin</FONT></TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Ng&#432;&#7901;i t&#7841;o</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Id c&#7911;a ng&#432;&#7901;i t&#7841;o t&#7853;p tin</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Ng&#432;&#7901;i s&#7903; h&#7919;u</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Ng&#432;&#7901;i s&#7903; h&#7919;u hi&#7879;n t&#7841;i</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Ch&#7881; <FONT FACE="Times New Roman">&#273;&#7885;c</FONT></TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">0 l&agrave; <FONT FACE="Times New Roman">&#273;&#7885;c ghi, 1 l</FONT>&agrave; ch&#7881; <FONT FACE="Times New Roman">&#273;&#7885;c</FONT></TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">A&aring;n</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">0 l&agrave; b&igrave;nh th&#432;&#7901;ng, 1 l&agrave; kh&ocirc;ng hi&#7875;n th&#7883; khi li&#7879;t k&ecirc;</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">H&#7879; th&#7889;ng</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">0 l&agrave; b&igrave;nh th&#432;&#7901;ng, 1 l&agrave; t&#7853;p tin h&#7879; th&#7889;ng</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">L&#432;u tr&#7919;</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">0 <FONT FACE="Times New Roman">&#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;u&#7907;c backup, 1 c&#7847;n backup</FONT></TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">ASCII/binary</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">0 l&agrave; t&#7853;p tin v<FONT FACE="Times New Roman">&#259;n b&#7843;n, 1 l</FONT>&agrave; t&#7853;p tin nh&#7883; ph&acirc;n</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Truy xu&#7845;t ng&#7851;u nhi&ecirc;n</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">0 truy xu&#7845;t tu&#7847;n t&#7921;, 1 l&agrave; truy xu&#7845;t ng&#7851;u nhi&ecirc;n</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Temp</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">0 l&agrave; b&igrave;nh th&#432;&#7901;ng, 1 l&agrave; b&#7883; x&oacute;a khi ti&#7871;n tr&igrave;nh k&#7871;t th&uacute;c</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Kh&oacute;a</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">0 l&agrave; kh&ocirc;ng kh&oacute;a, kh&aacute;c 0 l&agrave; kh&oacute;a</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#7897; d</FONT>&agrave;i c&#7911;a record</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">S&#7889; byte trong m&#7897;t record</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">V&#7883; tr&iacute; kh&oacute;a</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Offset c&#7911;a kh&oacute;a trong m&#7895;i record</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Gi&#7901; t&#7841;o</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Ng&agrave;y v&agrave; gi&#7901; t&#7841;o t&#7853;p tin</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Th&#7901;i gian truy c&#7853;p cu&#7889;i c&ugrave;ng</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Ng&agrave;y v&agrave; gi&#7901; truy xu&#7845;t t&#7853;p tin g&#7847;n nh&#7845;t</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Th&#7901;i gian thay <FONT FACE="Times New Roman">&#273;&#7893;i cu&#7889;i c</FONT>&ugrave;ng</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">Ng&agrave;y v&agrave; gi&#7901; thay <FONT FACE="Times New Roman">&#273;&#7893;i t&#7853;p tin g&#7847;n nh&#7845;t</FONT></TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">K&iacute;ch th&#432;&#7899;c hi&#7879;n th&#7901;i</TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">S&#7889; byte c&#7911;a t&#7853;p tin</TD>
</TR>
<TR><TD WIDTH="132" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">K&iacute;ch th&#432;&#7899;c t&#7889;i <FONT FACE="Times New Roman">&#273;a.</FONT></TD>
<TD WIDTH="310" VALIGN="TOP" class="TD2">
<P ALIGN="JUSTIFY">S&#7889; byte t&#7889;i <FONT FACE="Times New Roman">&#273;a c&#7911;a t&#7853;p tin</FONT></TD>
</TR>
</TABLE>
<B><P ALIGN="center">H&igrave;nh 8.3</B>  M&#7897;t s&#7889; thu&#7897;c t&iacute;nh th&ocirc;ng d&#7909;ng c&#7911;a t&#7853;p tin</P>
</CENTER>
</blockquote>

</blockquote>

<B><I><P> <a name="mhthumuc">&nbsp;&nbsp;&nbsp; <img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#432; m&#7909;c :&nbsp;</a></P><blockquote>
<blockquote>

<FONT SIZE=2></blockquote>

</FONT>

</B></I><P>

<B><I><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
H&#7878; TH&#7888;NG TH&#431; M&#7908;C THEO C&#7844;P B&#7852;C :</I></B></P>
<blockquote>

<P ALIGN="JUSTIFY">M&#7897;t th&#432; m&#7909;c th&#432;&#7901;ng th&#432;&#7901;ng ch&#7913;a m&#7897;t s&#7889; <I>entry</I>, m&#7895;i entry cho m&#7897;t t&#7853;p tin. M&#7895;i entry ch&#7913;a t&ecirc;n t&#7853;p tin, thu&#7897;c t&iacute;nh v&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a l</FONT>&#432;u d&#7919; li&#7879;u ho&#7863;c m&#7897;t entry ch&#7881; ch&#7913;a t&ecirc;n t&#7853;p tin v&agrave; m&#7897;t con tr&#7887;, tr&#7887; t&#7899;i m&#7897;t c&#7845;u tr&uacute;c, tr&ecirc;n <FONT FACE="Times New Roman">&#273;ó có thu&#7897;c tính v</FONT>&agrave; v&#7883; tr&iacute; l&#432;u tr&#7919; c&#7911;a t&#7853;p tin.</P>
<P ALIGN="JUSTIFY">Khi m&#7897;t t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c m&#7903;, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh t&igrave;m tr&ecirc;n th&#432; m&#7909;c c&#7911;a n&oacute; cho t&#7899;i khi t&igrave;m th&#7845;y t&ecirc;n c&#7911;a t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c m&#7903;. Sau <FONT FACE="Times New Roman">&#273;ó nó s&#7869; xác &#273;&#7883;nh thu&#7897;c tính c&#361;ng nh</FONT>&#432; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; l</FONT>&#432;u tr&#7919; tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a v</FONT>&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o m&#7897;t b&#7843;ng trong b&#7897; nh&#7899;. Nh&#7919;ng truy xu&#7845;t sau <FONT FACE="Times New Roman">&#273;ó th&#7921;c hi&#7879;n trong b&#7897; nh&#7899; chính.</P>
</FONT>
<P ALIGN="JUSTIFY">S&#7889; l&#432;&#7907;ng th&#432; m&#7909;c tr&ecirc;n m&#7895;i h&#7879; th&#7889;ng l&agrave; kh&aacute;c nhau. Thi&#7871;t k&#7871; <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n nh&#7845;t l&agrave; h&#7879; th&#7889;ng ch&#7881; c&oacute; th&#432; m&#7909;c <FONT FACE="Times New Roman">&#273;</FONT>&#417;n(c&ograve;n g&#7885;i l&agrave; th&#432; m&#7909;c m&#7897;t c&#7845;p), ch&#7913;a t&#7845;t c&#7843; c&aacute;c t&#7853;p tin c&#7911;a t&#7845;t c&#7843; ng&#432;&#7901;i d&ugrave;ng, c&aacute;ch n&agrave;y d&#7877; t&#7893; ch&#7913;c v&agrave; khai th&aacute;c nh&#432;ng c&#361;ng d&#7877; g&acirc;y ra kh&oacute; kh<FONT FACE="Times New Roman">&#259;n khi có nhi&#7873;u ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng v&igrave; s&#7869; c&oacute; nhi&#7873;u t&#7853;p tin tr&ugrave;ng t&ecirc;n. Ngay c&#7843; trong tr&#432;&#7901;ng h&#7907;p ch&#7881; c&oacute; m&#7897;t ng&#432;&#7901;i s&#7917; d&#7909;ng, n&#7871;u c&oacute; nhi&#7873;u t&#7853;p tin th&igrave; vi&#7879;c <FONT FACE="Times New Roman">&#273;&#7863;t t</FONT>&ecirc;n cho m&#7897;t t&#7853;p tin m&#7899;i kh&ocirc;ng tr&ugrave;ng l&#7855;p l&agrave; m&#7897;t v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; khó. </P>
</FONT>
<P ALIGN="JUSTIFY">C&aacute;ch th&#7913; hai l&agrave; c&oacute; m&#7897;t th&#432; m&#7909;c g&#7889;c v&agrave; trong <FONT FACE="Times New Roman">&#273;ó có nhi&#7873;u th</FONT>&#432; m&#7909;c con, trong m&#7895;i th&#432; m&#7909;c con ch&#7913;a t&#7853;p tin c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng (c&ograve;n g&#7885;i l&agrave; th&#432; m&#7909;c hai c&#7845;p), c&aacute;ch n&agrave;y tr&aacute;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c tr&#432;&#7901;ng h&#7907;p xung <FONT FACE="Times New Roman">&#273;&#7897;t t</FONT>&ecirc;n nh&#432;ng c&#361;ng c&ograve;n kh&oacute; kh<FONT FACE="Times New Roman">&#259;n v&#7899;i ng</FONT>&#432;&#7901;i d&ugrave;ng c&oacute; nhi&#7873;u t&#7853;p tin. Ng&#432;&#7901;i s&#7917; d&#7909;ng lu&ocirc;n mu&#7889;n nh&oacute;m c&aacute;c &#7913;ng d&#7909;ng l&#7841;i m&#7897;t c&aacute;ch logic. </P>
<P ALIGN="JUSTIFY">T&#7915; <FONT FACE="Times New Roman">&#273;ó, h&#7879; th&#7889;ng th</FONT>&#432; m&#7909;c theo c&#7845;p b&#7853;c (c&ograve;n g&#7885;i l&agrave; c&acirc;y th&#432; m&#7909;c) <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c h&igrave;nh th&agrave;nh v&#7899;i m&ocirc; h&igrave;nh m&#7897;t th&#432; m&#7909;c c&oacute; th&#7875; ch&#7913;a t&#7853;p tin ho&#7863;c m&#7897;t th&#432; m&#7909;c con v&agrave; c&#7913; ti&#7871;p t&#7909;c nh&#432; v&#7853;y h&igrave;nh th&agrave;nh c&acirc;y th&#432; m&#7909;c nh&#432; trong c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh DOS, Windows, v. v...</P>
<P ALIGN="JUSTIFY">Ngo&agrave;i ra, trong m&#7897;t s&#7889; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh nhi&#7873;u ng&#432;&#7901;i d&ugrave;ng, h&#7879; th&#7889;ng c&ograve;n x&acirc;y d&#7921;ng c&aacute;c h&igrave;nh th&#7913;c kh&aacute;c c&#7911;a c&#7845;u tr&uacute;c th&#432; m&#7909;c nh&#432; c&#7845;u tr&uacute;c th&#432; m&#7909;c theo <FONT FACE="Times New Roman">&#273;&#7891; th&#7883; có chu tr</FONT>&igrave;nh v&agrave; c&#7845;u tr&uacute;c th&#432; m&#7909;c theo <FONT FACE="Times New Roman">&#273;&#7891; th&#7883; t&#7893;ng quát. Các c&#7845;u trúc n</FONT>&agrave;y cho ph&eacute;p c&aacute;c ng&#432;&#7901;i d&ugrave;ng trong h&#7879; th&#7889;ng c&oacute; th&#7875; li&ecirc;n k&#7871;t v&#7899;i nhau th&ocirc;ng qua c&aacute;c th&#432; m&#7909;c chia s&#7867;.</P>
<P ALIGN="center"><img border="0" src="images/hinh8.4.gif" width="320" height="303"></P>
<P ALIGN="center"><img border="0" src="images/hinh8.5.gif" width="394" height="429"></P>
</blockquote>
<FONT FACE="Times New Roman"><P>

<B><I><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
</I></B><i><b>&#272;</b></i></FONT><i><b>&#431;&#7900;NG D&#7850;N :</b></i></P>
<blockquote>

<P ALIGN="JUSTIFY">Khi m&#7897;t h&#7879; th&#7889;ng t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7893; ch&#7913;c th&agrave;nh m&#7897;t <B><I>c&acirc;y th&#432; m&#7909;c</B></I>, c&oacute; hai c&aacute;ch <FONT FACE="Times New Roman">&#273;&#7875; xác &#273;&#7883;nh m&#7897;t t</FONT>&ecirc;n t&#7853;p tin. C&aacute;ch th&#7913; nh&#7845;t l&agrave; <B><I><FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng d&#7851;n tuy&#7879;t <FONT FACE="Times New Roman">&#273;&#7889;i</B></I></FONT>, m&#7895;i t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&aacute;n m&#7897;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng d&#7851;n t&#7915; th&#432; m&#7909;c g&#7889;c <FONT FACE="Times New Roman">&#273;&#7871;n t&#7853;p tin. Ví d&#7909; : /u</FONT>sr/ast/mailbox.</P>

<P ALIGN="JUSTIFY">D&#7841;ng th&#7913; hai l&agrave; <B><I><FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng d&#7851;n t&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i</B></I></FONT>, d&#7841;ng n&agrave;y c&oacute; li&ecirc;n quan <FONT FACE="Times New Roman">&#273;&#7871;n m&#7897;t khái ni&#7879;m l</FONT>&agrave; <B><I>th&#432; m&#7909;c hi&#7879;n h&agrave;nh </B></I>hay th&#432; m&#7909;c l&agrave;m vi&#7879;c. Ng&#432;&#7901;i s&#7917; d&#7909;ng c&oacute; th&#7875; quy <FONT FACE="Times New Roman">&#273;&#7883;nh m&#7897;t th</FONT>&#432; m&#7909;c l&agrave; th&#432; m&#7909;c hi&#7879;n h&agrave;nh. Khi <FONT FACE="Times New Roman">&#273;ó &#273;</FONT>&#432;&#7901;ng d&#7851;n kh&ocirc;ng b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u t&#7915; th</FONT>&#432; m&#7909;c g&#7889;c m&agrave; li&ecirc;n quan <FONT FACE="Times New Roman">&#273;&#7871;n th</FONT>&#432; m&#7909;c hi&#7879;n h&agrave;nh. V&iacute; d&#7909;, n&#7871;u th&#432; m&#7909;c hi&#7879;n h&agrave;nh l&agrave; /usr/ast th&igrave; t&#7853;p tin v&#7899;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng d&#7851;n tuy&#7879;t <FONT FACE="Times New Roman">&#273;&#7889;i /usr/ast/mailbox có th&#7875; &#273;</FONT>&#432;&#7907;c d&ugrave;ng <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n l&agrave; mailbox.</P>
<P ALIGN="JUSTIFY">Trong ph&#7847;n l&#7899;n h&#7879; th&#7889;ng, m&#7895;i ti&#7871;n tr&igrave;nh c&oacute; m&#7897;t th&#432; m&#7909;c hi&#7879;n h&agrave;nh ri&ecirc;ng, khi m&#7897;t ti&#7871;n tr&igrave;nh thay <FONT FACE="Times New Roman">&#273;&#7893;i th</FONT>&#432; m&#7909;c l&agrave;m vi&#7879;c v&agrave; k&#7871;t th&uacute;c, kh&ocirc;ng c&oacute; s&#7921; thay <FONT FACE="Times New Roman">&#273;&#7893;i &#273;&#7875; l&#7841;i tr</FONT>&ecirc;n h&#7879; th&#7889;ng t&#7853;p tin. Nh&#432;ng n&#7871;u m&#7897;t h&agrave;m th&#432; vi&#7879;n thay <FONT FACE="Times New Roman">&#273;&#7893;i &#273;</FONT>&#432;&#7901;ng d&#7851;n v&agrave; sau <FONT FACE="Times New Roman">&#273;ó không &#273;&#7893;i l&#7841;i th</FONT>&igrave; s&#7869; c&oacute; &#7843;nh h&#432;&#7903;ng <FONT FACE="Times New Roman">&#273;&#7871;n ti&#7871;n tr</FONT>&igrave;nh.</P>
<P ALIGN="JUSTIFY">H&#7847;u h&#7871;t c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;&#7873;u h&#7895; tr&#7907; h&#7879; th&#7889;ng th</FONT>&#432; m&#7909;c theo c&#7845;p b&#7853;c v&#7899;i hai entry <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t cho m&#7895;i th</FONT>&#432; m&#7909;c l&agrave; "." v&agrave; "..". "."  ch&#7881; th&#432; m&#7909;c hi&#7879;n h&agrave;nh, ".." ch&#7881; th&#432; m&#7909;c cha.</P>
</blockquote>

<B>

</B><STRONG></blockquote>

<P class="cap2"><FONT SIZE=4><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="chucnang">II.2 C&aacute;c ch&#7913;c n</a></FONT><a name="chucnang"><FONT FACE="Times New Roman" SIZE=4>&#259;ng

</FONT></a></P></STRONG><B>
<blockquote>
  <P> <img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#cntaptin">T&#7853;p
  tin</a></P><P><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#cnthumuc">Th&#432;
  m&#7909;c</a></P>
</blockquote>
<P>&nbsp;&nbsp;&nbsp; <a name="cntaptin"><img border="0" src="images/bulletjock.gif" width="18" height="18">
T&#7853;p tin :</a></P>

</B>

<I>
<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">T&#7841;o</I> : m&#7897;t t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o ch&#432;a c&oacute; d&#7919; li&#7879;u. M&#7909;c ti&ecirc;u c&#7911;a ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng n</FONT>&agrave;y l&agrave; th&ocirc;ng b&aacute;o cho bi&#7871;t r&#7857;ng t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&atilde; t&#7891;n t&#7841;i v&agrave; thi&#7871;t l&#7853;p m&#7897;t s&#7889; thu&#7897;c t&iacute;nh.</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">X&oacute;a</I> :khi m&#7897;t t&#7853;p tin kh&ocirc;ng c&ograve;n c&#7847;n thi&#7871;t n&#7919;a, n&oacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c x&oacute;a <FONT FACE="Times New Roman">&#273;&#7875; t&#259;ng dung l</FONT>&#432;&#7907;ng <FONT FACE="Times New Roman">&#273;&#297;a. M&#7897;t s&#7889; h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh t&#7921; <FONT FACE="Times New Roman">&#273;&#7897;ng xoá t&#7853;p tin sau m&#7897;t kho&#7843;ng th&#7901;i gian n ng</FONT>&agrave;y.</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">M&#7903;</I> : tr&#432;&#7899;c khi s&#7917; d&#7909;ng m&#7897;t t&#7853;p tin, ti&#7871;n tr&igrave;nh ph&#7843;i m&#7903; n&oacute;. M&#7909;c ti&ecirc;u c&#7911;a m&#7903; l&agrave; cho ph&eacute;p h&#7879; th&#7889;ng thi&#7871;t l&#7853;p m&#7897;t s&#7889; thu&#7897;c t&iacute;nh v&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#273;&#297;a trong b&#7897; nh&#7899; &#273;&#7875; t&#259;ng t&#7889;c &#273;&#7897; truy xu&#7845;t.</FONT>&nbsp;</P>
<I><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">&#272;óng</I></FONT> : khi ch&#7845;m d&#7913;t truy xu&#7845;t, thu&#7897;c t&iacute;nh v&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a không c&#7847;n d</FONT>&ugrave;ng n&#7919;a, t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;óng l&#7841;i &#273;&#7875; gi&#7843;i phóng v</FONT>&ugrave;ng nh&#7899;. M&#7897;t s&#7889; h&#7879; th&#7889;ng h&#7841;n ch&#7871; t&#7889;i <FONT FACE="Times New Roman">&#273;a s&#7889; t&#7853;p tin m&#7903; trong m&#7897;t ti&#7871;n tr</FONT>&igrave;nh.</P>
<I><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">&#272;&#7885;c</FONT> </I> : <FONT FACE="Times New Roman">&#273;&#7885;c d&#7919; li&#7879;u t&#7915; t&#7853;p tin t&#7841;i v&#7883; trí hi&#7879;n th&#7901;i c&#7911;a &#273;&#7847;u &#273;&#7885;c, n</FONT>&#417;i g&#7885;i s&#7869; cho bi&#7871;t c&#7847;n bao nhi&ecirc;u d&#7919; li&#7879;u v&agrave; v&#7883; tr&iacute; c&#7911;a buffer l&#432;u tr&#7919; n&oacute;.</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Ghi</I> : ghi d&#7919; li&#7879;u l&ecirc;n t&#7853;p tin t&#7915; v&#7883; tr&iacute; hi&#7879;n th&#7901;i c&#7911;a <FONT FACE="Times New Roman">&#273;&#7847;u &#273;&#7885;c. N&#7871;u l</FONT>&agrave; cu&#7889;i t&#7853;p tin,k&iacute;ch th&#432;&#7899;c t&#7853;p tin s&#7869; t<FONT FACE="Times New Roman">&#259;ng l</FONT>&ecirc;n, n&#7871;u <FONT FACE="Times New Roman">&#273;ang &#7903; gi&#7919;a t&#7853;p tin, d&#7919; li&#7879;u s&#7869; b&#7883; ghi ch&#7891;ng l</FONT>&ecirc;n.</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Th&ecirc;m</I> : g&#7847;n gi&#7889;ng nh&#432; WRITE nh&#432;ng d&#7919; li&#7879;u lu&ocirc;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ghi v&agrave;o cu&#7889;i t&#7853;p tin.</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">T&igrave;m</I> :d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7875; truy xu&#7845;t t&#7853;p tin ng&#7851;u nhi</FONT>&ecirc;n. Khi xu&#7845;t hi&#7879;n l&#7901;i g&#7885;i h&#7879; th&#7889;ng, v&#7883; tr&iacute; con tr&#7887; <FONT FACE="Times New Roman">&#273;ang &#7903; v&#7883; trí hi&#7879;n h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c di chuy&#7875;n t&#7899;i v&#7883; tr&iacute; c&#7847;n thi&#7871;t. Sau <FONT FACE="Times New Roman">&#273;ó d&#7919; li&#7879;u s&#7869; &#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7885;c ghi t&#7841;i v&#7883; trí n</FONT>&agrave;y.</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">L&#7845;y thu&#7897;c t&iacute;nh</I> :l&#7845;y thu&#7897;c t&iacute;nh c&#7911;a t&#7853;p tin cho ti&#7871;n tr&igrave;nh</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Thi&#7871;t l&#7853;p thu&#7897;c t&iacute;nh</I> :thay <FONT FACE="Times New Roman">&#273;&#7893;i thu&#7897;c tính c&#7911;a t&#7853;p tin sau m&#7897;t th&#7901;i gian s&#7917; d&#7909;ng.
</FONT></P>
<I><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">&#272;&#7893;i t</FONT>&ecirc;n</I> :thay <FONT FACE="Times New Roman">&#273;&#7893;i t</FONT>&ecirc;n c&#7911;a t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&atilde; t&#7891;n t&#7841;i.</P>
</blockquote>
<B><P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp; <a name="cnthumuc"><img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#432; m&#7909;c :</a></P>

</B>

<I>
<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">T&#7841;o </I>: m&#7897;t th&#432; m&#7909;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o, n&oacute; r&#7895;ng, ngo&#7841;i tr&#7915; "." v&agrave; ".." <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7863;t t&#7921; &#273;&#7897;ng b&#7903;i h&#7879; th&#7889;ng.</FONT>&nbsp;</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">X&oacute;a</I> :xo&aacute; m&#7897;t th&#432; m&#7909;c, ch&#7881; c&oacute; th&#432; m&#7909;c r&#7895;ng m&#7899;i b&#7883; x&oacute;a, t&#432; m&#7909;c ch&#7913;a "." v&agrave; ".." coi nh&#432; l&agrave; th&#432; m&#7909;c r&#7895;ng.</P>

<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">M&#7903; th&#432; m&#7909;c</I> :th&#432; m&#7909;c c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7885;c. Ví d&#7909; &#273;&#7875; li&#7879;t k</FONT>&ecirc; t&#7845;t c&#7843; t&#7853;p tin trong m&#7897;t th&#432; m&#7909;c, ch&#432;&#417;ng tr&igrave;nh li&#7879;t k&ecirc; m&#7903; th&#432; m&#7909;c v&agrave; <FONT FACE="Times New Roman">&#273;&#7885;c ra t</FONT>&ecirc;n c&#7911;a t&#7845;t c&#7843; t&#7853;p tin ch&#7913;a trong <FONT FACE="Times New Roman">&#273;ó. Tr</FONT>&#432;&#7899;c khi th&#432; m&#7909;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7885;c, nó ph&#7843;i &#273;</FONT>&#432;&#7907;c m&#7903; ra tr&#432;&#7899;c.</P>

<I><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">&#272;óng th</FONT>&#432; m&#7909;c</I> :khi m&#7897;t th&#432; m&#7909;c <FONT FACE="Times New Roman">&#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7885;c xong, ph&#7843;i &#273;óng th</FONT>&#432; m&#7909;c <FONT FACE="Times New Roman">&#273;&#7875; gi&#7843;i phóng v</FONT>&ugrave;ng nh&#7899;.</P><P ALIGN="JUSTIFY"><I><img border="0" src="images/red.gif" width="7" height="10"></I><I><FONT FACE="Times New Roman">&#272;&#7885;c th</FONT>&#432; m&#7909;c </I>:L&#7879;nh n&agrave;y tr&#7843; v&#7873; entry ti&#7871;p theo trong th&#432; m&#7909;c <FONT FACE="Times New Roman">&#273;</FONT>&atilde; m&#7903;. Th&ocirc;ng th&#432;&#7901;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;&#7885;c th</FONT>&#432; m&#7909;c b&#7857;ng l&#7901;i g&#7885;i h&#7879; th&#7889;ng READ, l&#7879;nh <FONT FACE="Times New Roman">&#273;&#7885;c th</FONT>&#432; m&#7909;c lu&ocirc;n lu&ocirc;n tr&#7843; v&#7873; m&#7897;t entry d&#432;&#7899;i d&#7841;ng chu&#7849;n .</P>
<I><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">&#272;&#7893;i t</FONT>&ecirc;n</I> :c&#361;ng nh&#432; t&#7853;p tin, th&#432; m&#7909;c c&#361;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7893;i t</FONT>&ecirc;n.</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Li&ecirc;n k&#7871;t</I> :k&#7929; thu&#7853;t n&agrave;y cho ph&eacute;p m&#7897;t t&#7853;p tin c&oacute; th&#7875; xu&#7845;t hi&#7879;n trong nhi&#7873;u th&#432; m&#7909;c kh&aacute;c nhau. Khi c&oacute; y&ecirc;u c&#7847;u, m&#7897;t li&ecirc;n k&#7871;t s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o gi&#7919;a t&#7853;p tin v&agrave; m&#7897;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng d&#7851;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c cung c&#7845;p.</P>
<P ALIGN="JUSTIFY">&nbsp;<I><img border="0" src="images/red.gif" width="7" height="10">B&#7887; li&ecirc;n k&#7871;t</I> :N&#7871;u t&#7853;p tin ch&#7881; c&ograve;n li&ecirc;n k&#7871;t v&#7899;i m&#7897;t th&#432; m&#7909;c, n&oacute; s&#7869; b&#7883; lo&#7841;i b&#7887; ho&agrave;n to&agrave;n kh&#7887;i h&#7879; th&#7889;ng, n&#7871;u nhi&#7873;u th&igrave; n&oacute; b&#7883; gi&#7843;m ch&#7881; s&#7889; li&ecirc;n k&#7871;t.</P>
</blockquote>
<blockquote>

<P ALIGN="JUSTIFY">&nbsp;</P>
</blockquote>

<FONT COLOR="#007f7f"><STRONG><P ALIGN="JUSTIFY"><a name="cauhoi"><img border="0" src="images/blebul1a.gif" width="20" height="20">
</a></STRONG></FONT><b><a name="cauhoi"><font color="#FF0000" size="4">C&acirc;u h&#7887;i ki&#7875;m tra ki&#7871;n th&#7913;c</font></a></b></P><P>1. T&#7853;p tin l&agrave; g&igrave; ? Th&#432; m&#7909;c l&agrave; g&igrave;&nbsp;? T&#7841;i sao ph&#7843;i qu&#7843;n l&yacute; t&#7853;p tin v&agrave; th&#432; m&#7909;c&nbsp;?</P>
<P>2. T&#7853;p tin c&oacute; nh&#7919;ng <FONT FACE="Times New Roman">&#273;&#7863;c tính g</FONT>&igrave; ? Nh&#7919;ng <FONT FACE="Times New Roman">&#273;&#7863;c tính n</FONT>&agrave;o l&agrave; quan tr&#7885;ng&nbsp;? T&#7841;i sao&nbsp;?</P>
<P>3. N&ecirc;u c&aacute;c ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a t&#7853;p tin v</FONT>&agrave; th&#432; m&#7909;c.</P>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
</BODY>
</HTML>
