<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<TITLE>Baøi 3: Quaûn lyù tieán trình</TITLE>
<LINK REL="stylesheet" TYPE="text/css" HREF="style.css" TITLE="MTD">
</HEAD>
<BODY LINK="#0000ff" VLINK="#7f007f">

<B><P align="center"><font face="Verdana" color="#000080" size="2">B&agrave;i 3:
</font><font face="Verdana" size="5" color="#000080"> QU&#7842;N L&Yacute; TI&#7870;N TR&Igrave;NH</font></P>
</B><EM>
<blockquote>
<P>Trong b&agrave;i n&agrave;y ch&uacute;ng ta s&#7869; t&igrave;m hi&#7875;u ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng qu&#7843;n lý ti&#7871;n tr</FONT>&igrave;nh c&#7911;a H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh : l&agrave;m th&#7871; n&agrave;o <FONT FACE="Times New Roman">&#273;&#7875; phân chia CPU cho các ti&#7871;n tr</FONT>&igrave;nh ? Theo v&#7871;t x&#7917; l&yacute; c&#7911;a ti&#7871;n tr&igrave;nh ? V&agrave; c&aacute;c thao t&aacute;c tr&ecirc;n ti&#7871;n tr&igrave;nh ?</EM> </P>
</blockquote>
<B>
<P ALIGN="JUSTIFY" class="cap1"><a name="tochucquanly">I. T&#7893; ch&#7913;c qu&#7843;n l&yacute; ti&#7871;n tr&igrave;nh</a> </P>

<P ALIGN="JUSTIFY" class="cap2"><a name="trangthai"><img border="0" src="images/read_single.gif"> 
I.1. C&aacute;c tr&#7841;ng th&aacute;i c&#7911;a ti&#7871;n tr&igrave;nh</a></P><blockquote>

</B><P ALIGN="JUSTIFY">Tr&#7841;ng th&aacute;i c&#7911;a ti&#7871;n tr&igrave;nh t&#7841;i m&#7897;t th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m &#273;</FONT>&#432;&#7907;c x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh b&#7903;i ho&#7841;t &#273;&#7897;ng hi&#7879;n th&#7901;i c&#7911;a ti&#7871;n tr</FONT>&igrave;nh t&#7841;i th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m &#273;ó. Trong quá tr</FONT>&igrave;nh s&#7889;ng, m&#7897;t ti&#7871;n tr&igrave;nh thay <FONT FACE="Times New Roman">&#273;&#7893;i tr&#7841;ng thái do nhi&#7873;u nguy</FONT>&ecirc;n nh&acirc;n nh&#432;&nbsp;: ph&#7843;i ch&#7901; m&#7897;t s&#7921; ki&#7879;n n&agrave;o <FONT FACE="Times New Roman">&#273;ó x&#7843;y ra, hay &#273;&#7907;i m&#7897;t thao tác nh&#7853;p/xu&#7845;t ho</FONT>&agrave;n t&#7845;t, bu&#7897;c ph&#7843;i d&#7915;ng ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng do &#273;</FONT>&atilde; h&#7871;t th&#7901;i gian x&#7917; l&yacute; …</P>
<P ALIGN="JUSTIFY">T&#7841;i m&#7897;t th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m, m&#7897;t ti&#7871;n tr</FONT>&igrave;nh c&oacute; th&#7875; nh&#7853;n trong m&#7897;t c&aacute;c tr&#7841;ng th&aacute;i sau <FONT FACE="Times New Roman">&#273;ây&nbsp;:</P><blockquote>
</FONT><B><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif">M&#7899;i t&#7841;o</B>&nbsp;: ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang &#273;</FONT>&#432;&#7907;c t&#7841;o l&#7853;p. </P>
<B><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif">Running</B>&nbsp;: c&aacute;c ch&#7881; th&#7883; c&#7911;a ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang &#273;</FONT>&#432;&#7907;c x&#7917; l&yacute;. </P>
<B><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif">Blocked</B>&nbsp;: ti&#7871;n tr&igrave;nh ch&#7901; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t m&#7897;t t&agrave;i nguy&ecirc;n, hay ch&#7901; m&#7897;t<BR>
                         s&#7921; ki&#7879;n x&#7843;y ra .</P>
<B><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif">Ready   </B>: ti&#7871;n tr&igrave;nh ch&#7901; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t CPU <FONT FACE="Times New Roman">&#273;&#7875; x&#7917; lý.</P>
</FONT><B><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif">K&#7871;t th&uacute;c</B>&nbsp;: ti&#7871;n tr&igrave;nh ho&agrave;n t&#7845;t x&#7917; l&yacute;.</P><P ALIGN="center"><img border="0" src="images/hinh2.2.jpg" width="370" height="197"></P><P ALIGN="center"><b>Hình
2.2</b> S&#417; &#273;&#7891; chuy&#7875;n tr&#7841;ng thái gi&#7919;a các ti&#7871;n trình</P></blockquote>

<P ALIGN="JUSTIFY">T&#7841;i m&#7897;t th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m, ch&#7881; có m&#7897;t ti&#7871;n tr</FONT>&igrave;nh c&oacute; th&#7875; nh&#7853;n tr&#7841;ng th&aacute;i <I>running</I> tr&ecirc;n m&#7897;t b&#7897; x&#7917; l&yacute; b&#7845;t k&#7923;. Trong khi <FONT FACE="Times New Roman">&#273;ó, nhi&#7873;u ti&#7871;n tr</FONT>&igrave;nh c&oacute; th&#7875; &#7903; tr&#7841;ng th&aacute;i <I>blocked</I> hay <I>ready</I>.</P>
<P ALIGN="JUSTIFY">C&aacute;c cung chuy&#7875;n ti&#7871;p trong s&#417; <FONT FACE="Times New Roman">&#273;&#7891; tr&#7841;ng thái bi&#7877;u di&#7877;n sáu s&#7921; chuy&#7875;n tr&#7841;ng thái có th&#7875; x&#7843;y ra trong các &#273;i&#7873;u ki&#7879;n sau&nbsp;:</P>
<blockquote>

</FONT><P ALIGN="JUSTIFY"><B><img border="0" src="images/red.gif"></B>Ti&#7871;n tr&igrave;nh m&#7899;i t&#7841;o <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o h&#7879; th&#7889;ng</P>
<P ALIGN="JUSTIFY"><B><img border="0" src="images/red.gif"></B>B&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i c&#7845;p phát cho ti&#7871;n tr</FONT>&igrave;nh m&#7897;t kho&#7843;ng th&#7901;i gian s&#7917; d&#7909;ng CPU</P>
<P ALIGN="JUSTIFY"><B><img border="0" src="images/red.gif"></B>Ti&#7871;n tr&igrave;nh k&#7871;t th&uacute;c</P>
<P ALIGN="JUSTIFY"><B><img border="0" src="images/red.gif"></B>Ti&#7871;n tr&igrave;nh y&ecirc;u c&#7847;u m&#7897;t t&agrave;i nguy&ecirc;n nh&#432;ng ch&#432;a <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;áp &#7913;ng v</FONT>&igrave; t&agrave;i nguy&ecirc;n ch&#432;a s&#7861;n s&agrave;ng <FONT FACE="Times New Roman">&#273;&#7875; c&#7845;p phát t&#7841;i th&#7901;i &#273;i&#7875;m &#273;ó&nbsp;; ho&#7863;c ti&#7871;n tr</FONT>&igrave;nh ph&#7843;i ch&#7901; m&#7897;t s&#7921; ki&#7879;n hay thao t&aacute;c nh&#7853;p/xu&#7845;t.</P>
<P ALIGN="JUSTIFY"><B><img border="0" src="images/red.gif"></B>B&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i ch&#7885;n m&#7897;t ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c <FONT FACE="Times New Roman">&#273;&#7875; cho x&#7917; lý .</P>
</FONT><P ALIGN="JUSTIFY"><B><img border="0" src="images/red.gif"></B>T&agrave;i nguy&ecirc;n m&agrave; ti&#7871;n tr&igrave;nh y&ecirc;u c&#7847;u tr&#7903; n&ecirc;n s&#7861;n s&agrave;ng <FONT FACE="Times New Roman">&#273;&#7875; c&#7845;p phát&nbsp;; hay s&#7921; ki&#7879;n ho&#7863;c thao tác nh&#7853;p/xu&#7845;t ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;ang &#273;&#7907;i ho</FONT>&agrave;n t&#7845;t.</P>

<B></blockquote>
</blockquote>
<P ALIGN="JUSTIFY" class="cap2"><a name="xuly"><img border="0" src="images/read_single.gif" width="15" height="12"> 
 I.2. Ch&#7871; <FONT FACE="Times New Roman">&#273;&#7897; x&#7917; lý c&#7911;a ti&#7871;n tr</FONT>&igrave;nh</a></P>

</B><FONT FACE="Times New Roman">
<blockquote>
  <P ALIGN="JUSTIFY">&#272;&#7875; &#273;&#7843;m b&#7843;o h&#7879; th&#7889;ng ho&#7841;t &#273;&#7897;ng &#273;úng &#273;&#7855;n, h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh c&#7847;n ph&#7843;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7843;o v&#7879; kh&#7887;i s&#7921; x&acirc;m ph&#7841;m c&#7911;a c&aacute;c ti&#7871;n tr&igrave;nh. B&#7843;n th&acirc;n c&aacute;c ti&#7871;n tr&igrave;nh v&agrave; d&#7919; li&#7879;u c&#361;ng c&#7847;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7843;o v&#7879; <FONT FACE="Times New Roman">&#273;&#7875; tránh các &#7843;nh h</FONT>&#432;&#7903;ng sai l&#7841;c l&#7851;n nhau. M&#7897;t c&aacute;ch ti&#7871;p c&#7853;n <FONT FACE="Times New Roman">&#273;&#7875; gi&#7843;i quy&#7871;t v&#7845;n &#273;&#7873; l</FONT>&agrave; ph&acirc;n bi&#7879;t hai ch&#7871; <FONT FACE="Times New Roman">&#273;&#7897; x&#7917; lý cho các ti&#7871;n tr</FONT>&igrave;nh&nbsp;: <I>ch&#7871; <FONT FACE="Times New Roman">&#273;&#7897; không &#273;&#7863;c quy&#7873;n</I></FONT> v&agrave; <I>ch&#7871; <FONT FACE="Times New Roman">&#273;&#7897; &#273;&#7863;c quy&#7873;n</I></FONT> nh&#7901; v&agrave;o s&#7921; tr&#7907; gi&uacute;p c&#7911;a c&#417; ch&#7871; ph&#7847;n c&#7913;ng. T&#7853;p l&#7879;nh c&#7911;a CPU <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&acirc;n chia th&agrave;nh c&aacute;c l&#7879;nh <FONT FACE="Times New Roman">&#273;&#7863;c quy&#7873;n v</FONT>&agrave; l&#7879;nh kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7863;c quy&#7873;n. C</FONT>&#417; ch&#7871; ph&#7847;n c&#7913;ng ch&#7881; cho ph&eacute;p c&aacute;c l&#7879;nh <FONT FACE="Times New Roman">&#273;&#7863;c quy&#7873;n &#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n trong ch&#7871; <FONT FACE="Times New Roman">&#273;&#7897; &#273;&#7863;c quy&#7873;n. Thông th</FONT>&#432;&#7901;ng ch&#7881; c&oacute; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng trong ch&#7871; &#273;&#7897; &#273;&#7863;c quy&#7873;n, các ti&#7871;n tr</FONT>&igrave;nh c&#7911;a ng&#432;&#7901;i d&ugrave;ng ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng trong ch&#7871; &#273;&#7897; không &#273;&#7863;c quy&#7873;n, không th&#7921;c hi&#7879;n &#273;</FONT>&#432;&#7907;c c&aacute;c l&#7879;nh <FONT FACE="Times New Roman">&#273;&#7863;c quy&#7873;n có nguy c</FONT>&#417; &#7843;nh h&#432;&#7903;ng <FONT FACE="Times New Roman">&#273;&#7871;n h&#7879; th&#7889;ng. Nh</FONT>&#432; v&#7853;y h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7843;o v&#7879;. Khi m&#7897;t ti&#7871;n tr&igrave;nh ng&#432;&#7901;i d&ugrave;ng g&#7885;i <FONT FACE="Times New Roman">&#273;&#7871;n  m&#7897;t l&#7901;i g&#7885;i h&#7879; th&#7889;ng, ti&#7871;n tr</FONT>&igrave;nh c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh x&#7917; l&yacute; l&#7901;i g&#7885;i n&agrave;y s&#7869; ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng trong ch&#7871; &#273;&#7897; &#273;&#7863;c quy&#7873;n, sau khi ho</FONT>&agrave;n t&#7845;t th&igrave; tr&#7843; quy&#7873;n <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n v&#7873; cho ti&#7871;n tr</FONT>&igrave;nh ng&#432;&#7901;i d&ugrave;ng trong ch&#7871; <FONT FACE="Times New Roman">&#273;&#7897; không &#273;&#7863;c quy&#7873;n.</P>
</blockquote>
</FONT><B>
<p ALIGN="center"><img border="0" src="images/hinh2.3.jpg" width="370" height="136"></p>
<P ALIGN="center">H&igrave;nh v&#7869; 2.3
</B> Hai ch&#7871; &#273;&#7897; x&#7917; lý</P>

<B>

<P ALIGN="JUSTIFY" class="cap2"><a name="dulieu"><img border="0" src="images/read_single.gif" width="15" height="12"> 
I.3. C&#7845;u tr&uacute;c d&#7919; li&#7879;u kh&#7889;i qu&#7843;n l&yacute; ti&#7871;n tr&igrave;nh</a></P>
</B>
<blockquote>
<P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh qu&#7843;n l&yacute; c&aacute;c ti&#7871;n tr&igrave;nh trong h&#7879; th&#7889;ng th&ocirc;ng qua kh&#7889;i qu&#7843;n l&yacute; ti&#7871;n tr&igrave;nh (process control block -PCB). PCB l&agrave; m&#7897;t v&ugrave;ng nh&#7899; l&#432;u tr&#7919; c&aacute;c th&ocirc;ng tin m&ocirc; t&#7843; cho ti&#7871;n tr&igrave;nh, v&#7899;i c&aacute;c th&agrave;nh ph&#7847;n ch&#7911; y&#7871;u bao g&#7891;m&nbsp;:</P><blockquote>

<B><FONT FACE="Times New Roman"><P><img border="0" src="images/red.gif"> &#272;&#7883;nh danh c&#7911;a ti&#7871;n tr</FONT>&igrave;nh</B>&nbsp;<B>(1) </B>: gi&uacute;p ph&acirc;n bi&#7879;t c&aacute;c ti&#7871;n tr&igrave;nh</P>
<B><P><FONT FACE="Times New Roman"><img border="0" src="images/red.gif"> </FONT>Tr&#7841;ng th&aacute;i ti&#7871;n tr&igrave;nh (2)</B>: x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh ho&#7841;t &#273;&#7897;ng hi&#7879;n h</FONT>&agrave;nh c&#7911;a ti&#7871;n tr&igrave;nh.</P>
<B><P><FONT FACE="Times New Roman"><img border="0" src="images/red.gif"> </FONT>Ng&#7919; c&#7843;nh c&#7911;a ti&#7871;n tr&igrave;nh</B>&nbsp;<B>(3)</B>: m&ocirc; t&#7843; c&aacute;c t&agrave;i nguy&ecirc;n ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang trong quá tr</FONT>&igrave;nh, ho&#7863;c <FONT FACE="Times New Roman">&#273;&#7875; ph&#7909;c v&#7909; cho ho&#7841;t &#273;&#7897;ng hi&#7879;n t&#7841;i, ho&#7863;c &#273;&#7875; l</FONT>&agrave;m c&#417; s&#7903; ph&#7909;c h&#7891;i ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng cho ti&#7871;n tr</FONT>&igrave;nh, bao g&#7891;m c&aacute;c th&ocirc;ng tin v&#7873;:</P>
<blockquote>

<I><P><img border="0" src="images/rightarrow.gif"> Tr&#7841;ng th&aacute;i CPU</I>: bao g&#7891;m n&#7897;i dung c&aacute;c thanh ghi, quan tr&#7885;ng nh&#7845;t l&agrave; con tr&#7887; l&#7879;nh IP l&#432;u tr&#7919; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; câu l&#7879;nh k&#7871; ti&#7871;p ti&#7871;n tr</FONT>&igrave;nh s&#7869; x&#7917; l&yacute;. C&aacute;c th&ocirc;ng tin n&agrave;y c&#7847;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; khi x&#7843;y ra m&#7897;t ng&#7855;t, nh&#7857;m c&oacute; th&#7875; cho ph&eacute;p ph&#7909;c h&#7891;i ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng c&#7911;a ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;úng nh</FONT>&#432; tr&#432;&#7899;c khi b&#7883; ng&#7855;t.</P>
<I><P><img border="0" src="images/rightarrow.gif"> B&#7897; x&#7917; l&yacute;</I>: d&ugrave;ng cho m&aacute;y c&oacute; c&#7845;u h&igrave;nh nhi&#7873;u CPU, x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh s&#7889; hi&#7879;u CPU m</FONT>&agrave; ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang s&#7917; d&#7909;ng.</P>
</FONT><I><P><img border="0" src="images/rightarrow.gif"> B&#7897; nh&#7899; ch&iacute;nh</I>: danh s&aacute;ch c&aacute;c kh&#7889;i nh&#7899; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p cho ti&#7871;n tr&igrave;nh.</P>
<I><P><img border="0" src="images/rightarrow.gif"> T&agrave;i nguy&ecirc;n s&#7917; d&#7909;ng</I>: danh s&aacute;ch c&aacute;c t&agrave;i mguy&ecirc;n h&#7879; th&#7889;ng m&agrave; ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang s&#7917; d&#7909;ng.</P>
</FONT><I><P><img border="0" src="images/rightarrow.gif"> T&agrave;i nguy&ecirc;n t&#7841;o l&#7853;p</I>: danh s&aacute;ch c&aacute;c t&agrave;i nguy&ecirc;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ti&#7871;n tr&igrave;nh t&#7841;o l&#7853;p.</P>
<B></blockquote>
<P><FONT FACE="Times New Roman"><img border="0" src="images/red.gif"> </FONT>Th&ocirc;ng tin giao ti&#7871;p&nbsp;(4)</B>: ph&#7843;n &aacute;nh c&aacute;c th&ocirc;ng tin v&#7873; quan h&#7879; c&#7911;a ti&#7871;n tr&igrave;nh v&#7899;i c&aacute;c ti&#7871;n tr&igrave;nh kh&aacute;c trong h&#7879; th&#7889;ng&nbsp;:</P>
<blockquote>

<I><P><img border="0" src="images/rightarrow.gif"> Ti&#7871;n tr&igrave;nh cha</I>: ti&#7871;n tr&igrave;nh t&#7841;o l&#7853;p ti&#7871;n tr&igrave;nh n&agrave;y&nbsp;.</P>
<I><P><img border="0" src="images/rightarrow.gif"> Ti&#7871;n tr&igrave;nh con</I>:  c&aacute;c ti&#7871;n tr&igrave;nh do ti&#7871;n tr&igrave;nh n&agrave;y t&#7841;o l&#7853;p .</P>
<I><FONT FACE="Times New Roman"><P><img border="0" src="images/rightarrow.gif"> &#272;&#7897; </FONT>&#432;u ti&ecirc;n </I>: gi&uacute;p b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i có thông tin &#273;&#7875; l&#7921;a ch&#7885;n ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p CPU.</P>
<B></blockquote>
<P><FONT FACE="Times New Roman"><img border="0" src="images/red.gif"> </FONT>Th&ocirc;ng tin th&#7889;ng k&ecirc;&nbsp;(5)</B>: <FONT FACE="Times New Roman">&#273;ây l</FONT>&agrave; nh&#7919;ng th&ocirc;ng tin th&#7889;ng k&ecirc; v&#7873; ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng c&#7911;a ti&#7871;n tr</FONT>&igrave;nh, nh&#432; th&#7901;i gian <FONT FACE="Times New Roman">&#273;</FONT>&atilde; s&#7917; d&#7909;ng CPU,th&#7901;i gian ch&#7901;. C&aacute;c th&ocirc;ng tin n&agrave;y c&oacute; th&#7875; c&oacute; &iacute;ch cho c&ocirc;ng vi&#7879;c <FONT FACE="Times New Roman">&#273;ánh giá t</FONT>&igrave;nh h&igrave;nh h&#7879; th&#7889;ng v&agrave; d&#7921; <FONT FACE="Times New Roman">&#273;oán các t</FONT>&igrave;nh hu&#7889;ng t&#432;&#417;ng lai.</P>
<blockquote>

<P align="center"><img border="0" src="images/hinh2.4.jpg" width="416" height="368"></P>

<P align="center"><B>H&igrave;nh v&#7869; 2.4

</B> Kh&#7889;i mô t&#7843; ti&#7871;n trình</P></blockquote>
</blockquote>
</blockquote>

<B>

<P ALIGN="JUSTIFY" class="cap2"><a name="thaotac"><img border="0" src="images/read_single.gif"> 
I.4. Thao t&aacute;c tr&ecirc;n ti&#7871;n tr&igrave;nh</a></P><blockquote>

</B><P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh cung c&#7845;p c&aacute;c thao t&aacute;c ch&#7911; y&#7871;u sau <FONT FACE="Times New Roman">&#273;ây tr</FONT>&ecirc;n m&#7897;t ti&#7871;n tr&igrave;nh&nbsp;:</P><blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif"> t&#7841;o l&#7853;p ti&#7871;n tr&igrave;nh (create)</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif"> k&#7871;t th&uacute;c ti&#7871;n tr&igrave;nh (destroy)</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif"> t&#7841;m d&#7915;ng ti&#7871;n tr&igrave;nh (suspend)</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif"> t&aacute;i k&iacute;ch ho&#7841;t ti&#7871;n tr&igrave;nh (resume)</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif"> thay <FONT FACE="Times New Roman">&#273;&#7893;i &#273;&#7897; </FONT>&#432;u ti&ecirc;n ti&#7871;n tr&igrave;nh</P>

<B><I>
</blockquote>

</blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif"> I.4.1. T&#7841;o l&#7853;p ti&#7871;n tr&igrave;nh</P></I>

</B><blockquote>
<P ALIGN="JUSTIFY">Trong qu&aacute; tr&igrave;nh x&#7917; l&yacute;, m&#7897;t ti&#7871;n tr&igrave;nh c&oacute; th&#7875; t&#7841;o l&#7853;p nhi&#7873;u ti&#7871;n tr&igrave;nh m&#7899;i b&#7857;ng c&aacute;ch s&#7917; d&#7909;ng m&#7897;t l&#7901;i g&#7885;i h&#7879; th&#7889;ng t&#432;&#417;ng &#7913;ng. Ti&#7871;n tr&igrave;nh g&#7885;i l&#7901;i g&#7885;i h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#7875; t&#7841;o ti&#7871;n tr</FONT>&igrave;nh m&#7899;i s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; ti&#7871;n tr&igrave;nh <I>cha</I>, ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o g&#7885;i l&agrave; ti&#7871;n tr&igrave;nh <I>con</I>. M&#7895;i ti&#7871;n tr&igrave;nh con <FONT FACE="Times New Roman">&#273;&#7871;n l</FONT>&#432;&#7907;t n&oacute; l&#7841;i c&oacute; th&#7875; t&#7841;o c&aacute;c ti&#7871;n tr&igrave;nh m&#7899;i…qu&aacute; tr&igrave;nh n&agrave;y ti&#7871;p t&#7909;c s&#7869; t&#7841;o ra m&#7897;t <I>c&acirc;y ti&#7871;n tr&igrave;nh</I>.</P>
<P ALIGN="center"><img border="0" src="images/hinh2.5.jpg" width="370" height="200"></P>
<P ALIGN="CENTER"><b>H&igrave;nh v&#7869;2.5</b> M&#7897;t cây ti&#7871;n trình trong
h&#7879; th&#7889;ng UNIX</P>
<P ALIGN="JUSTIFY">C&aacute;c c&ocirc;ng vi&#7879;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#7847;n th&#7921;c hi&#7879;n khi t&#7841;o l&#7853;p ti&#7871;n tr&igrave;nh bao g&#7891;m&nbsp;:</P><blockquote>

<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">
<I><img border="0" src="images/rightarrow.gif"> </I>&#273;&#7883;nh danh cho ti&#7871;n tr</FONT>&igrave;nh m&#7899;i ph&aacute;t sinh</P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">
<I><img border="0" src="images/rightarrow.gif"> </I>&#273;</FONT>&#432;a ti&#7871;n tr&igrave;nh v&agrave;o danh s&aacute;ch qu&#7843;n l&yacute; c&#7911;a h&#7879; th&#7889;ng</P>
<P ALIGN="JUSTIFY">
<I><img border="0" src="images/rightarrow.gif"> </I>x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh &#273;&#7897; </FONT>&#432;u ti&ecirc;n cho ti&#7871;n tr&igrave;nh</P>
<P ALIGN="JUSTIFY">
<I><img border="0" src="images/rightarrow.gif"> </I>t&#7841;o PCB cho ti&#7871;n tr&igrave;nh</P>
<P ALIGN="JUSTIFY">
<I><img border="0" src="images/rightarrow.gif"> </I>c&#7845;p ph&aacute;t c&aacute;c t&agrave;i nguy&ecirc;n ban <FONT FACE="Times New Roman">&#273;&#7847;u cho ti&#7871;n tr</FONT>&igrave;nh</P></blockquote>

<P ALIGN="JUSTIFY">Khi m&#7897;t ti&#7871;n tr&igrave;nh t&#7841;o l&#7853;p m&#7897;t ti&#7871;n tr&igrave;nh con, ti&#7871;n tr&igrave;nh con c&oacute; th&#7875; s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh tr&#7921;c ti&#7871;p c&#7845;p ph&aacute;t t&agrave;i nguy&ecirc;n ho&#7863;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ti&#7871;n tr&igrave;nh cha cho th&#7915;a h&#432;&#7903;ng m&#7897;t s&#7889; t&agrave;i nguy&ecirc;n ban <FONT FACE="Times New Roman">&#273;&#7847;u.</P>
</FONT><P ALIGN="JUSTIFY">Khi m&#7897;t ti&#7871;n tr&igrave;nh t&#7841;o ti&#7871;n tr&igrave;nh m&#7899;i, ti&#7871;n tr&igrave;nh ban <FONT FACE="Times New Roman">&#273;&#7847;u có th&#7875; x&#7917; lý theo m&#7897;t trong hai kh&#7843; n&#259;ng sau&nbsp;&nbsp;:</P><blockquote>

</FONT><P>
<I><img border="0" src="images/rightarrow.gif"> </I>Ti&#7871;n tr&igrave;nh cha ti&#7871;p t&#7909;c x&#7917; l&yacute; <FONT FACE="Times New Roman">&#273;&#7891;ng h</FONT>&agrave;nh v&#7899;i ti&#7871;n tr&igrave;nh con.</P>
<P>
<I><img border="0" src="images/rightarrow.gif"> </I>Ti&#7871;n tr&igrave;nh cha ch&#7901; <FONT FACE="Times New Roman">&#273;&#7871;n khi m&#7897;t ti&#7871;n tr</FONT>&igrave;nh con n&agrave;o <FONT FACE="Times New Roman">&#273;ó, ho&#7863;c t&#7845;t c&#7843; các ti&#7871;n tr</FONT>&igrave;nh con k&#7871;t th&uacute;c x&#7917; l&yacute;.</P>
</blockquote>

<P ALIGN="JUSTIFY">C&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh kh&aacute;c nhau c&oacute; th&#7875; ch&#7885;n l&#7921;a c&aacute;c c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t khác nhau &#273;&#7875; th&#7921;c hi&#7879;n thao tác t&#7841;o l&#7853;p m&#7897;t ti&#7871;n tr</FONT>&igrave;nh.</P>

<B><I>
</blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif"> I.4.2. K&#7871;t th&uacute;c ti&#7871;n tr&igrave;nh</P></I>

</B><blockquote>
<P ALIGN="JUSTIFY">M&#7897;t ti&#7871;n tr&igrave;nh k&#7871;t th&uacute;c x&#7917; l&yacute; khi n&oacute; ho&agrave;n t&#7845;t ch&#7881; th&#7883; cu&#7889;i c&ugrave;ng v&agrave; s&#7917; d&#7909;ng m&#7897;t l&#7901;i g&#7885;i h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#7875; y</FONT>&ecirc;u c&#7847;u h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh h&#7911;y b&#7887; n&oacute;. <FONT FACE="Times New Roman">&#272;ôi khi m&#7897;t ti&#7871;n tr</FONT>&igrave;nh c&oacute; th&#7875; y&ecirc;u c&#7847;u h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh k&#7871;t th&uacute;c x&#7917; l&yacute; c&#7911;a m&#7897;t ti&#7871;n tr&igrave;nh kh&aacute;c. Khi m&#7897;t ti&#7871;n tr&igrave;nh k&#7871;t th&uacute;c, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh th&#7921;c hi&#7879;n c&aacute;c c&ocirc;ng vi&#7879;c&nbsp;:</P><blockquote>

<P ALIGN="JUSTIFY">
<I><img border="0" src="images/rightarrow.gif"> </I>thu h&#7891;i c&aacute;c t&agrave;i nguy&ecirc;n h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;</FONT>&atilde; c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh</P>
<P ALIGN="JUSTIFY">
<I><img border="0" src="images/rightarrow.gif"> </I>h&#7911;y ti&#7871;n tr&igrave;nh kh&#7887;i t&#7845;t c&#7843; c&aacute;c danh s&aacute;ch qu&#7843;n l&yacute; c&#7911;a h&#7879; th&#7889;ng</P>
<P ALIGN="JUSTIFY">
<I><img border="0" src="images/rightarrow.gif"> </I>h&#7911;y b&#7887; PCB c&#7911;a ti&#7871;n tr&igrave;nh</P></blockquote>

<P ALIGN="JUSTIFY">H&#7847;u h&#7871;t c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh kh&ocirc;ng cho ph&eacute;p c&aacute;c ti&#7871;n tr&igrave;nh con ti&#7871;p t&#7909;c t&#7891;n t&#7841;i n&#7871;u ti&#7871;n tr&igrave;nh cha <FONT FACE="Times New Roman">&#273;</FONT>&atilde; k&#7871;t th&uacute;c. Trong nh&#7919;ng h&#7879; th&#7889;ng nh&#432; th&#7871;, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh s&#7869; t&#7921; <FONT FACE="Times New Roman">&#273;&#7897;ng phát sinh m&#7897;t lo&#7841;t các thao tác k&#7871;t thúc ti&#7871;n tr</FONT>&igrave;nh con. </P>

<B>
</blockquote>

</blockquote>
<P ALIGN="JUSTIFY" class="cap2"><a name="capphat"><img border="0" src="images/read_single.gif"> 
I.5.
C&#7845;p ph&aacute;t t&agrave;i nguy&ecirc;n cho ti&#7871;n tr&igrave;nh</a></P>
</B>
<blockquote>
<P ALIGN="JUSTIFY">Khi c&oacute; nhi&#7873;u ng&#432;&#7901;i s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7891;ng th&#7901;i l</FONT>&agrave;m vi&#7879;c trong h&#7879; th&#7889;ng, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#7847;n ph&#7843;i c&#7845;p ph&aacute;t c&aacute;c t&agrave;i nguy&ecirc;n theo y&ecirc;u c&#7847;u cho m&#7895;i ng&#432;&#7901;i s&#7917; d&#7909;ng. Do t&agrave;i nguy&ecirc;n h&#7879; th&#7889;ng th&#432;&#7901;ng r&#7845;t gi&#7899;i h&#7841;n v&agrave; c&oacute; khi kh&ocirc;ng th&#7875; chia s&#7867;, n&ecirc;n hi&#7871;m khi t&#7845;t c&#7843; c&aacute;c y&ecirc;u c&#7847;u t&agrave;i nguy&ecirc;n <FONT FACE="Times New Roman">&#273;&#7891;ng th&#7901;i &#273;&#7873;u &#273;</FONT>&#432;&#7907;c th&#7887;a m&atilde;n. V&igrave; th&#7871; c&#7847;n ph&#7843;i nghi&ecirc;n c&#7913;u m&#7897;t ph&#432;&#417;ng ph&aacute;p <FONT FACE="Times New Roman">&#273;&#7875; chia s&#7867; m&#7897;t s&#7889; t</FONT>&agrave;i nguy&ecirc;n h&#7919;u h&#7841;n gi&#7919;a nhi&#7873;u ti&#7871;n tr&igrave;nh ng&#432;&#7901;i d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7891;ng th&#7901;i. H&#7879; &#273;i&#7873;u h</FONT>&agrave;nh qu&#7843;n l&yacute; nhi&#7873;u lo&#7841;i t&agrave;i nguy&ecirc;n kh&aacute;c nhau (CPU, b&#7897; nh&#7899; ch&iacute;nh, c&aacute;c thi&#7871;t b&#7883; ngo&#7841;i vi …), v&#7899;i m&#7895;i lo&#7841;i c&#7847;n c&oacute; m&#7897;t c&#417; ch&#7871; c&#7845;p ph&aacute;t v&agrave; c&aacute;c chi&#7871;n l&#432;&#7907;c c&#7845;p ph&aacute;t hi&#7879;u q&#7911;a. M&#7895;i t&agrave;i nguy&ecirc;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c bi&#7877;u di&#7877;n th&ocirc;ng qua m&#7897;t c&#7845;u tr&uacute;c d&#7919; li&#7879;u, kh&aacute;c nhau v&#7873; chi ti&#7871;t cho t&#7915;ng lo&#7841;i t&agrave;i nguy&ecirc;n, nh&#432;ng c&#417; b&#7843;n ch&#7913;a <FONT FACE="Times New Roman">&#273;&#7921;ng các thông tin sau&nbsp;:</P><blockquote>
<blockquote>

<B><P><img border="0" src="images/red.gif">&#272;&#7883;nh danh t</FONT>&agrave;i nguy&ecirc;n</P>
<P> <FONT FACE="Times New Roman"><img border="0" src="images/red.gif"></FONT>Tr&#7841;ng th&aacute;i t&agrave;i nguy&ecirc;n </B>: <FONT FACE="Times New Roman">&#273;ây l</FONT>&agrave; c&aacute;c th&ocirc;ng tin m&ocirc; t&#7843; chi ti&#7871;t tr&#7841;ng th&aacute;i t&agrave;i nguy&ecirc;n&nbsp;: ph&#7847;n n&agrave;o c&#7911;a t&agrave;i nguy&ecirc;n <FONT FACE="Times New Roman">&#273;</FONT>&atilde; c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh, ph&#7847;n n&agrave;o c&ograve;n c&oacute; th&#7875; s&#7917; d&#7909;ng&nbsp;?</P>
<B><P> <FONT FACE="Times New Roman"><img border="0" src="images/red.gif"></FONT>H&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i tr</FONT>&ecirc;n m&#7897;t t&agrave;i nguy&ecirc;n</B>&nbsp;: danh s&aacute;ch c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang ch&#7901; &#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t t&agrave;i nguy&ecirc;n t&#432;&#417;ng &#7913;ng.</P>
<B><P> <FONT FACE="Times New Roman"><img border="0" src="images/red.gif"></FONT>B&#7897; c&#7845;p ph&aacute;t &nbsp;</B>: l&agrave; <FONT FACE="Times New Roman">&#273;o&#7841;n code &#273;&#7843;m nhi&#7879;m vi&#7879;c c&#7845;p phát m&#7897;t t</FONT>&agrave;i nguy&ecirc;n <FONT FACE="Times New Roman">&#273;&#7863;c th</FONT>&ugrave;. M&#7897;t s&#7889; t&agrave;i nguy&ecirc;n <FONT FACE="Times New Roman">&#273;</FONT>&ograve;i h&#7887;i c&aacute;c gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t (nh</FONT>&#432; CPU, b&#7897; nh&#7899; ch&iacute;nh, h&#7879; th&#7889;ng t&#7853;p tin), trong khi nh&#7919;ng t&agrave;i nguy&ecirc;n kh&aacute;c (nh&#432; c&aacute;c thi&#7871;t b&#7883; nh&#7853;p/xu&#7845;t) c&oacute; th&#7875; c&#7847;n c&aacute;c gi&#7843;i thu&#7853;t c&#7845;p ph&aacute;t v&agrave; gi&#7843;i ph&oacute;ng t&#7893;ng qu&aacute;t h&#417;n.</P>
</blockquote>
</blockquote>

<B><P ALIGN="CENTER"><img border="0" src="images/hinh2.6.jpg" width="346" height="200"></P>
<P ALIGN="CENTER">H&igrave;nh 2.6 </B> Kh&#7889;i qu&#7843;n l&yacute; t&agrave;i nguy&ecirc;n</P>
<P ALIGN="JUSTIFY">C&aacute;c m&#7909;c ti&ecirc;u c&#7911;a k&#7929; thu&#7853;t c&#7845;p ph&aacute;t&nbsp;:</P><blockquote>
<blockquote>

<P> <FONT FACE="Times New Roman">

<B><img border="0" src="images/red.gif"></B></FONT>B&#7843;o <FONT FACE="Times New Roman">&#273;&#7843;m m&#7897;t s&#7889; l</FONT>&#432;&#7907;ng h&#7907;p l&#7879; c&aacute;c ti&#7871;n tr&igrave;nh truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7891;ng th&#7901;i &#273;&#7871;n các t</FONT>&agrave;i nguy&ecirc;n  kh&ocirc;ng chia s&#7867; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c.</P>
<P> <FONT FACE="Times New Roman">

<B><img border="0" src="images/red.gif"></B></FONT>C&#7845;p ph&aacute;t t&agrave;i nguy&ecirc;n cho ti&#7871;n tr&igrave;nh c&oacute; y&ecirc;u c&#7847;u trong m&#7897;t kho&#7843;ng th&#7901;i gian tr&igrave; ho&atilde;n c&oacute; th&#7875; ch&#7845;p nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c.</P>
<P> <FONT FACE="Times New Roman">

<B><img border="0" src="images/red.gif"></B></FONT>T&#7889;i &#432;u h&oacute;a s&#7921; s&#7917; d&#7909;ng t&agrave;i nguy&ecirc;n.</P></blockquote>
</blockquote>

<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#7875; có th&#7875; th&otilde;a m&atilde;n c&aacute;c m&#7909;c ti&ecirc;u k&#7875; tr&ecirc;n, c&#7847;n ph&#7843;i gi&#7843;i quy&#7871;t c&aacute;c v&#7845;n &#273;&#7873; n&#7843;y sinh khi có nhi&#7873;u ti&#7871;n tr&igrave;nh &#273;&#7891;ng th&#7901;i y&ecirc;u c&#7847;u m&#7897;t t&agrave;i nguy&ecirc;n kh&ocirc;ng th&#7875; chia s&#7867;.</P></blockquote>
<B><P>&nbsp;</P>
<P class="cap1"><a name="dieuphoi">II. &#272;i&#7873;u ph&#7889;i ti&#7871;n tr&igrave;nh</a></P>
<blockquote>
</B><P ALIGN="JUSTIFY">Trong m&ocirc;i tr&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;a ch</FONT>&#432;&#417;ng, c&oacute; th&#7875; x&#7843;y ra t&igrave;nh hu&#7889;ng nhi&#7873;u ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7891;ng th&#7901;i s&#7861;n s</FONT>&agrave;ng <FONT FACE="Times New Roman">&#273;&#7875; x&#7917; lý. M&#7909;c ti</FONT>&ecirc;u c&#7911;a c&aacute;c h&#7879; ph&acirc;n chia th&#7901;i gian (time-sharing) l&agrave; chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i CPU qua l&#7841;i gi&#7919;a các ti&#7871;n tr</FONT>&igrave;nh m&#7897;t c&aacute;ch th&#432;&#7901;ng xuy&ecirc;n <FONT FACE="Times New Roman">&#273;&#7875; nhi&#7873;u ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng c&oacute; th&#7875; t&#432;&#417;ng t&aacute;c c&ugrave;ng l&uacute;c v&#7899;i t&#7915;ng ch&#432;&#417;ng tr&igrave;nh trong qu&aacute; tr&igrave;nh x&#7917; l&yacute;.</P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#7875; th&#7921;c hi&#7879;n &#273;</FONT>&#432;&#7907;c m&#7909;c ti&ecirc;u n&agrave;y, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ph&#7843;i l&#7921;a ch&#7885;n  ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c x&#7917; l&yacute; ti&#7871;p theo. B&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i s&#7869; s&#7917; d&#7909;ng m&#7897;t gi&#7843;i thu&#7853;t &#273;i&#7873;u ph&#7889;i thích h&#7907;p &#273;&#7875; th&#7921;c hi&#7879;n nhi&#7879;m v&#7909; n</FONT>&agrave;y. M&#7897;t th&agrave;nh ph&#7847;n kh&aacute;c c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#361;ng ti&#7873;m &#7849;n trong c&ocirc;ng t&aacute;c <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i l</FONT>&agrave; <I>b&#7897; ph&acirc;n ph&#7889;i</I> (dispatcher). B&#7897; ph&acirc;n ph&#7889;i s&#7869; ch&#7883;u tr&aacute;ch nhi&#7879;m chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i ng&#7919; c&#7843;nh v</FONT>&agrave; trao CPU cho ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ch&#7885;n b&#7903;i b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i &#273;&#7875; x&#7917; lý. </P>

</FONT><B>
</blockquote>

<P ALIGN="JUSTIFY" class="cap2"><a name="goithieu"><img border="0" src="images/read_single.gif"> 
II.1. Gi&#7899;i thi&#7879;u</a></P>
<blockquote>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif"> II.1.1. M&#7909;c ti&ecirc;u <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i</P></blockquote>
</FONT></I>
</B>
<blockquote>
<blockquote>
<P ALIGN="JUSTIFY">B&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i không cung c&#7845;p c</FONT>&#417; ch&#7871;, m&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;a ra c&aacute;c quy&#7871;t <FONT FACE="Times New Roman">&#273;&#7883;nh. Các h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh x&acirc;y d&#7921;ng nhi&#7873;u chi&#7871;n l&#432;&#7907;c kh&aacute;c nhau <FONT FACE="Times New Roman">&#273;&#7875; th&#7921;c hi&#7879;n vi&#7879;c &#273;i&#7873;u ph&#7889;i, nh</FONT>&#432;ng t&#7921;u chung c&#7847;n <FONT FACE="Times New Roman">&#273;&#7841;t &#273;</FONT>&#432;&#7907;c c&aacute;c m&#7909;c ti&ecirc;u sau :</P><blockquote>

<B><P ALIGN="JUSTIFY">a) S&#7921; c&ocirc;ng b&#7857;ng ( Fairness) :</P>
<blockquote>

</B><P>C&aacute;c ti&#7871;n tr&igrave;nh chia s&#7867; CPU m&#7897;t c&aacute;ch c&ocirc;ng b&#7857;ng, kh&ocirc;ng c&oacute; ti&#7871;n tr&igrave;nh n&agrave;o ph&#7843;i ch&#7901; <FONT FACE="Times New Roman">&#273;&#7907;i vô h&#7841;n &#273;&#7875; &#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t CPU</P>
<B></blockquote>
<P ALIGN="JUSTIFY">b) T&iacute;nh hi&#7879;u q&#7911;a (Efficiency) :</P>
</B>
<blockquote>

<P>H&#7879; th&#7889;ng ph&#7843;i t&#7853;n d&#7909;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c CPU 100% th&#7901;i gian.</P>
<B></blockquote>
<P ALIGN="JUSTIFY">c) Th&#7901;i gian <FONT FACE="Times New Roman">&#273;áp &#7913;ng h&#7907;p lý (Response time) :</P>
</FONT>
</B>
<blockquote>

<P>C&#7921;c ti&#7875;u ho&aacute; th&#7901;i gian h&#7891;i <FONT FACE="Times New Roman">&#273;áp cho các t</FONT>&#432;&#417;ng t&aacute;c c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng</P>
<B></blockquote>
<P ALIGN="JUSTIFY">d) Th&#7901;i gian l&#432;u l&#7841;i trong h&#7879; th&#7889;ng ( Turnaround Time) :</P>
</B>
<blockquote>

<P>C&#7921;c ti&#7875;u h&oacute;a th&#7901;i gian ho&agrave;n t&#7845;t c&aacute;c t&aacute;c v&#7909; x&#7917; l&yacute; theo l&ocirc;.</P>
<B></blockquote>
<P ALIGN="JUSTIFY">e) Th&ocirc;ng l&#432;&#7907;ng t&#7889;i <FONT FACE="Times New Roman">&#273;a (Throughput ) :</P>
</FONT>
</B>
<blockquote>

<P>C&#7921;c <FONT FACE="Times New Roman">&#273;&#7841;i hóa s&#7889; công vi&#7879;c &#273;</FONT>&#432;&#7907;c x&#7917; l&yacute; trong m&#7897;t <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; th&#7901;i gian.</P></blockquote>
</blockquote>

<P ALIGN="JUSTIFY">Tuy nhi&ecirc;n th&#432;&#7901;ng kh&ocirc;ng th&#7875; th&#7887;a m&atilde;n t&#7845;t c&#7843; c&aacute;c m&#7909;c ti&ecirc;u k&#7875; tr&ecirc;n v&igrave; b&#7843;n th&acirc;n ch&uacute;ng c&oacute; s&#7921; m&acirc;u thu&#7851;n v&#7899;i nhau m&agrave; ch&#7881; c&oacute; th&#7875; dung h&ograve;a ch&uacute;ng &#7903; m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; n</FONT>&agrave;o <FONT FACE="Times New Roman">&#273;ó.</P>

</FONT><B><I>
</blockquote>
<P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif"> II.1.2. C&aacute;c <FONT FACE="Times New Roman">&#273;&#7863;c &#273;i&#7875;m c&#7911;a ti&#7871;n tr</FONT>&igrave;nh</P>

</B></I><FONT FACE="Times New Roman">
<blockquote>
  <P ALIGN="JUSTIFY">&#272;i&#7873;u ph&#7889;i ho&#7841;t &#273;&#7897;ng c&#7911;a các ti&#7871;n tr</FONT>&igrave;nh l&agrave; m&#7897;t v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; r&#7845;t ph&#7913;c t&#7841;p, &#273;</FONT>&ograve;i h&#7887;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh khi gi&#7843;i quy&#7871;t ph&#7843;i xem x&eacute;t nhi&#7873;u y&#7871;u t&#7889; kh&aacute;c nhau <FONT FACE="Times New Roman">&#273;&#7875; có th&#7875; &#273;&#7841;t &#273;</FONT>&#432;&#7907;c nh&#7919;ng m&#7909;c ti&ecirc;u <FONT FACE="Times New Roman">&#273;&#7873; ra. M&#7897;t s&#7889; &#273;&#7863;c tính c&#7911;a ti&#7871;n tr</FONT>&igrave;nh c&#7847;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c quan t&acirc;m nh&#432; ti&ecirc;u chu&#7849;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i :</P>
<blockquote>

</FONT><B><P ALIGN="JUSTIFY">a) T&iacute;nh h&#432;&#7899;ng xu&#7845;t / nh&#7853;p  c&#7911;a ti&#7871;n tr&igrave;nh ( I/O-boundedness):</P>

</B>
  <blockquote>
    <P>Khi m&#7897;t ti&#7871;n tr&igrave;nh nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c CPU, ch&#7911; y&#7871;u n&oacute; ch&#7881; s&#7917; d&#7909;ng CPU <FONT FACE="Times New Roman">&#273;&#7871;n khi phát sinh m&#7897;t y</FONT>&ecirc;u c&#7847;u nh&#7853;p xu&#7845;t ? Ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng c&#7911;a các ti&#7871;n tr</FONT>&igrave;nh nh&#432; th&#7871; th&#432;&#7901;ng bao g&#7891;m nhi&#7873;u l&#432;&#7907;t s&#7917; d&#7909;ng CPU , m&#7895;i l&#432;&#7907;t trong m&#7897;t th&#7901;i gian kh&aacute; ng&#7855;n.</P>
  </blockquote>

<B><P ALIGN="JUSTIFY">b) T&iacute;nh h&#432;&#7899;ng x&#7917; l&yacute; c&#7911;a ti&#7871;n tr&igrave;nh ( CPU-boundedness):</P>

</B>
  <blockquote>
    <P>Khi m&#7897;t ti&#7871;n tr&igrave;nh nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c CPU, n&oacute; c&oacute; khuynh h&#432;&#7899;ng s&#7917; d&#7909;ng CPU <FONT FACE="Times New Roman">&#273;&#7871;n khi h&#7871;t th&#7901;i gian d</FONT>&agrave;nh cho n&oacute; ? Ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng c&#7911;a các ti&#7871;n tr</FONT>&igrave;nh nh&#432; th&#7871; th&#432;&#7901;ng bao g&#7891;m m&#7897;t s&#7889; &iacute;t l&#432;&#7907;t s&#7917; d&#7909;ng CPU , nh&#432;ng m&#7895;i l&#432;&#7907;t trong m&#7897;t th&#7901;i gian <FONT FACE="Times New Roman">&#273;&#7911; d</FONT>&agrave;i.</P>

<B>
    </blockquote>
    <P ALIGN="JUSTIFY">c) Ti&#7871;n tr&igrave;nh t&#432;&#417;ng t&aacute;c hay x&#7917; l&yacute; theo l&ocirc; :</P>

</B>
  <blockquote>
    <P>Ng&#432;&#7901;i s&#7917; d&#7909;ng theo ki&#7875;u t&#432;&#417;ng t&aacute;c th&#432;&#7901;ng y&ecirc;u c&#7847;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c h&#7891;i <FONT FACE="Times New Roman">&#273;áp t&#7913;c th&#7901;i &#273;&#7889;i v&#7899;i các y</FONT>&ecirc;u c&#7847;u c&#7911;a h&#7885;, trong khi c&aacute;c ti&#7871;n tr&igrave;nh c&#7911;a t&aacute;c v&#7909; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c x&#7917; l&yacute; theo l&ocirc; n&oacute;i chung c&oacute; th&#7875; tr&igrave; ho&atilde;n trong m&#7897;t th&#7901;i gian ch&#7845;p nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c.</P>

<B>
    </blockquote>
    <P ALIGN="JUSTIFY">d) <FONT FACE="Times New Roman">&#272;&#7897; </FONT>&#432;u ti&ecirc;n c&#7911;a ti&#7871;n tr&igrave;nh :</P>

</B>
  <blockquote>
    <P>C&aacute;c ti&#7871;n tr&igrave;nh c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&acirc;n c&#7845;p theo m&#7897;t s&#7889; ti&ecirc;u chu&#7849;n <FONT FACE="Times New Roman">&#273;ánh giá n</FONT>&agrave;o <FONT FACE="Times New Roman">&#273;ó, m&#7897;t cách h&#7907;p lý, các ti&#7871;n tr</FONT>&igrave;nh quan tr&#7885;ng h&#417;n ( c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n cao h&#417;n) c&#7847;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c &#432;u ti&ecirc;n h&#417;n.</P>

<B>
    </blockquote>
    <P ALIGN="JUSTIFY">e) Th&#7901;i gian <FONT FACE="Times New Roman">&#273;</FONT>&atilde; s&#7917; d&#7909;ng CPU c&#7911;a ti&#7871;n tr&igrave;nh :</P>

</B>
  <blockquote>
    <P>M&#7897;t s&#7889; quan <FONT FACE="Times New Roman">&#273;i&#7875;m </FONT>&#432;u ti&ecirc;n ch&#7885;n nh&#7919;ng ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&atilde; s&#7917; d&#7909;ng CPU nhi&#7873;u th&#7901;i gian nh&#7845;t v&igrave; hy v&#7885;ng ch&uacute;ng s&#7869; c&#7847;n &iacute;t th&#7901;i gian nh&#7845;t <FONT FACE="Times New Roman">&#273;&#7875; ho</FONT>&agrave;n t&#7845;t v&agrave; r&#7901;i kh&#7887;i h&#7879; th&#7889;ng . Tuy nhi&ecirc;n c&#361;ng c&oacute; quan <FONT FACE="Times New Roman">&#273;i&#7875;m cho r&#7857;ng các ti&#7871;n tr</FONT>&igrave;nh nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c CPU trong &iacute;t th&#7901;i gian l&agrave; nh&#7919;ng ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&atilde; ph&#7843;i ch&#7901; l&acirc;u nh&#7845;t, do v&#7853;y &#432;u ti&ecirc;n ch&#7885;n ch&uacute;ng.</P>
  </blockquote>

<B><P ALIGN="JUSTIFY">f) Th&#7901;i gian c&ograve;n l&#7841;i ti&#7871;n tr&igrave;nh c&#7847;n <FONT FACE="Times New Roman">&#273;&#7875; ho</FONT>&agrave;n t&#7845;t :</P>

</B>
  <blockquote>
    <P>C&oacute; th&#7875; gi&#7843;m thi&#7875;u th&#7901;i gian ch&#7901; <FONT FACE="Times New Roman">&#273;&#7907;i trung b</FONT>&igrave;nh c&#7911;a c&aacute;c ti&#7871;n tr&igrave;nh b&#7857;ng c&aacute;ch cho c&aacute;c ti&#7871;n tr&igrave;nh c&#7847;n &iacute;t th&#7901;i gian nh&#7845;t <FONT FACE="Times New Roman">&#273;&#7875; ho</FONT>&agrave;n t&#7845;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n tr&#432;&#7899;c. Tuy nhi&ecirc;n <FONT FACE="Times New Roman">&#273;áng ti&#7871;c l</FONT>&agrave; r&#7845;t hi&#7871;m khi bi&#7871;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ti&#7871;n tr&igrave;nh c&#7847;n bao nhi&ecirc;u th&#7901;i gian n&#7919;a <FONT FACE="Times New Roman">&#273;&#7875; k&#7871;t thúc x&#7917; lý.</P>
    </blockquote>
</FONT><B><I></blockquote>
  </blockquote>
  <P><img border="0" src="images/symble_asterisk_blue.gif"> II.1.3. <FONT FACE="Times New Roman">&#272;i&#7873;u ph&#7889;i  không &#273;&#7897;c quy&#7873;n v</FONT>&agrave; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i &#273;&#7897;c quy&#7873;n  (preemptive/nopreemptive)</P>

</B></I></FONT>
<blockquote>
  <P ALIGN="JUSTIFY">Thu&#7853;t to&aacute;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i c&#7847;n xem xét v</FONT>&agrave; quy&#7871;t <FONT FACE="Times New Roman">&#273;&#7883;nh th&#7901;i &#273;i&#7875;m chuy&#7875;n &#273;&#7893;i CPU gi&#7919;a các ti&#7871;n tr</FONT>&igrave;nh. H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&oacute; th&#7875; th&#7921;c hi&#7879;n c&#417; ch&#7871; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i theo nguy</FONT>&ecirc;n l&yacute; <I><FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n </I></FONT>ho&#7863;c <I>kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n</I></FONT>.</P>
<blockquote>

<B><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY"><img border="0" src="images/bullet.gif">
&#272;i&#7873;u ph&#7889;i &#273;&#7897;c quy&#7873;n</B></FONT>&nbsp;: Nguy&ecirc;n l&yacute; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i</FONT><I> <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n</I></FONT> cho ph&eacute;p m&#7897;t ti&#7871;n tr&igrave;nh khi nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c CPU s&#7869; c&oacute; quy&#7873;n <FONT FACE="Times New Roman">&#273;&#7897;c chi&#7871;m CPU &#273;&#7871;n khi ho</FONT>&agrave;n t&#7845;t x&#7917; l&yacute; ho&#7863;c t&#7921; nguy&#7879;n gi&#7843;i ph&oacute;ng CPU. Khi <FONT FACE="Times New Roman">&#273;ó quy&#7871;t &#273;&#7883;nh &#273;i&#7873;u ph&#7889;i CPU s&#7869; x&#7843;y ra trong các t</FONT>&igrave;nh hu&#7889;ng sau:</P><blockquote>

<P><img border="0" src="images/dotgreen.gif">Khi ti&#7871;n tr&igrave;nh chuy&#7875;n t&#7915; tr&#7841;ng th&aacute;i <FONT FACE="Times New Roman">&#273;ang x&#7917; lý(running) sang tr&#7841;ng thái b&#7883; khóa blocked ( ví d&#7909; ch&#7901; m&#7897;t thao tác nh&#7853;p xu&#7845;t hay ch&#7901; m&#7897;t ti&#7871;n tr</FONT>&igrave;nh con k&#7871;t th&uacute;c…).</P>
<P><img border="0" src="images/dotgreen.gif">Khi ti&#7871;n tr&igrave;nh k&#7871;t th&uacute;c.</P></blockquote>

<P ALIGN="JUSTIFY">C&aacute;c gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n th</FONT>&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n v&agrave; d&#7877; c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t. Tuy nhi</FONT>&ecirc;n ch&uacute;ng th&#432;&#7901;ng kh&ocirc;ng th&iacute;ch h&#7907;p v&#7899;i c&aacute;c h&#7879; th&#7889;ng t&#7893;ng qu&aacute;t nhi&#7873;u ng&#432;&#7901;i d&ugrave;ng, v&igrave; n&#7871;u cho ph&eacute;p m&#7897;t ti&#7871;n tr&igrave;nh c&oacute; quy&#7873;n x&#7917; l&yacute; bao l&acirc;u t&ugrave;y &yacute;, c&oacute; ngh&#297;a l&agrave; ti&#7871;n tr&igrave;nh n&agrave;y c&oacute; th&#7875; gi&#7919; CPU m&#7897;t th&#7901;i gian kh&ocirc;ng x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh, có th&#7875; ng&#259;n c&#7843;n nh&#7919;ng ti&#7871;n tr</FONT>&igrave;nh c&ograve;n l&#7841;i trong h&#7879; th&#7889;ng c&oacute; m&#7897;t c&#417; h&#7897;i <FONT FACE="Times New Roman">&#273;&#7875; x&#7917; lý.</P>
<B><P ALIGN="JUSTIFY"><img border="0" src="images/bullet.gif"> &#272;i&#7873;u ph&#7889;i không &#273;&#7897;c quy&#7873;n</B></FONT>&nbsp;: Ng&#432;&#7907;c v&#7899;i nguy&ecirc;n l&yacute; <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n, &#273;i&#7873;u ph&#7889;i theo nguy</FONT>&ecirc;n l&yacute; <I>kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n</I></FONT> cho ph&eacute;p t&#7841;m d&#7915;ng ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng c&#7911;a m&#7897;t ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;ang s&#7861;n s</FONT>&agrave;ng x&#7917; l&yacute;. Khi m&#7897;t ti&#7871;n tr&igrave;nh nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c CPU, n&oacute;  v&#7851;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng CPU <FONT FACE="Times New Roman">&#273;&#7871;n khi ho</FONT>&agrave;n t&#7845;t ho&#7863;c t&#7921; nguy&#7879;n gi&#7843;i ph&oacute;ng CPU, nh&#432;ng m&#7897;t ti&#7871;n tr&igrave;nh kh&aacute;c c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n c&oacute; th&#7875; d&agrave;nh quy&#7873;n s&#7917; d&#7909;ng CPU c&#7911;a ti&#7871;n tr&igrave;nh ban <FONT FACE="Times New Roman">&#273;&#7847;u. Nh</FONT>&#432; v&#7853;y l&agrave; ti&#7871;n tr&igrave;nh c&oacute; th&#7875; b&#7883; t&#7841;m d&#7915;ng ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng b&#7845;t c&#7913; lúc n</FONT>&agrave;o m&agrave; kh&ocirc;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&aacute;o tr&#432;&#7899;c, <FONT FACE="Times New Roman">&#273;&#7875; ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c  x&#7917; l&yacute;. C&aacute;c quy&#7871;t <FONT FACE="Times New Roman">&#273;&#7883;nh &#273;i&#7873;u ph&#7889;i x&#7843;y ra khi&nbsp;:</P><blockquote>

</FONT><P><img border="0" src="images/dotgreen.gif">Khi ti&#7871;n tr&igrave;nh chuy&#7875;n t&#7915; tr&#7841;ng th&aacute;i <FONT FACE="Times New Roman">&#273;ang x&#7917; lý (running) sang tr&#7841;ng thái b&#7883; khóa blocked ( ví d&#7909; ch&#7901; m&#7897;t thao tác nh&#7853;p xu&#7845;t hay ch&#7901; m&#7897;t ti&#7871;n tr</FONT>&igrave;nh con k&#7871;t th&uacute;c…).</P>
<P><img border="0" src="images/dotgreen.gif">Khi ti&#7871;n tr&igrave;nh chuy&#7875;n t&#7915; tr&#7841;ng th&aacute;i <FONT FACE="Times New Roman">&#273;ang x&#7917; lý (running) sang tr&#7841;ng thái ready ( ví d&#7909; x&#7843;y ra m&#7897;t ng&#7855;t).</P>
</FONT><P><img border="0" src="images/dotgreen.gif">Khi ti&#7871;n tr&igrave;nh chuy&#7875;n t&#7915; tr&#7841;ng th&aacute;i ch&#7901; (blocked) sang tr&#7841;ng th&aacute;i ready ( v&iacute; d&#7909; m&#7897;t thao t&aacute;c nh&#7853;p/xu&#7845;t ho&agrave;n t&#7845;t).</P>
<P><img border="0" src="images/dotgreen.gif">Khi ti&#7871;n tr&igrave;nh k&#7871;t th&uacute;c.</P></blockquote>

<P ALIGN="JUSTIFY">C&aacute;c thu&#7853;t to&aacute;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i theo nguy</FONT>&ecirc;n t&#7855;c kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n ng&#259;n c&#7843;n &#273;</FONT>&#432;&#7907;c t&igrave;nh tr&#7841;ng m&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7897;c chi&#7871;m CPU, nh</FONT>&#432;ng vi&#7879;c t&#7841;m d&#7915;ng m&#7897;t ti&#7871;n tr&igrave;nh c&oacute; th&#7875; d&#7851;n <FONT FACE="Times New Roman">&#273;&#7871;n các mâu thu&#7851;n trong truy xu&#7845;t, &#273;</FONT>&ograve;i h&#7887;i ph&#7843;i s&#7917; d&#7909;ng m&#7897;t  ph&#432;&#417;ng ph&aacute;p <FONT FACE="Times New Roman">&#273;&#7891;ng b&#7897; hóa thích h&#7907;p &#273;&#7875; gi&#7843;i quy&#7871;t.</P></blockquote>

</FONT><P ALIGN="JUSTIFY">Trong c&aacute;c h&#7879; th&#7889;ng s&#7917; d&#7909;ng nguy&ecirc;n l&yacute; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i &#273;&#7897;c quy&#7873;n có th&#7875; x&#7843;y ra t</FONT>&igrave;nh tr&#7841;ng c&aacute;c t&aacute;c v&#7909; c&#7847;n th&#7901;i gian x&#7917; l&yacute; ng&#7855;n ph&#7843;i ch&#7901; t&aacute;c v&#7909; x&#7917; l&yacute; v&#7899;i th&#7901;i gian r&#7845;t d&agrave;i ho&agrave;n t&#7845;t! Nguy&ecirc;n l&yacute; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i &#273;&#7897;c quy&#7873;n th</FONT>&#432;&#7901;ng ch&#7881; th&iacute;ch h&#7907;p v&#7899;i c&aacute;c h&#7879; x&#7917; l&yacute; theo l&ocirc;.</P>
<FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#7889;i v&#7899;i các h&#7879; th&#7889;ng t</FONT>&#432;&#417;ng t&aacute;c(time sharing), c&aacute;c h&#7879; th&#7901;i gian th&#7921;c (real time),c&#7847;n ph&#7843;i s&#7917; d&#7909;ng nguy&ecirc;n l&yacute; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i không &#273;&#7897;c quy&#7873;n &#273;&#7875; các ti&#7871;n tr</FONT>&igrave;nh quan tr&#7885;ng c&oacute; c&#417; h&#7897;i h&#7891;i <FONT FACE="Times New Roman">&#273;áp k&#7883;p th&#7901;i. Tuy nhi</FONT>&ecirc;n th&#7921;c hi&#7879;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i theo nguy</FONT>&ecirc;n l&yacute; kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n &#273;</FONT>&ograve;i h&#7887;i nh&#7919;ng c&#417; ch&#7871; ph&#7913;c t&#7841;p trong vi&#7879;c ph&acirc;n <FONT FACE="Times New Roman">&#273;&#7883;nh &#273;&#7897; </FONT>&#432;u ti&ecirc;n, v&agrave; ph&aacute;t sinh th&ecirc;m chi ph&iacute; khi chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i CPU qua l&#7841;i gi&#7919;a các ti&#7871;n tr</FONT>&igrave;nh.</P>
</blockquote>

<B>
</blockquote>

<P ALIGN="JUSTIFY" class="cap2"><a name="tochuc"><img border="0" src="images/read_single.gif"> 
II.2. T&#7893; ch&#7913;c <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i

</FONT>

</a></P>

</B>
<blockquote>

<B><I><P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif"> II.2.1. C&aacute;c danh s&aacute;ch s&#7917; d&#7909;ng trong qu&aacute; tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i.</P>

</B></I></FONT>
<blockquote>
  <P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh s&#7917; d&#7909;ng hai lo&#7841;i danh s&aacute;ch <FONT FACE="Times New Roman">&#273;&#7875; th&#7921;c hi&#7879;n &#273;i&#7873;u ph&#7889;i các ti&#7871;n tr</FONT>&igrave;nh l&agrave; <I>danh s&aacute;ch s&#7861;n s&agrave;ng (ready list)</I> v&agrave; <I>danh s&aacute;ch ch&#7901; <FONT FACE="Times New Roman">&#273;&#7907;i(waiting list)</I></FONT>.</P>
<P ALIGN="JUSTIFY">Khi m&#7897;t ti&#7871;n tr&igrave;nh b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u &#273;i v</FONT>&agrave;o h&#7879; th&#7889;ng, n&oacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ch&egrave;n v&agrave;o danh s&aacute;ch c&aacute;c t&aacute;c v&#7909; (job list). Danh s&aacute;ch n&agrave;y bao g&#7891;m t&#7845;t c&#7843; c&aacute;c ti&#7871;n tr&igrave;nh c&#7911;a h&#7879; th&#7889;ng. Nh&#432;ng ch&#7881; c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang th</FONT>&#432;&#7901;ng tr&uacute; trong b&#7897; nh&#7899; ch&iacute;nh v&agrave; &#7903; tr&#7841;ng th&aacute;i s&#7861;n s&agrave;ng ti&#7871;p nh&#7853;n CPU <FONT FACE="Times New Roman">&#273;&#7875; ho&#7841;t &#273;&#7897;ng m&#7899;i &#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o <I>danh s&aacute;ch s&#7861;n s&agrave;ng</I>.</P>
<P ALIGN="JUSTIFY">B&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i s&#7869; ch&#7885;n m&#7897;t ti&#7871;n tr</FONT>&igrave;nh  trong danh s&aacute;ch s&#7861;n s&agrave;ng v&agrave; c&#7845;p CPU cho ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ó. Ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p CPU s&#7869; th&#7921;c hi&#7879;n x&#7917; l&yacute;, v&agrave; c&oacute; th&#7875; chuy&#7875;n sang tr&#7841;ng th&aacute;i ch&#7901; khi x&#7843;y ra c&aacute;c s&#7921; ki&#7879;n nh&#432; <FONT FACE="Times New Roman">&#273;&#7907;i m&#7897;t thao tác nh&#7853;p/xu&#7845;t ho</FONT>&agrave;n t&#7845;t, y&ecirc;u c&#7847;u t&agrave;i nguy&ecirc;n ch&#432;a <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7887;a m&atilde;n, <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c y&ecirc;u c&#7847;u t&#7841;m d&#7915;ng ...Khi <FONT FACE="Times New Roman">&#273;ó ti&#7871;n tr</FONT>&igrave;nh s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chuy&#7875;n sang m&#7897;t danh s&aacute;ch ch&#7901; <FONT FACE="Times New Roman">&#273;&#7907;i.</P>
</FONT><P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ch&#7881; s&#7917; d&#7909;ng m&#7897;t danh s&aacute;ch s&#7861;n s&agrave;ng cho to&agrave;n h&#7879; th&#7889;ng, nh&#432;ng m&#7895;i m&#7897;t t&agrave;i nguy&ecirc;n ( thi&#7871;t b&#7883; ngo&#7841;i vi ) c&oacute; m&#7897;t danh s&aacute;ch ch&#7901; <FONT FACE="Times New Roman">&#273;&#7907;i ri</FONT>&ecirc;ng bao g&#7891;m c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang ch&#7901; &#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t t&agrave;i nguy&ecirc;n <FONT FACE="Times New Roman">&#273;ó.</P>
</FONT><B><P ALIGN="CENTER"><img border="0" src="images/hinh2.9.gif" width="466" height="206"></P>
  <P ALIGN="CENTER">H&igrave;nh 2.9 </B> C&aacute;c danh s&aacute;ch <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i</P>
</FONT><P ALIGN="JUSTIFY">Qu&aacute; tr&igrave;nh x&#7917; l&yacute; c&#7911;a m&#7897;t ti&#7871;n tr&igrave;nh tr&#7843;i qua nh&#7919;ng chu k&#7923; chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i qua l&#7841;i gi&#7919;a danh sách s&#7861;n s</FONT>&agrave;ng v&agrave; danh s&aacute;ch ch&#7901; <FONT FACE="Times New Roman">&#273;&#7907;i. S</FONT>&#417; <FONT FACE="Times New Roman">&#273;&#7891; d</FONT>&#432;&#7899;i <FONT FACE="Times New Roman">&#273;ây mô t&#7843; s&#7921; &#273;i&#7873;u ph&#7889;i các ti&#7871;n tr</FONT>&igrave;nh d&#7921;a tr&ecirc;n c&aacute;c danh s&aacute;ch c&#7911;a h&#7879; th&#7889;ng.</P>
<P ALIGN="JUSTIFY">Tho&#7841;t <FONT FACE="Times New Roman">&#273;&#7847;u ti&#7871;n tr</FONT>&igrave;nh m&#7899;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7863;t trong danh sách các ti&#7871;n tr</FONT>&igrave;nh s&#7861;n s&agrave;ng (ready list), n&oacute; s&#7869; <FONT FACE="Times New Roman">&#273;&#7907;i trong danh sách n</FONT>&agrave;y cho <FONT FACE="Times New Roman">&#273;&#7871;n khi &#273;</FONT>&#432;&#7907;c ch&#7885;n <FONT FACE="Times New Roman">&#273;&#7875; c&#7845;p phát CPU v</FONT>&agrave; b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u x&#7917; lý. Sau &#273;ó có th&#7875; x&#7843;y ra m&#7897;t trong các t</FONT>&igrave;nh hu&#7889;ng sau &nbsp;:</P>
<blockquote>
<blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif"> Ti&#7871;n tr&igrave;nh ph&aacute;t sinh m&#7897;t y&ecirc;u c&#7847;u m&#7897;t t&agrave;i nguy&ecirc;n m&agrave; h&#7879; th&#7889;ng ch&#432;a th&#7875; <FONT FACE="Times New Roman">&#273;áp &#7913;ng, khi &#273;ó ti&#7871;n tr</FONT>&igrave;nh s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chuy&#7875;n sang danh s&aacute;ch c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang ch&#7901; t</FONT>&agrave;i nguy&ecirc;n t&#432;&#417;ng &#7913;ng.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif"> Ti&#7871;n tr&igrave;nh c&oacute; th&#7875; b&#7883; b&#7855;t bu&#7897;c t&#7841;m d&#7915;ng x&#7917; l&yacute; do m&#7897;t ng&#7855;t x&#7843;y ra, khi <FONT FACE="Times New Roman">&#273;ó ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a tr&#7903; l&#7841;i v&agrave;o danh s&aacute;ch s&#7861;n s&agrave;ng <FONT FACE="Times New Roman">&#273;&#7875; ch&#7901; &#273;</FONT>&#432;&#7907;c c&#7845;p CPU cho l&#432;&#7907;t ti&#7871;p theo.</P></blockquote>
</blockquote>
</blockquote>
</blockquote>

<B><P ALIGN="CENTER"><img border="0" src="images/hinh2.10.jpg" width="430" height="200"></P>
<P ALIGN="CENTER">H&igrave;nh 2.10  </B>S&#417; <FONT FACE="Times New Roman">&#273;&#7891; chuy&#7875;n &#273;&#7893;i gi&#7919;a các danh sách &#273;i&#7873;u ph&#7889;i</P>
</FONT>
<blockquote>
  <blockquote>
    <P ALIGN="JUSTIFY">Trong tr&#432;&#7901;ng h&#7907;p <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n, ti&#7871;n tr&igrave;nh cu&#7889;i c&ugrave;ng s&#7869; chuy&#7875;n t&#7915; tr&#7841;ng th&aacute;i blocked  sang tr&#7841;ng th&aacute;i ready v&agrave; l&#7841;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a tr&#7903; v&agrave;o danh s&aacute;ch s&#7861;n s&agrave;ng. Ti&#7871;n tr&igrave;nh l&#7863;p l&#7841;i chu k&#7923; n&agrave;y cho <FONT FACE="Times New Roman">&#273;&#7871;n khi ho</FONT>&agrave;n t&#7845;t t&aacute;c v&#7909; th&igrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c h&#7879; th&#7889;ng h&#7911;y b&#7887; kh&#7887;i m&#7885;i danh s&aacute;ch <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i.</P>

</FONT><B><I>
    </blockquote>
    <P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif"> II.2.2. C&aacute;c c&#7845;p <FONT FACE="Times New Roman">&#273;&#7897; &#273;i&#7873;u ph&#7889;i</P>

</B></I></FONT>
  <blockquote>
    <P ALIGN="JUSTIFY">Th&#7921;c ra c&ocirc;ng vi&#7879;c <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i &#273;</FONT>&#432;&#7907;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh th&#7921;c hi&#7879;n &#7903; hai m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; : <I>&#273;i&#7873;u ph&#7889;i tác v&#7909; (job scheduling)</I></FONT> v&agrave;<I> <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i ti&#7871;n tr</FONT>&igrave;nh ( process scheduling)</I>. </P>

<B><P ALIGN="JUSTIFY">a) <FONT FACE="Times New Roman">&#272;i&#7873;u ph&#7889;i tác v&#7909; </P>
<blockquote>

</B></FONT><P>Quy&#7871;t <FONT FACE="Times New Roman">&#273;&#7883;nh l&#7921;a ch&#7885;n tác v&#7909; n</FONT>&agrave;o <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o h&#7879; th&#7889;ng, v&agrave; n&#7841;p nh&#7919;ng ti&#7871;n tr&igrave;nh c&#7911;a t&aacute;c v&#7909; <FONT FACE="Times New Roman">&#273;ó v</FONT>&agrave;o b&#7897; nh&#7899; ch&iacute;nh <FONT FACE="Times New Roman">&#273;&#7875; th&#7921;c hi&#7879;n. Ch&#7913;c n&#259;ng &#273;i&#7873;u ph&#7889;i tác v&#7909; quy&#7871;t  &#273;&#7883;nh m&#7913;c &#273;&#7897; &#273;a ch</FONT>&#432;&#417;ng c&#7911;a h&#7879; th&#7889;ng ( s&#7889; l&#432;&#7907;ng ti&#7871;n tr&igrave;nh trong b&#7897; nh&#7899; ch&iacute;nh). Khi h&#7879; th&#7889;ng t&#7841;o l&#7853;p m&#7897;t ti&#7871;n tr&igrave;nh, hay c&oacute; m&#7897;t ti&#7871;n tr&igrave;nh k&#7871;t th&uacute;c x&#7917; l&yacute; th&igrave; ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng &#273;i&#7873;u ph&#7889;i tác v&#7909; m&#7899;i &#273;</FONT>&#432;&#7907;c k&iacute;ch ho&#7841;t. V&igrave; m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; &#273;a ch</FONT>&#432;&#417;ng t&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i &#7893;n &#273;&#7883;nh n</FONT>&ecirc;n ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng &#273;i&#7873;u ph&#7889;i tác v&#7909; có t&#7847;n su&#7845;t ho&#7841;t &#273;&#7897;ng th&#7845;p . </P>
<P>&#272;&#7875; h&#7879; th&#7889;ng ho&#7841;t &#273;&#7897;ng t&#7889;t, b&#7897; &#273;i&#7873;u ph&#7889;i tác v&#7909; c&#7847;n bi&#7879;t tính ch&#7845;t c&#7911;a ti&#7871;n tr</FONT>&igrave;nh l&agrave;<I> h&#432;&#7899;ng nh&#7853;p xu&#7845;t (I/O bounded)</I> hay <I>h&#432;&#7899;ng x&#7917; l&yacute; ( CPU bounded)</I>. M&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave;<I> h&#432;&#7899;ng nh&#7853;p xu&#7845;t</I> n&#7871;u n&oacute; ch&#7911; y&#7871;u n&oacute; ch&#7881; s&#7917; d&#7909;ng CPU <FONT FACE="Times New Roman">&#273;&#7875; th&#7921;c hi&#7879;n các thao tác nh&#7853;p xu&#7845;t. Ng</FONT>&#432;&#7907;c l&#7841;i m&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave;<I> h&#432;&#7899;ng x&#7917; l&yacute; </I> n&#7871;u n&oacute; ch&#7911; y&#7871;u n&oacute; ch&#7881; s&#7917; d&#7909;ng CPU <FONT FACE="Times New Roman">&#273;&#7875; th&#7921;c hi&#7879;n các thao tác tính toán. &#272;&#7875; cân b&#7857;ng ho&#7841;t &#273;&#7897;ng c&#7911;a CPU v</FONT>&agrave; c&aacute;c thi&#7871;t b&#7883; ngo&#7841;i vi, b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i tác v&#7909; n</FONT>&ecirc;n l&#7921;a ch&#7885;n c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7875; n&#7841;p v</FONT>&agrave;o b&#7897; nh&#7899; sao cho h&#7879; th&#7889;ng l&agrave; s&#7921; pha tr&#7897;n h&#7907;p l&yacute; gi&#7919;a c&aacute;c ti&#7871;n tr&igrave;nh <I>h&#432;&#7899;ng nh&#7853;p xu&#7845;t </I>v&agrave; c&aacute;c ti&#7871;n tr&igrave;nh <I>h&#432;&#7899;ng x&#7917; l&yacute; </P>

</I><B></blockquote>
<P ALIGN="JUSTIFY">b) <FONT FACE="Times New Roman">&#272;i&#7873;u ph&#7889;i ti&#7871;n tr</FONT>&igrave;nh</P>

</B>
<blockquote>
<P>Ch&#7885;n m&#7897;t ti&#7871;n tr&igrave;nh &#7903; tr&#7841;ng th&aacute;i s&#7861;n s&agrave;ng ( <FONT FACE="Times New Roman">&#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o b&#7897; nh&#7899; ch&iacute;nh, v&agrave; c&oacute; <FONT FACE="Times New Roman">&#273;&#7911; t</FONT>&agrave;i nguy&ecirc;n <FONT FACE="Times New Roman">&#273;&#7875; ho&#7841;t &#273;&#7897;ng ) v</FONT>&agrave; c&#7845;p ph&aacute;t CPU cho ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ó th&#7921;c hi&#7879;n. B&#7897; &#273;i&#7873;u ph&#7889;i ti&#7871;n tr</FONT>&igrave;nh c&oacute; t&#7847;n su&#7845;t ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng cao, sau m&#7895;i l&#7847;n x&#7843;y ra ng&#7855;t ( do &#273;&#7891;ng h&#7891; báo gi&#7901;, do các thi&#7871;t b&#7883; ngo&#7841;i vi...), th</FONT>&#432;&#7901;ng l&agrave; 1 l&#7847;n trong kho&#7843;ng 100ms. Do v&#7853;y <FONT FACE="Times New Roman">&#273;&#7875; nâng cao hi&#7879;u su&#7845;t c&#7911;a h&#7879; th&#7889;ng, c&#7847;n ph&#7843;i t&#259;ng t&#7889;c &#273;&#7897; x&#7917; lý c&#7911;a b&#7897; &#273;i&#7873;u ph&#7889;i ti&#7871;n tr</FONT>&igrave;nh. Ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng &#273;i&#7873;u ph&#7889;i ti&#7871;n tr</FONT>&igrave;nh l&agrave; m&#7897;t trong ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c</FONT>&#417; b&#7843;n, quan tr&#7885;ng nh&#7845;t c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh.</P>
<P>Trong nhi&#7873;u h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh, c&oacute; th&#7875; kh&ocirc;ng c&oacute; b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i tác v&#7909; ho&#7863;c tách bi&#7879;t r&#7845;t ít &#273;&#7889;i v&#7899;i b&#7897; &#273;i&#7873;u ph&#7889;i ti&#7871;n tr</FONT>&igrave;nh. M&#7897;t v&agrave;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&#7841;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;a ra m&#7897;t c&#7845;p <FONT FACE="Times New Roman">&#273;&#7897; &#273;i&#7873;u ph&#7889;i trung gian k&#7871;t h&#7907;p c&#7843; hai c&#7845;p &#273;&#7897; &#273;i&#7873;u ph&#7889;i tác v&#7909; v</FONT>&agrave; ti&#7871;n tr&igrave;nh</P></blockquote>
  </blockquote>

<B><P ALIGN="CENTER"><img border="0" src="images/hinh2.11.jpg" width="430" height="200"></P>
<P ALIGN="CENTER">H&igrave;nh 2.11</B>     C&#7845;p <FONT FACE="Times New Roman">&#273;&#7897; &#273;i&#7873;u ph&#7889;i trung gian</P>
<P>&nbsp;</P>
</FONT><B>
  </blockquote>
  <P ALIGN="JUSTIFY" class="cap2"><a name="chienluoc"><img border="0" src="images/read_single.gif"> 
  II.3. C&aacute;c chi&#7871;n l&#432;&#7907;c <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i

</FONT></a></P>

</B>
<blockquote>
  <B><I><P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif">
  II.3.1. Chi&#7871;n l&#432;&#7907;c FIFO</P>
<blockquote>

</I><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif">Nguy&ecirc;n t&#7855;c</B>&nbsp;: CPU <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n trong danh s&aacute;ch s&#7861;n s&agrave;ng c&oacute; y&ecirc;u c&#7847;u, l&agrave; ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o h&#7879; th&#7889;ng s&#7899;m nh&#7845;t. <FONT FACE="Times New Roman">&#272;ây l</FONT>&agrave; thu&#7853;t to&aacute;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i theo nguy</FONT>&ecirc;n t&#7855;c <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n. M&#7897;t khi CPU &#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh, CPU ch&#7881; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ti&#7871;n tr&igrave;nh t&#7921; nguy&#7879;n gi&#7843;i ph&oacute;ng khi k&#7871;t th&uacute;c x&#7917; l&yacute; hay khi c&oacute; m&#7897;t y&ecirc;u c&#7847;u nh&#7853;p/xu&#7845;t.</P></blockquote>

<B><P ALIGN="CENTER"><img border="0" src="images/hinh2.12.jpg" width="284" height="71"></P>
<P ALIGN="CENTER">H&igrave;nh  2.12 </B> <FONT FACE="Times New Roman">&#272;i&#7873;u ph&#7889;i FIFO</P>
<blockquote>
</FONT><U><P ALIGN="JUSTIFY"><img border="0" src="images/more1.gif">V&iacute; d&#7909;&nbsp;:</U>   </P>
  </blockquote>
</blockquote>

<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=358>
<TR><TD WIDTH="23%" VALIGN="TOP">
<P ALIGN="CENTER">Ti&#7871;n tr&igrave;nh</TD>
<TD WIDTH="46%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m v</FONT>&agrave;o RL</TD>
<TD WIDTH="32%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i gian x&#7917; l&yacute;</TD>
</TR>
<TR><TD WIDTH="23%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="46%" VALIGN="TOP">
<P ALIGN="CENTER">0</TD>
<TD WIDTH="32%" VALIGN="TOP">
<P ALIGN="CENTER">24</TD>
</TR>
<TR><TD WIDTH="23%" VALIGN="TOP">
<P ALIGN="CENTER">P2</TD>
<TD WIDTH="46%" VALIGN="TOP">
<P ALIGN="CENTER">1</TD>
<TD WIDTH="32%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
</TR>
<TR><TD WIDTH="23%" VALIGN="TOP">
<P ALIGN="CENTER">P3</TD>
<TD WIDTH="46%" VALIGN="TOP">
<P ALIGN="CENTER">2</TD>
<TD WIDTH="32%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
</TR>
</TABLE>
</CENTER>
<blockquote>
<blockquote>
<P ALIGN="JUSTIFY">Th&#7913; t&#7921; c&#7845;p ph&aacute;t CPU cho c&aacute;c ti&#7871;n tr&igrave;nh l&agrave;&nbsp;: </P>
</blockquote>
</blockquote>

<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=179>
<TR><TD WIDTH="33%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="33%" VALIGN="TOP">
<P ALIGN="CENTER">P2</TD>
<TD WIDTH="33%" VALIGN="TOP">
<P ALIGN="CENTER">P3</TD>
</TR>
<TR><TD WIDTH="33%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">0         </FONT></TD>
<TD WIDTH="33%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">‘24</FONT></TD>
<TD WIDTH="33%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">27      30</FONT></TD>
</TR>
</TABLE>
</CENTER>
<blockquote>
<blockquote>
  <blockquote>
<P ALIGN="JUSTIFY">th&#7901;i gian ch&#7901; <FONT FACE="Times New Roman">&#273;&#7907;i &#273;</FONT>&#432;&#7907;c x&#7917; l&yacute; l&agrave; 0 <FONT FACE="Times New Roman">&#273;&#7889;i v&#7899;i P1, (24 -1) v&#7899;i P2 v</FONT>&agrave; (24+3-2) v&#7899;i P3. Th&#7901;i gian ch&#7901; trung b&igrave;nh l&agrave; ( 0+23+25)/3 = 16 milisecondes.</P>
<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#7843;o lu&#7853;n</B>&nbsp;: Th&#7901;i gian ch&#7901; trung b&igrave;nh kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7841;t c&#7921;c ti&#7875;u, v</FONT>&agrave;  bi&#7871;n <FONT FACE="Times New Roman">&#273;&#7893;i &#273;áng k&#7875; &#273;&#7889;i v&#7899;i các giá tr&#7883; v&#7873; th&#7901;i gian y</FONT>&ecirc;u c&#7847;u x&#7917; l&yacute; v&agrave; th&#7913; t&#7921; kh&aacute;c nhau c&#7911;a c&aacute;c ti&#7871;n tr&igrave;nh trong danh s&aacute;ch s&#7861;n s&agrave;ng. C&oacute; th&#7875; x&#7843;y ra hi&#7879;n t&#432;&#7907;ng t&iacute;ch l&#361;y th&#7901;i gian ch&#7901;, khi c&aacute;c t&#7845;t c&#7843; c&aacute;c ti&#7871;n tr&igrave;nh (c&oacute; th&#7875; c&oacute; y&ecirc;u c&#7847;u th&#7901;i gian ng&#7855;n) ph&#7843;i ch&#7901; <FONT FACE="Times New Roman">&#273;&#7907;i m&#7897;t ti&#7871;n tr</FONT>&igrave;nh c&oacute; y&ecirc;u c&#7847;u th&#7901;i gian d&agrave;i k&#7871;t th&uacute;c x&#7917; l&yacute;.</P>
<P ALIGN="JUSTIFY">Gi&#7843;i thu&#7853;t n&agrave;y <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t không ph</FONT>&ugrave; h&#7907;p v&#7899;i c&aacute;c h&#7879; ph&acirc;n chia th&#7901;i gian, trong c&aacute;c h&#7879; n&agrave;y, c&#7847;n cho ph&eacute;p m&#7895;i ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t CPU <FONT FACE="Times New Roman">&#273;&#7873;u &#273;&#7863;n trong t&#7915;ng kho&#7843;ng th&#7901;i gian.</P>
    </blockquote>
</FONT>
<B><I><P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
II.3.2. Chi&#7871;n l&#432;&#7907;c ph&acirc;n ph&#7889;i xoay v&ograve;ng (Round Robin)</P>
</I>
<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18">Nguy&ecirc;n t&#7855;c</B>&nbsp;: Danh s&aacute;ch s&#7861;n s&agrave;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c x&#7917; l&yacute; nh&#432; m&#7897;t danh s&aacute;ch v&ograve;ng, b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i l&#7847;n l</FONT>&#432;&#7907;t c&#7845;p ph&aacute;t cho t&#7915;ng ti&#7871;n tr&igrave;nh trong danh s&aacute;ch m&#7897;t kho&#7843;ng th&#7901;i gian s&#7917; d&#7909;ng CPU g&#7885;i l&agrave; <I>quantum</I>. <FONT FACE="Times New Roman">&#272;ây l</FONT>&agrave; m&#7897;t gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i không &#273;&#7897;c quy&#7873;n&nbsp;: khi m&#7897;t ti&#7871;n tr</FONT>&igrave;nh s&#7917; d&#7909;ng CPU <FONT FACE="Times New Roman">&#273;&#7871;n h&#7871;t th&#7901;i gian quantum d</FONT>&agrave;nh cho n&oacute;, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh thu h&#7891;i CPU v&agrave; c&#7845;p cho ti&#7871;n tr&igrave;nh k&#7871; ti&#7871;p trong danh s&aacute;ch. N&#7871;u ti&#7871;n tr&igrave;nh b&#7883; kh&oacute;a hay k&#7871;t th&uacute;c tr&#432;&#7899;c khi s&#7917; d&#7909;ng h&#7871;t th&#7901;i gian quantum, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#361;ng l&#7853;p t&#7913;c c&#7845;p ph&aacute;t CPU cho ti&#7871;n tr&igrave;nh kh&aacute;c. Khi ti&#7871;n tr&igrave;nh ti&ecirc;u th&#7909; h&#7871;t th&#7901;i gian CPU d&agrave;nh cho n&oacute; m&agrave; ch&#432;a ho&agrave;n t&#7845;t, ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a tr&#7903; l&#7841;i v&agrave;o cu&#7889;i danh s&aacute;ch s&#7861;n s&agrave;ng <FONT FACE="Times New Roman">&#273;&#7875; &#273;&#7907;i &#273;</FONT>&#432;&#7907;c c&#7845;p CPU trong l&#432;&#7907;t k&#7871; ti&#7871;p.</P>

<P ALIGN="JUSTIFY">  <U><img border="0" src="images/more1.gif" width="14" height="14">
V&iacute; d&#7909; &nbsp;:</U>   </P>
  </blockquote>
<B><P ALIGN="CENTER"><img border="0" src="images/hinh2.13.jpg" width="324" height="114"></P>
<P ALIGN="CENTER">H&igrave;nh  2.13 </B> <FONT FACE="Times New Roman">&#272;i&#7873;u ph&#7889;i Round Robin</P>
</FONT>
<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=352>
<TR><TD WIDTH="23%" VALIGN="TOP">
<P ALIGN="CENTER">Ti&#7871;n tr&igrave;nh</TD>
<TD WIDTH="39%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m v</FONT>&agrave;o RL</TD>
<TD WIDTH="38%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i gian x&#7917; l&yacute;</TD>
</TR>
<TR><TD WIDTH="23%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="39%" VALIGN="TOP">
<P ALIGN="CENTER">0</TD>
<TD WIDTH="38%" VALIGN="TOP">
<P ALIGN="CENTER">24</TD>
</TR>
<TR><TD WIDTH="23%" VALIGN="TOP">
<P ALIGN="CENTER">P2</TD>
<TD WIDTH="39%" VALIGN="TOP">
<P ALIGN="CENTER">1</TD>
<TD WIDTH="38%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
</TR>
<TR><TD WIDTH="23%" VALIGN="TOP">
<P ALIGN="CENTER">P3</TD>
<TD WIDTH="39%" VALIGN="TOP">
<P ALIGN="CENTER">2</TD>
<TD WIDTH="38%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
</TR>
</TABLE>
</CENTER>
  <blockquote>
<blockquote>

<P ALIGN="JUSTIFY">N&#7871;u s&#7917; d&#7909;ng quantum l&agrave; 4 milisecondes, th&#7913; t&#7921; c&#7845;p ph&aacute;t CPU s&#7869; l&agrave;&nbsp;:</P></blockquote>

<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=477>
<TR><TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="CENTER">P2</TD>
<TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="CENTER">P3</TD>
<TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="12%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
</TR>
<TR><TD WIDTH="13%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">0         </FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">‘4</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">7</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">10</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">14</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">18</FONT></TD>
<TD WIDTH="12%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">22</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT SIZE=2><P ALIGN="JUSTIFY">26         30</FONT></TD>
</TR>
</TABLE>
</CENTER>
<blockquote>
<P ALIGN="JUSTIFY">Th&#7901;i gian ch&#7901; <FONT FACE="Times New Roman">&#273;&#7907;i trung b</FONT>&igrave;nh s&#7869; l&agrave; (0+6+3+5)/3 = 4.66 milisecondes.</P>
<P ALIGN="JUSTIFY">N&#7871;u c&oacute; <I>n</I> ti&#7871;n tr&igrave;h trong danh s&aacute;ch s&#7861;n s&agrave;ng v&agrave; s&#7917; d&#7909;ng quantum <I>q</I>, th&igrave; m&#7895;i ti&#7871;n tr&igrave;nh s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t CPU <I>1/n</I> trong t&#7915;ng kho&#7843;ng th&#7901;i gian <I>q</I>. M&#7895;i ti&#7871;n tr&igrave;nh s&#7869; kh&ocirc;ng ph&#7843;i <FONT FACE="Times New Roman">&#273;&#7907;i quá </FONT><I>(n-1)q</I> <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; th&#7901;i gian tr&#432;&#7899;c khi nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c CPU cho l&#432;&#7907;t k&#7871; ti&#7871;p.</P>
<B></blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#7843;o lu&#7853;n</B>&nbsp;: V&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; &#273;áng quan tâm &#273;&#7889;i v&#7899;i gi&#7843;i thu&#7853;t RR l</FONT>&agrave; <FONT FACE="Times New Roman">&#273;&#7897; d</FONT>&agrave;i c&#7911;a quantum. N&#7871;u th&#7901;i l&#432;&#7907;ng quantum qu&aacute; b&eacute; s&#7869; ph&aacute;t sinh qu&aacute; nhi&#7873;u s&#7921; chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i gi&#7919;a các ti&#7871;n tr</FONT>&igrave;nh v&agrave; khi&#7871;n cho vi&#7879;c s&#7917; d&#7909;ng CPU k&eacute;m hi&#7879;u q&#7911;a. Nh&#432;ng n&#7871;u s&#7917; d&#7909;ng quantum qu&aacute; l&#7899;n s&#7869; l&agrave;m t<FONT FACE="Times New Roman">&#259;ng th&#7901;i gian h&#7891;i &#273;áp v</FONT>&agrave; gi&#7843;m kh&#7843; n<FONT FACE="Times New Roman">&#259;ng t</FONT>&#432;&#417;ng t&aacute;c c&#7911;a h&#7879; th&#7889;ng. </P>
<B><I>
</blockquote>
<P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
II.3.3. <FONT FACE="Times New Roman">&#272;i&#7873;u ph&#7889;i v&#7899;i &#273;&#7897; </FONT>&#432;u ti&ecirc;n</P>
</I></B>
 <blockquote>
<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18">Nguy&ecirc;n t&#7855;c</B>&nbsp;: M&#7895;i ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&aacute;n cho m&#7897;t <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n t&#432;&#417;ng &#7913;ng, ti&#7871;n tr&igrave;nh c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n cao nh&#7845;t s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ch&#7885;n <FONT FACE="Times New Roman">&#273;&#7875; c&#7845;p phát CPU &#273;&#7847;u ti</FONT>&ecirc;n. <FONT FACE="Times New Roman">&#272;&#7897; </FONT>&#432;u ti&ecirc;n c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a n&#7897;i t&#7841;i hay nh&#7901; v</FONT>&agrave;o c&aacute;c y&#7871;u t&#7889; b&ecirc;n ngo&agrave;i. <FONT FACE="Times New Roman">&#272;&#7897; </FONT>&#432;u ti&ecirc;n n&#7897;i t&#7841;i s&#7917; d&#7909;ng c&aacute;c <FONT FACE="Times New Roman">&#273;&#7841;i l</FONT>&#432;&#7907;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;o l</FONT>&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;&#7875; tính toán &#273;&#7897; </FONT>&#432;u ti&ecirc;n c&#7911;a ti&#7871;n tr&igrave;nh, v&iacute; d&#7909; c&aacute;c gi&#7899;i h&#7841;n th&#7901;i gian, nhu c&#7847;u b&#7897; nh&#7899;…<FONT FACE="Times New Roman">&#272;&#7897; </FONT>&#432;u ti&ecirc;n c&#361;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&aacute;n t&#7915; b&ecirc;n ngo&agrave;i d&#7921;a v&agrave;o c&aacute;c ti&ecirc;u chu&#7849;n do h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh nh&#432; t&#7847;m quan tr&#7885;ng c&#7911;a ti&#7871;n tr&igrave;nh, lo&#7841;i ng&#432;&#7901;i s&#7917; d&#7909;ng s&#7905; h&#7919;u ti&#7871;n tr&igrave;nh… </P>
<P ALIGN="JUSTIFY">Gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i v&#7899;i &#273;&#7897; </FONT>&#432;u ti&ecirc;n c&oacute; th&#7875; theo nguy&ecirc;n t&#7855;c <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n hay không &#273;&#7897;c quy&#7873;n. Khi m&#7897;t ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o danh s&aacute;ch c&aacute;c ti&#7871;n tr&igrave;nh s&#7861;n s&agrave;ng, <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n c&#7911;a n&oacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c so s&aacute;nh v&#7899;i <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n c&#7911;a ti&#7871;n tr&igrave;nh hi&#7879;n h&agrave;nh <FONT FACE="Times New Roman">&#273;ang x&#7917; lý. Gi&#7843;i thu&#7853;t &#273;i&#7873;u ph&#7889;i v&#7899;i &#273;&#7897; </FONT>&#432;u ti&ecirc;n v&agrave; kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n s&#7869; thu h&#7891;i CPU t&#7915; ti&#7871;n tr</FONT>&igrave;nh hi&#7879;n h&agrave;nh <FONT FACE="Times New Roman">&#273;&#7875; c&#7845;p phát cho ti&#7871;n tr</FONT>&igrave;nh m&#7899;i n&#7871;u <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n c&#7911;a ti&#7871;n tr&igrave;nh n&agrave;y cao h&#417;n ti&#7871;n tr&igrave;nh hi&#7879;n h&agrave;nh. M&#7897;t gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n s&#7869; ch&#7881; &#273;</FONT>&#417;n gi&#7843;n ch&egrave;n ti&#7871;n tr&igrave;nh m&#7899;i v&agrave;o danh s&aacute;ch s&#7861;n s&agrave;ng, v&agrave; ti&#7871;n tr&igrave;nh hi&#7879;n h&agrave;nh v&#7851;n ti&#7871;p t&#7909;c x&#7917; l&yacute; h&#7871;t th&#7901;i gian d&agrave;nh cho n&oacute;.</P></blockquote>

<U><P ALIGN="JUSTIFY"><img border="0" src="images/more1.gif" width="14" height="14">V&iacute; d&#7909;&nbsp;:</U>   (<FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n 1 &gt; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n 2&gt; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n 3)</P>
  </blockquote>

<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=415>
<TR><TD WIDTH="18%" VALIGN="TOP">
<P ALIGN="CENTER">Ti&#7871;n tr&igrave;nh</TD>
<TD WIDTH="34%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m v</FONT>&agrave;o RL</TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Times New Roman"><P ALIGN="CENTER">&#272;&#7897; </FONT>&#432;u ti&ecirc;n</TD>
<TD WIDTH="27%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i gian x&#7917; l&yacute;</TD>
</TR>
<TR><TD WIDTH="18%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="34%" VALIGN="TOP">
<P ALIGN="CENTER">0</TD>
<TD WIDTH="20%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
<TD WIDTH="27%" VALIGN="TOP">
<P ALIGN="CENTER">24</TD>
</TR>
<TR><TD WIDTH="18%" VALIGN="TOP">
<P ALIGN="CENTER">P2</TD>
<TD WIDTH="34%" VALIGN="TOP">
<P ALIGN="CENTER">1</TD>
<TD WIDTH="20%" VALIGN="TOP">
<P ALIGN="CENTER">1</TD>
<TD WIDTH="27%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
</TR>
<TR><TD WIDTH="18%" VALIGN="TOP">
<P ALIGN="CENTER">P3</TD>
<TD WIDTH="34%" VALIGN="TOP">
<P ALIGN="CENTER">2</TD>
<TD WIDTH="20%" VALIGN="TOP">
<P ALIGN="CENTER">2</TD>
<TD WIDTH="27%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
</TR>
</TABLE>
</CENTER>
<blockquote>
<P ALIGN="JUSTIFY">S&#7917; d&#7909;ng thu&#7853;t gi&#7843;i <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n, th&#7913; t&#7921; c&#7845;p phát CPU nh</FONT>&#432; sau&nbsp;:</P></blockquote>
<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=205>
<TR><TD WIDTH="32%" VALIGN="TOP" HEIGHT=21>
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="32%" VALIGN="TOP" HEIGHT=21>
<P ALIGN="CENTER">P2</TD>
<TD WIDTH="36%" VALIGN="TOP" HEIGHT=21>
<P ALIGN="CENTER">P3</TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="TOP" HEIGHT=17>
<FONT SIZE=2><P ALIGN="JUSTIFY">0         </FONT></TD>
<TD WIDTH="32%" VALIGN="TOP" HEIGHT=17>
<FONT SIZE=2><P ALIGN="JUSTIFY">‘24</FONT></TD>
<TD WIDTH="36%" VALIGN="TOP" HEIGHT=17>
<FONT SIZE=2><P ALIGN="JUSTIFY">27          30</FONT></TD>
</TR>
</TABLE>
</CENTER>
<blockquote>

<P ALIGN="JUSTIFY">S&#7917; d&#7909;ng thu&#7853;t gi&#7843;i kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n, th&#7913; t&#7921; c&#7845;p phát CPU nh</FONT>&#432; sau&nbsp;:</P></blockquote>
<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=264>
<TR><TD WIDTH="25%" VALIGN="TOP" HEIGHT=21>
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="25%" VALIGN="TOP" HEIGHT=21>
<P ALIGN="CENTER">P2</TD>
<TD WIDTH="25%" VALIGN="TOP" HEIGHT=21>
<P ALIGN="CENTER">P3</TD>
<TD WIDTH="25%" VALIGN="TOP" HEIGHT=21>
<P ALIGN="CENTER">P1</TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP" HEIGHT=17>
<FONT SIZE=2><P ALIGN="JUSTIFY">0         </FONT></TD>
<TD WIDTH="25%" VALIGN="TOP" HEIGHT=17>
<FONT SIZE=2><P ALIGN="JUSTIFY">‘1</FONT></TD>
<TD WIDTH="25%" VALIGN="TOP" HEIGHT=17>
<FONT SIZE=2><P ALIGN="JUSTIFY">4              </FONT></TD>
<TD WIDTH="25%" VALIGN="TOP" HEIGHT=17>
<FONT SIZE=2><P ALIGN="JUSTIFY">7           30</FONT></TD>
</TR>
</TABLE>
</CENTER>

<blockquote>
<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#7843;o lu&#7853;n</B>&nbsp;: T&igrave;nh tr&#7841;ng ‘<FONT FACE="Times New Roman">&#273;ói CPU’ (starvation) l</FONT>&agrave; m&#7897;t v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; chính y&#7871;u c&#7911;a các gi&#7843;i thu&#7853;t s&#7917; d&#7909;ng &#273;&#7897; </FONT>&#432;u ti&ecirc;n. C&aacute;c gi&#7843;i thu&#7853;t n&agrave;y c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;&#7875; các ti&#7871;n tr</FONT>&igrave;nh c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n th&#7845;p ch&#7901; <FONT FACE="Times New Roman">&#273;&#7885;i CPU vô h&#7841;n&nbsp;! &#272;&#7875; ng&#259;n c&#7843;n các ti&#7871;n tr</FONT>&igrave;nh c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n cao chi&#7871;m d&#7909;ng CPU v&ocirc; th&#7901;i h&#7841;n, b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i s&#7869; gi&#7843;m d&#7847;n &#273;&#7897; </FONT>&#432;u ti&ecirc;n c&#7911;a c&aacute;c ti&#7871;n tr&igrave;nh n&agrave;y sau m&#7895;i ng&#7855;t <FONT FACE="Times New Roman">&#273;&#7891;ng h&#7891;. N&#7871;u &#273;&#7897; </FONT>&#432;u ti&ecirc;n c&#7911;a ti&#7871;n tr&igrave;nh n&agrave;y gi&#7843;m xu&#7889;ng th&#7845;p h&#417;n ti&#7871;n tr&igrave;nh c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n cao th&#7913; nh&igrave;, s&#7869; x&#7843;y ra s&#7921; chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i quy&#7873;n s&#7917; d&#7909;ng CPU.Quá tr</FONT>&igrave;nh n&agrave;y g&#7885;i l&agrave; s&#7921;  ‘l&atilde;o h&oacute;a’<I> (aging)</I> ti&#7871;n tr&igrave;nh.</P>
<B><I></blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
II.3.4. Chi&#7871;n l&#432;&#7907;c c&ocirc;ng vi&#7879;c ng&#7855;n nh&#7845;t  (Shortest-job-first SJF)</P>
</I></B>
<B>
<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18">Nguy&ecirc;n t&#7855;c</B>&nbsp;: <FONT FACE="Times New Roman">&#272;ây l</FONT>&agrave; m&#7897;t tr&#432;&#7901;ng h&#7907;p <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t c&#7911;a gi&#7843;i thu&#7853;t &#273;i&#7873;u ph&#7889;i v&#7899;i &#273;&#7897; </FONT>&#432;u ti&ecirc;n. Trong gi&#7843;i thu&#7853;t n&agrave;y, <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n <I>p</I> <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&aacute;n cho m&#7895;i ti&#7871;n tr&igrave;nh l&agrave; ngh&#7883;ch <FONT FACE="Times New Roman">&#273;&#7843;o c&#7911;a th&#7901;i gian x&#7917; lý </FONT><I>t</I> m&agrave; ti&#7871;n tr&igrave;nh y&ecirc;u c&#7847;u&nbsp;: <I>p = 1/t</I>. Khi CPU <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7921; do, n&oacute; s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t cho ti&#7871;n tr&igrave;nh y&ecirc;u c&#7847;u &iacute;t th&#7901;i gian nh&#7845;t <FONT FACE="Times New Roman">&#273;&#7875; k&#7871;t thúc- ti&#7871;n tr</FONT>&igrave;nh ng&#7855;n nh&#7845;t. Gi&#7843;i thu&#7853;t n&agrave;y c&#361;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n hay không &#273;&#7897;c quy&#7873;n. S&#7921; ch&#7885;n l&#7921;a x&#7843;y ra khi có m&#7897;t ti&#7871;n tr</FONT>&igrave;nh m&#7899;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o danh s&aacute;ch s&#7861;n s&agrave;ng trong khi m&#7897;t ti&#7871;n tr&igrave;nh kh&aacute;c <FONT FACE="Times New Roman">&#273;ang x&#7917; lý. Ti&#7871;n tr</FONT>&igrave;nh m&#7899;i c&oacute; th&#7875; s&#7905; h&#7919;u m&#7897;t y&ecirc;u c&#7847;u th&#7901;i gian s&#7917; d&#7909;ng CPU cho l&#7847;n ti&#7871;p theo (CPU-burst) ng&#7855;n h&#417;n th&#7901;i gian c&ograve;n l&#7841;i m&agrave; ti&#7871;n tr&igrave;nh hi&#7879;n h&agrave;nh c&#7847;n x&#7917; l&yacute;. Gi&#7843;i thu&#7853;t SJF kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n s&#7869; d&#7915;ng ho&#7841;t &#273;&#7897;ng c&#7911;a ti&#7871;n tr</FONT>&igrave;nh hi&#7879;n h&agrave;nh, trong khi gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n s&#7869; cho phép ti&#7871;n tr</FONT>&igrave;nh hi&#7879;n h&agrave;nh ti&#7871;p t&#7909;c x&#7917; l&yacute;.</P>
<U><P ALIGN="JUSTIFY"><img border="0" src="images/more1.gif" width="14" height="14">V&iacute; d&#7909;&nbsp;:</U>   </P>
</blockquote>
</blockquote>
<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=316>
<TR><TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">Ti&#7871;n tr&igrave;nh</TD>
<TD WIDTH="38%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m v</FONT>&agrave;o RL</TD>
<TD WIDTH="32%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i gian x&#7917; l&yacute;</TD>
</TR>
<TR><TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="38%" VALIGN="TOP">
<P ALIGN="CENTER">0</TD>
<TD WIDTH="32%" VALIGN="TOP">
<P ALIGN="CENTER">6</TD>
</TR>
<TR><TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">P2</TD>
<TD WIDTH="38%" VALIGN="TOP">
<P ALIGN="CENTER">1</TD>
<TD WIDTH="32%" VALIGN="TOP">
<P ALIGN="CENTER">8</TD>
</TR>
<TR><TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">P3</TD>
<TD WIDTH="38%" VALIGN="TOP">
<P ALIGN="CENTER">2</TD>
<TD WIDTH="32%" VALIGN="TOP">
<P ALIGN="CENTER">4</TD>
</TR>
<TR><TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">P4</TD>
<TD WIDTH="38%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
<TD WIDTH="32%" VALIGN="TOP">
<P ALIGN="CENTER">2</TD>
</TR>
</TABLE>
</CENTER>
<blockquote>
<blockquote>

<P ALIGN="JUSTIFY">S&#7917; d&#7909;ng thu&#7853;t gi&#7843;i SJF <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n, th&#7913; t&#7921; c&#7845;p phát CPU nh</FONT>&#432; sau:</P>
</blockquote>

<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=302>
<TR><TD WIDTH="22%" VALIGN="TOP" HEIGHT=26>
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="22%" VALIGN="TOP" HEIGHT=26>
<P ALIGN="CENTER">P4</TD>
<TD WIDTH="25%" VALIGN="TOP" HEIGHT=26>
<P ALIGN="CENTER">P3</TD>
<TD WIDTH="31%" VALIGN="TOP" HEIGHT=26>
<P ALIGN="CENTER">P2</TD>
</TR>
<TR><TD WIDTH="22%" VALIGN="TOP" HEIGHT=20>
<FONT SIZE=2><P>0</FONT></TD>
<TD WIDTH="22%" VALIGN="TOP" HEIGHT=20>
<FONT SIZE=2><P>6</FONT></TD>
<TD WIDTH="25%" VALIGN="TOP" HEIGHT=20>
<FONT SIZE=2><P>8</FONT></TD>
<TD WIDTH="31%" VALIGN="TOP" HEIGHT=20>
<FONT SIZE=2><P>12                 20</FONT></TD>
</TR>
</TABLE>
</CENTER>
<blockquote>

<P ALIGN="JUSTIFY">S&#7917; d&#7909;ng thu&#7853;t gi&#7843;i SJF kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n, th&#7913; t&#7921; c&#7845;p phát CPU nh</FONT>&#432; sau:</P>
</blockquote>
<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=353>
<TR><TD WIDTH="17%" VALIGN="TOP" HEIGHT=26>
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="17%" VALIGN="TOP" HEIGHT=26>
<P ALIGN="CENTER">P4</TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=26>
<P ALIGN="CENTER">P1</TD>
<TD WIDTH="24%" VALIGN="TOP" HEIGHT=26>
<P ALIGN="CENTER">P3</TD>
<TD WIDTH="24%" VALIGN="TOP" HEIGHT=26>
<P ALIGN="CENTER">P2</TD>
</TR>
<TR><TD WIDTH="17%" VALIGN="TOP" HEIGHT=20>
<FONT SIZE=2><P>0</FONT></TD>
<TD WIDTH="17%" VALIGN="TOP" HEIGHT=20>
<FONT SIZE=2><P>3</FONT></TD>
<TD WIDTH="19%" VALIGN="TOP" HEIGHT=20>
<FONT SIZE=2><P>5</FONT></TD>
<TD WIDTH="24%" VALIGN="TOP" HEIGHT=20>
<FONT SIZE=2><P>8                 </FONT></TD>
<TD WIDTH="24%" VALIGN="TOP" HEIGHT=20>
<FONT SIZE=2><P>12              20</FONT></TD>
</TR>
</TABLE>
</CENTER>

<blockquote>
<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#7843;o lu&#7853;n</B>&nbsp;: Gi&#7843;i thu&#7853;t n&agrave;y cho ph&eacute;p <FONT FACE="Times New Roman">&#273;&#7841;t &#273;</FONT>&#432;&#7907;c th&#7901;i gian ch&#7901; trung b&igrave;nh c&#7921;c ti&#7875;u. Kh&oacute; kh<FONT FACE="Times New Roman">&#259;n th&#7921;c s&#7921; c&#7911;a gi&#7843;i thu&#7853;t SJF l</FONT>&agrave; kh&ocirc;ng th&#7875; bi&#7871;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7901;i gian y&ecirc;u c&#7847;u x&#7917; l&yacute; c&ograve;n l&#7841;i c&#7911;a ti&#7871;n tr&igrave;nh&nbsp;? Ch&#7881; c&oacute; th&#7875; d&#7921; <FONT FACE="Times New Roman">&#273;oán giá tr&#7883; n</FONT>&agrave;y theo c&aacute;ch ti&#7871;p c&#7853;n sau&nbsp;: g&#7885;i <I>tn</I> l&agrave; <FONT FACE="Times New Roman">&#273;&#7897; d</FONT>&agrave;i c&#7911;a th&#7901;i gian x&#7917; l&yacute; l&#7847;n th&#7913; <I>n,</I> <FONT FACE="Symbol">&#116;</FONT>
<I><SUB>n+1</I></SUB> l&agrave; gi&aacute; tr&#7883; d&#7921; <FONT FACE="Times New Roman">&#273;oán cho l&#7847;n x&#7917; lý ti&#7871;p theo. V&#7899;i hy v&#7885;ng giá tr&#7883; d&#7921; &#273;oán s&#7869; g&#7847;n gi&#7889;ng v&#7899;i các giá tr&#7883; tr</FONT>&#432;&#7899;c <FONT FACE="Times New Roman">&#273;ó, có th&#7875; s&#7917; d&#7909;ng công th&#7913;c:</P>
</FONT><P ALIGN="CENTER"><FONT FACE="Symbol">&#116;</FONT>
<SUB>n+1 = </SUB> <FONT FACE="Symbol">&#97;</FONT>
 tn<SUB> + </SUB>(1-<FONT FACE="Symbol">&#97;</FONT>
)<FONT FACE="Symbol">&#116;</FONT>
 <SUB>n</P>
</SUB><P ALIGN="JUSTIFY">Trong c&ocirc;ng th&#7913;c n&agrave;y,tn ch&#7913;a <FONT FACE="Times New Roman">&#273;&#7921;ng thông tin g&#7847;n nh&#7845;t&nbsp;; <FONT FACE="Symbol">&#116;</FONT>
</FONT> <SUB>n</SUB> ch&#7913;a <FONT FACE="Times New Roman">&#273;&#7921;ng các thông tin quá kh&#7913;  &#273;</FONT>&#432;&#7907;c t&iacute;ch l&#361;y. Tham s&#7889;  <FONT FACE="Symbol">&#97;</FONT>
 ( 0 <FONT FACE="Symbol">&#163;</FONT>
 <FONT FACE="Symbol">&#97;</FONT>
 <FONT FACE="Symbol">&#163;</FONT>
 1) ki&#7875;m so&aacute;t tr&#7885;ng s&#7889; c&#7911;a hi&#7879;n t&#7841;i g&#7847;n hay qu&aacute; kh&#7913; &#7843;nh h&#432;&#7903;ng <FONT FACE="Times New Roman">&#273;&#7871;n công th&#7913;c d&#7921; &#273;ón.</P>
</FONT><B><I></blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
II.3.5. Chi&#7871;n l&#432;&#7907;c <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i v&#7899;i nhi&#7873;u m&#7913;c &#273;&#7897; </FONT>&#432;u ti&ecirc;n</P>
</I></B>

<blockquote>
<B><P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18">Nguy&ecirc;n t&#7855;c</B>&nbsp;: &Yacute; t&#432;&#7903;ng ch&iacute;nh c&#7911;a gi&#7843;i thu&#7853;t l&agrave; ph&acirc;n l&#7899;p c&aacute;c ti&#7871;n tr&igrave;nh t&ugrave;y theo <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n c&#7911;a ch&uacute;ng <FONT FACE="Times New Roman">&#273;&#7875; có cách th&#7913;c &#273;i&#7873;u ph&#7889;i thích h&#7907;p cho t&#7915;ng nhóm. Danh sách s&#7861;n s</FONT>&agrave;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&acirc;n t&aacute;ch th&agrave;nh c&aacute;c danh s&aacute;ch ri&ecirc;ng bi&#7879;t theo c&#7845;p <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n, m&#7895;i danh s&aacute;ch bao g&#7891;m c&aacute;c ti&#7871;n tr&igrave;nh c&oacute; c&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n v&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c &aacute;p d&#7909;ng m&#7897;t gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i thích h&#7907;p &#273;&#7875; &#273;i&#7873;u ph&#7889;i. Ngo</FONT>&agrave;i ra, c&ograve;n c&oacute; m&#7897;t gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i gi&#7919;a các nhóm, th</FONT>&#432;&#7901;ng gi&#7843;i thu&#7853;t n&agrave;y l&agrave; gi&#7843;i thu&#7853;t kh&ocirc;ng <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n v</FONT>&agrave; s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n c&#7889; <FONT FACE="Times New Roman">&#273;&#7883;nh.M&#7897;t ti&#7871;n tr</FONT>&igrave;nh thu&#7897;c v&#7873; danh s&aacute;ch &#7903; c&#7845;p &#432;u ti&ecirc;n <I>i</I> s&#7869; ch&#7881; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t CPU khi c&aacute;c danh s&aacute;ch &#7903; c&#7845;p &#432;u ti&ecirc;n l&#7899;n h&#417;n <I>i</I> <FONT FACE="Times New Roman">&#273;</FONT>&atilde; tr&#7889;ng.</P></blockquote>

</blockquote>

<B><P ALIGN="CENTER"><img border="0" src="images/hinh2.14.jpg" width="430" height="200"></P><P ALIGN="CENTER">H&igrave;nh 2.14</B>  <FONT FACE="Times New Roman">&#272;i&#7873;u ph&#7889;i nhi&#7873;u c&#7845;p </FONT>&#432;u ti&ecirc;n</P><blockquote>

<B>
<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#7843;o lu&#7853;n</B>&nbsp;: Th&ocirc;ng th&#432;&#7901;ng, m&#7897;t ti&#7871;n tr&igrave;nh s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&aacute;n v&#297;nh vi&#7877;n v&#7899;i
  m&#7897;t danh s&aacute;ch &#7903; c&#7845;p &#432;u ti&ecirc;n <I>i</I> khi n&oacute; &#273;&#432;&#7907;c &#273;&#432;a v&agrave;o h&#7879; th&#7889;ng. C&aacute;c ti&#7871;n tr&igrave;nh kh&ocirc;ng di chuy&#7875;n gi&#7919;a c&aacute;c danh s&aacute;ch. C&aacute;ch t&#7893; ch&#7913;c n&agrave;y s&#7869; l&agrave;m gi&#7843;m chi ph&iacute; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i, nh</FONT>&#432;ng l&#7841;i thi&#7871;u linh <FONT FACE="Times New Roman">&#273;&#7897;ng v</FONT>&agrave; c&oacute; th&#7875; d&#7851;n <FONT FACE="Times New Roman">&#273;&#7871;n t</FONT>&igrave;nh tr&#7841;ng ‘<FONT FACE="Times New Roman">&#273;ói CPU’ cho các ti&#7871;n tr</FONT>&igrave;nh thu&#7897;c v&#7873; nh&#7919;ng danh s&aacute;ch c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n th&#7845;p. Do v&#7853;y c&oacute; th&#7875; x&acirc;y d&#7921;ng gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i nhi&#7873;u c&#7845;p </FONT>&#432;u ti&ecirc;n v&agrave; xoay v&ograve;ng. Gi&#7843;i thu&#7853;t n&agrave;y s&#7869; chuy&#7875;n d&#7847;n m&#7897;t ti&#7871;n tr&igrave;nh t&#7915; danh s&aacute;ch c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n cao xu&#7889;ng danh s&aacute;ch c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n th&#7845;p h&#417;n sau m&#7895;i l&#7847;n s&#7917; d&#7909;ng CPU. C&#361;ng v&#7853;y, m&#7897;t ti&#7871;n tr&igrave;nh ch&#7901; qu&aacute; l&acirc;u trong c&aacute;c danh s&aacute;ch c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n th&#7845;p c&#361;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chuy&#7875;n d&#7847;n l&ecirc;n c&aacute;c danh s&aacute;ch c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n cao h&#417;n. Khi x&acirc;y d&#7921;ng m&#7897;t gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i nhi&#7873;u c&#7845;p </FONT>&#432;u ti&ecirc;n v&agrave; xoay v&ograve;ng c&#7847;n quy&#7871;t&#273;&#7883;nh các tham s&#7889; : </P>
<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">S&#7889; l&#432;&#7907;ng c&aacute;c c&#7845;p &#432;u ti&ecirc;n</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">Gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i cho t&#7915;ng danh sách &#7913;ng v&#7899;i m&#7897;t c&#7845;p </FONT>&#432;u ti&ecirc;n.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">Ph&#432;&#417;ng ph&aacute;p x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh th&#7901;i &#273;i&#7875;m di chuy&#7875;n m&#7897;t ti&#7871;n tr</FONT>&igrave;nh l&ecirc;n danh s&aacute;ch c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n cao h&#417;n.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">Ph&#432;&#417;ng ph&aacute;p x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh th&#7901;i &#273;i&#7875;m di chuy&#7875;n m&#7897;t ti&#7871;n tr</FONT>&igrave;nh l&ecirc;n danh s&aacute;ch c&oacute; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n th&#7845;p h&#417;n.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">Ph&#432;&#417;ng ph&aacute;p s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7875; xác &#273;&#7883;nh m&#7897;t ti&#7871;n tr</FONT>&igrave;nh m&#7899;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o h&#7879; th&#7889;ng s&#7869; thu&#7897;c danh s&aacute;ch &#7913;ng v&#7899;i <FONT FACE="Times New Roman">&#273;&#7897; ti</FONT>&ecirc;n n&agrave;o.</P>
</blockquote>
</blockquote>
</blockquote>

<B><P ALIGN="CENTER"><img border="0" src="images/hinh2.15.jpg" width="353" height="323"></P>
<P ALIGN="CENTER">H&igrave;nh  2.15 </B> <FONT FACE="Times New Roman">&#272;i&#7873;u ph&#7889;i Multilevel Feedback</P>
</FONT><P ALIGN="JUSTIFY"></P>
<blockquote>

<B><I><P ALIGN="JUSTIFY"><img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
II.3.6. Chi&#7871;n l&#432;&#7907;c <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i X&#7893; s&#7889; (Lottery)</P>

</I></FONT>
<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/bulletjock.gif" width="18" height="18">Nguy&ecirc;n t&#7855;c</B>&nbsp;: &Yacute; t&#432;&#7903;ng ch&iacute;nh c&#7911;a gi&#7843;i thu&#7853;t l&agrave; ph&aacute;t h&agrave;nh m&#7897;t s&#7889; v&eacute; s&#7889; v&agrave; ph&acirc;n ph&#7889;i cho c&aacute;c ti&#7871;n tr&igrave;nh trong h&#7879; th&#7889;ng. Khi <FONT FACE="Times New Roman">&#273;&#7871;n th&#7901;i &#273;i&#7875;m ra quy&#7871;t &#273;&#7883;nh &#273;i&#7873;u ph&#7889;i, s&#7869; ti&#7871;n h</FONT>&agrave;nh ch&#7885;n 1 v&eacute; &quot;tr&uacute;ng gi&#7843;i&quot;, ti&#7871;n tr&igrave;nh n&agrave;o s&#7905; h&#7919;u v&eacute; n&agrave;y s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c nh&#7853;n CPU</P>
</blockquote>
</blockquote>

<blockquote>

<blockquote>

<P ALIGN="JUSTIFY">
<B><img border="0" src="images/bulletjock.gif" width="18" height="18">Th&#7843;o lu&#7853;n</B>&nbsp;:
Gi&#7843;i thu&#7853;t Lottery cung c&#7845;p m&#7897;t gi&#7843;i ph&aacute;p <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n nh&#432;ng b&#7843;o <FONT FACE="Times New Roman">&#273;&#7843;m tính công b&#7857;ng cho thu&#7853;t toán &#273;i&#7873;u ph&#7889;i v&#7899;i chi phí th&#7845;p &#273;&#7875; c&#7853;p nh&#7853;t &#273;&#7897; </FONT>&#432;u ti&ecirc;n cho c&aacute;c ti&#7871;n tr&igrave;nh : </P>
</blockquote>
</blockquote>

<B><P ALIGN="JUSTIFY" class="cap1"><a name="tomtat">III. T&oacute;m t&#7855;t</a> </P><blockquote>
<blockquote>

</B><P><img border="0" src="images/rightarrow.gif" width="6" height="12">Trong su&#7889;t chu tr&igrave;nh s&#7889;ng, ti&#7871;n tr&igrave;nh chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i qua l&#7841;i gi&#7919;a các tr&#7841;ng thái ready, running v</FONT>&agrave; blocked.</P>
<P><img border="0" src="images/rightarrow.gif" width="6" height="12">B&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i c&#7911;a h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh ch&#7883;u tr&aacute;ch nhi&#7879;m &aacute;p d&#7909;ng m&#7897;t g&#7881;ai thu&#7853;t <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i thích h&#7907;p &#273;&#7875; ch&#7885;n ti&#7871;n tr</FONT>&igrave;nh th&iacute;ch h&#7907;p <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng CPU, v&agrave; b&#7897; ph&acirc;n ph&#7889;i s&#7869; chuy&#7875;n giao CPU cho ti&#7871;n tr&igrave;nh n&agrave;y.</P>
<P><img border="0" src="images/rightarrow.gif" width="6" height="12">C&aacute;c gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i thông d&#7909;ng&nbsp;: FIFO, RoundRobin, &#273;i&#7873;u ph&#7889;i v&#7899;i &#273;&#7897; </FONT>&#432;u ti&ecirc;n, SJF, Multilevel Feedback</P></blockquote>
</blockquote>

<P ALIGN="JUSTIFY"><a name="cauhoi"><img border="0" src="images/blebul1a.gif" width="20" height="20">
 <b><font color="#FF0000" face="Times New Roman" size="4">Câu h&#7887;i c&#361;ng c&#7889;
 bài h&#7885;c</font></b></a></P>
<P>&nbsp;&nbsp;&nbsp; &nbsp;&nbsp; C&aacute;c c&acirc;u h&#7887;i c&#7847;n tr&#7843; l&#7901;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c sau b&agrave;i h&#7885;c n&agrave;y :</P><blockquote>
<blockquote>

<P>1. Th&ocirc;ng tin l&#432;u tr&#7919; trong PCB v&agrave; TCB ? </P>
<P>2. T&#7893; ch&#7913;c <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i ti&#7871;n tr</FONT>&igrave;nh ?</P>
<P>3. Ph&acirc;n t&iacute;ch &#432;u, khuy&#7871;t c&#7911;a c&aacute;c chi&#7871;n l&#432;&#7907;c <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i </P></blockquote>
</blockquote>

</FONT><P ALIGN="JUSTIFY"><a name="baitap"><img border="0" src="images/blebul1a.gif" width="20" height="20">
 <b><font color="#FF0000" face="Times New Roman" size="4">Bài t&#7853;p</font></b></a></P>
<blockquote>

<P><b><img border="0" src="images/help.gif" width="16" height="16"> Bài 1.</b> X&eacute;t t&#7853;p c&aacute;c ti&#7871;n tr&igrave;nh sau (v&#7899;i th&#7901;i gian y&ecirc;u c&#7847;u CPU v&agrave; <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n k&egrave;m theo) :</P></blockquote>

<CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=7 WIDTH=442>
<TR><TD WIDTH="24%" VALIGN="TOP">
<P ALIGN="CENTER">Ti&#7871;n tr&igrave;nh</TD>
<TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m v</FONT>&agrave;o RL</TD>
<TD WIDTH="26%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i gian CPU</TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Times New Roman"><P ALIGN="CENTER">&#272;&#7897; </FONT>&#432;u ti&ecirc;n</TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="TOP">
<P ALIGN="CENTER">P<SUB>1</SUB></TD>
<TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">0</TD>
<TD WIDTH="26%" VALIGN="TOP">
<P ALIGN="CENTER">10</TD>
<TD WIDTH="20%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="TOP">
<P ALIGN="CENTER">P<SUB>2</SUB></TD>
<TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">1</TD>
<TD WIDTH="26%" VALIGN="TOP">
<P ALIGN="CENTER">1</TD>
<TD WIDTH="20%" VALIGN="TOP">
<P ALIGN="CENTER">1</TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="TOP">
<P ALIGN="CENTER">P<SUB>3</SUB></TD>
<TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">2</TD>
<TD WIDTH="26%" VALIGN="TOP">
<P ALIGN="CENTER">2</TD>
<TD WIDTH="20%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="TOP">
<P ALIGN="CENTER">P<SUB>4</SUB></TD>
<TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">3</TD>
<TD WIDTH="26%" VALIGN="TOP">
<P ALIGN="CENTER">1</TD>
<TD WIDTH="20%" VALIGN="TOP">
<P ALIGN="CENTER">4</TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="TOP">
<P ALIGN="CENTER">P<SUB>5</SUB></TD>
<TD WIDTH="30%" VALIGN="TOP">
<P ALIGN="CENTER">4</TD>
<TD WIDTH="26%" VALIGN="TOP">
<P ALIGN="CENTER">5</TD>
<TD WIDTH="20%" VALIGN="TOP">
<P ALIGN="CENTER">2</TD>
</TR>
</TABLE>
</CENTER>
<blockquote>
<blockquote>
<blockquote>

<P>Gi&#7843; s&#7917; c&aacute;c ti&#7871;n tr&igrave;nh c&ugrave;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o h&#7879; th&#7889;ng t&#7841;i th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m 0</P>
</FONT></blockquote>
<P>a)Cho bi&#7871;t k&#7871;t qu&#7843; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i ho&#7841;t &#273;&#7897;ng c&#7911;a các ti&#7871;n tr</FONT>&igrave;nh tr&ecirc;n theo thu&#7853;t to&aacute;n FIFO; SJF; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i theo &#273;&#7897; </FONT>&#432;u ti&ecirc;n <FONT FACE="Times New Roman">&#273;&#7897;c quy&#7873;n (&#273;&#7897; </FONT>&#432;u ti&ecirc;n 1 &gt; 2 &gt; ...); v&agrave; RR (quantum=2).</P>
<P>b)Cho bi&#7871;t th&#7901;i gian l&#432;u l&#7841;i trong h&#7879; th&#7889;ng (turnaround time) c&#7911;a t&#7915;ng ti&#7871;n tr&igrave;nh trong t&#7915;ng thu&#7853;t to&aacute;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i &#7903; câu a.</P>
</FONT><P>c)Cho bi&#7871;t th&#7901;i gian ch&#7901; trong h&#7879; th&#7889;ng (waiting time) c&#7911;a t&#7915;ng ti&#7871;n tr&igrave;nh trong t&#7915;ng thu&#7853;t to&aacute;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i &#7903; câu a.</P>
</FONT><P>d)Thu&#7853;t to&aacute;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i n</FONT>&agrave;o trong c&aacute;c thu&#7853;t to&aacute;n &#7903; c&acirc;u a cho th&#7901;i gian ch&#7901; trung b&igrave;nh l&agrave; c&#7921;c ti&#7875;u ?</P>
</blockquote>
<P><b><img border="0" src="images/help.gif" width="16" height="16"> Bài 2.</b> Gi&#7843; s&#7917; c&oacute; c&aacute;c ti&#7871;n tr&igrave;nh sau trong h&#7879; th&#7889;ng :</P>
</blockquote>

<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=7 WIDTH=434>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P ALIGN="CENTER">Ti&#7871;n tr&igrave;nh</TD>
<TD WIDTH="39%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m v</FONT>&agrave;o RL</TD>
<TD WIDTH="36%" VALIGN="TOP">
<P ALIGN="CENTER">Th&#7901;i gian CPU</TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P ALIGN="CENTER">P<SUB>1</SUB></TD>
<TD WIDTH="39%" VALIGN="TOP">
<P ALIGN="CENTER">0.0</TD>
<TD WIDTH="36%" VALIGN="TOP">
<P ALIGN="CENTER">8</TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P ALIGN="CENTER">P<SUB>2</SUB></TD>
<TD WIDTH="39%" VALIGN="TOP">
<P ALIGN="CENTER">0.4</TD>
<TD WIDTH="36%" VALIGN="TOP">
<P ALIGN="CENTER">4</TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P ALIGN="CENTER">P<SUB>3</SUB></TD>
<TD WIDTH="39%" VALIGN="TOP">
<P ALIGN="CENTER">1.0</TD>
<TD WIDTH="36%" VALIGN="TOP">
<P ALIGN="CENTER">1</TD>
</TR>
</TABLE>
</CENTER>
<FONT SIZE=3>
<blockquote>
  <P ALIGN="JUSTIFY">S&#7917; d&#7909;ng nguy&ecirc;n t&#7855;c </FONT><FONT FACE="Times New Roman" SIZE=3>&#273;i&#7873;u ph&#7889;i &#273;&#7897;c quy&#7873;n v</FONT><FONT SIZE=3>&agrave; c&aacute;c th&ocirc;ng tin c&oacute; </FONT><FONT FACE="Times New Roman" SIZE=3>&#273;</FONT><FONT SIZE=3>&#432;&#7907;c t&#7841;i th&#7901;i </FONT><FONT FACE="Times New Roman" SIZE=3>&#273;i&#7875;m ra quy&#7871;t &#273;&#7883;nh &#273;&#7875; tr&#7843; l&#7901;i các câu h&#7887;i sau &#273;ây :</P>
</FONT>
<blockquote>
  <P>a)Cho bi&#7871;t th&#7901;i gian l&#432;u l&#7841;i trung b&igrave;nh trong h&#7879; th&#7889;ng (turnaround time) c&#7911;a c&aacute;c ti&#7871;n tr&igrave;nh trong thu&#7853;t to&aacute;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i FIFO.</P>
</FONT><P>b)Cho bi&#7871;t th&#7901;i gian l&#432;u l&#7841;i trung b&igrave;nh trong h&#7879; th&#7889;ng (turnaround time) c&#7911;a c&aacute;c ti&#7871;n tr&igrave;nh trong thu&#7853;t to&aacute;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i SJF.</P>
</FONT><P>   c)Thu&#7853;t to&aacute;n SJF d&#7921; <FONT FACE="Times New Roman">&#273;&#7883;nh c&#7843;i ti&#7871;n s&#7921; th&#7921;c hi&#7879;n c&#7911;a h&#7879; th&#7889;ng , nh</FONT>&#432;ng l&#432;u &yacute; ch&uacute;ng  ta ph&#7843;i ch&#7885;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i P</FONT><SUB>1</SUB>  t&#7841;i th&#7901;i <FONT FACE="Times New Roman">&#273;i&#7875;m 0 v</FONT>&igrave; kh&ocirc;ng bi&#7871;t r&#7857;ng s&#7869; c&oacute; hai ti&#7871;n tr&igrave;nh ng&#7855;n h&#417;n v&agrave;o h&#7879; th&#7889;ng sau <FONT FACE="Times New Roman">&#273;ó . Th&#7917; tính th&#7901;i gian l</FONT>&#432;u l&#7841;i trung b&igrave;nh trong &#7879; th&#7889;ng n&#7871;u <FONT FACE="Times New Roman">&#273;&#7875; CPU nh</FONT>&agrave;n r&#7895;i trong 1 <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; th&#7901;i gian <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n v&agrave; sau <FONT FACE="Times New Roman">&#273;ó s&#7917; d&#7909;ng SJF &#273;&#7875; &#273;i&#7873;u ph&#7889;i. L</FONT>&#432;u &yacute; P<SUB>1 </SUB>v&agrave;<SUB> </SUB>P<SUB>2</SUB> s&#7869; ph&#7843;i ch&#7901; trong su&#7889;t th&#7901;i gian nh&agrave;n r&#7895;i n&agrave;y, do v&#7853;y th&#7901;i gian ch&#7901; c&#7911;a ch&uacute;ng t<FONT FACE="Times New Roman">&#259;ng l</FONT>&ecirc;n. Thu&#7853;t to&aacute;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i n</FONT>&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c bi&#7871;t <FONT FACE="Times New Roman">&#273;&#7871;n nh</FONT>&#432; <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i d&#7921;a tr</FONT>&ecirc;n th&ocirc;ng tin v&#7873; t&#432;&#417;ng lai.</P>
</blockquote>
<P><b><img border="0" src="images/help.gif" width="16" height="16"> Bài 3.</b> Ph&acirc;n bi&#7879;t  s&#7921; kh&aacute;c nhau trong c&aacute;ch ti&#7871;p c&#7853;n <FONT FACE="Times New Roman">&#273;&#7875; </FONT>&#432;u ti&ecirc;n cho ti&#7871;n tr&igrave;nh ng&#7855;n trong c&aacute;c thu&#7853;t to&aacute;n <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i sau :</P>
</FONT>
<blockquote>
  <P>a) FIFO.</P>
<P>b)RR</P>
<FONT FACE="Times New Roman"><P>c)&#272;i&#7873;u ph&#7889;i v&#7899;i &#273;&#7897; </FONT>&#432;u ti&ecirc;n <FONT FACE="Times New Roman">&#273;a c&#7845;p</P>
  </blockquote>
</FONT><P ALIGN="JUSTIFY"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 4.</b> Cho bi&#7871;t hai &#432;u <FONT FACE="Times New Roman">&#273;i&#7875;m chính c&#7911;a mô h</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;a ti&#7875;u tr</FONT>&igrave;nh so v&#7899;i <FONT FACE="Times New Roman">&#273;a ti&#7871;n tr</FONT>&igrave;nh. M&ocirc; t&#7843; m&#7897;t &#7913;ng d&#7909;ng th&iacute;ch h&#7907;p v&#7899; m&ocirc; h&igrave;nh <FONT FACE="Times New Roman">&#273;a ti&#7875;u tr</FONT>&igrave;nh v&agrave; m&#7897;t &#7913;ng d&#7909;ng kh&aacute;c kh&ocirc;ng th&iacute;ch h&#7907;p.</P>
<P ALIGN="JUSTIFY"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 5.</b> M&ocirc; t&#7843; c&aacute;c x&#7917; l&yacute; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ph&#7843;i th&#7921;c hi&#7879;n khi chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i ng&#7919; c&#7843;nh gi&#7919;a :</P>
</FONT>
<blockquote>
  <P>a)c&aacute;c ti&#7871;n tr&igrave;nh</P>
<P>b)c&aacute;c ti&#7875;u tr&igrave;nh</P>
</blockquote>
<P ALIGN="JUSTIFY"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 6.</b> X&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh th&#7901;i l</FONT>&#432;&#7907;ng quantum <I>q</I> l&agrave; m&#7897;t nhi&#7879;m v&#7909; kh&oacute; kh<FONT FACE="Times New Roman">&#259;n. Gi&#7843; s&#7917; chi phí trung b</FONT>&igrave;nh cho m&#7897;t l&#7847;n chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i ng&#7919; c&#7843;nh l</FONT>&agrave; <I>s</I>, v&agrave; th&#7901;i gian trung b&igrave;nh m&#7897;t ti&#7871;n tr&igrave;nh h&#432;&#7899;ng nh&#7853;p xu&#7845;t s&#7917; d&#7909;ng CPU tr&#432;&#7899;c khi ph&aacute;t sinh m&#7897;t y&ecirc;u c&#7847;u nh&#7853;p xu&#7845;t l&agrave; <I>t ( t&gt;&gt;s)</I>. Th&#7843;o lu&#7853;n c&aacute;c t&aacute;c <FONT FACE="Times New Roman">&#273;&#7897;ng &#273;&#7871;n s&#7921; th&#7921;c hi&#7879;n c&#7911;a h&#7879; th&#7889;ng khi ch&#7885;n </FONT><I>q</I> theo c&aacute;c quy t&#7855;c sau :</P><blockquote>
<blockquote>

<P>a)q  b&#7845;t <FONT FACE="Times New Roman">&#273;&#7883;nh </P>
</FONT><P>b)q l&#7899;n h&#417;n 0 1 &iacute;t</P>
<P>c)q = s</P>
<P>d)s &lt; q &lt; t</P>
<P>e)q = t</P>
<P>f)q &gt; t</P>
</blockquote>
</blockquote>

<P ALIGN="JUSTIFY"><b><img border="0" src="images/help.gif" width="16" height="16">
Bài 7.</b> Gi&#7843; s&#7917; m&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh &aacute;p d&#7909;ng gi&#7843;i thu&#7853;t <FONT FACE="Times New Roman">&#273;i&#7873;u ph&#7889;i multilevel feedback v&#7899;i 5 m&#7913;c </FONT>&#432;u ti&ecirc;n (gi&#7843;m d&#7847;n). Th&#7901;i l&#432;&#7907;ng quantum d&agrave;nh cho h&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i c&#7845;p 1 l</FONT>&agrave; 0,5s. M&#7895;i h&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i c&#7845;p th&#7845;p h</FONT>&#417;n s&#7869; c&oacute; th&#7901;i l&#432;&#7907;ng quantum d&agrave;i g&#7845;p <FONT FACE="Times New Roman">&#273;ôi h</FONT>&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i &#7913;ng v&#7899;i m&#7913;c </FONT>&#432;u ti&ecirc;n cao h&#417;n n&oacute;. M&#7897;t ti&#7871;n tr&igrave;nh khi v&agrave;o h&#7879; th&#7889;ng s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o h&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i m&#7913;c cao nh&#7845;t, v</FONT>&agrave; chuy&#7875;n d&#7847;n xu&#7889;ng c&aacute;c h&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i b</FONT>&ecirc;n d&#432;&#7899;i sau m&#7895;i l&#432;&#7907;t s&#7917; d&#7909;ng CPU. M&#7897;t ti&#7871;n tr&igrave;nh ch&#7881; c&oacute; th&#7875; b&#7883; thu h&#7891;i CPU khi <FONT FACE="Times New Roman">&#273;</FONT>&atilde; s&#7917; d&#7909;ng h&#7871;t th&#7901;i l&#432;&#7907;ng quantum d&agrave;nh cho n&oacute;. H&#7879; th&#7889;ng c&oacute; th&#7875; th&#7921;c hi&#7879;n c&aacute;c t&aacute;c v&#7909; x&#7917; l&yacute; theo l&ocirc; ho&#7863;c t&#432;&#417;ng t&aacute;c, v&agrave; m&#7895;i t&aacute;c v&#7909; l&#7841;i c&oacute; th&#7875; h&#432;&#7899;ng x&#7917; l&yacute; hay h&#432;&#7899;ng nh&#7853;p xu&#7845;t.</P><blockquote>
<blockquote>

<P>a)Gi&#7843;i th&iacute;ch  t&#7841;i sao h&#7879; th&#7889;ng n&agrave;y ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng không hi&#7879;u qu&#7843;&nbsp;?</P>
</FONT><P>b)C&#7847;n ph&#7843;i thay <FONT FACE="Times New Roman">&#273;&#7893;i (t&#7889;i thi&#7875;u) nh</FONT>&#432; th&#7871; n&agrave;o <FONT FACE="Times New Roman">&#273;&#7875; h&#7879; th&#7889;ng &#273;i&#7873;u ph&#7889;i các tác v&#7909; v&#7899;i nh&#7919;ng b&#7843;n ch&#7845;t khác bi&#7879;t nh</FONT>&#432; th&#7871; t&#7889;t h&#417;n&nbsp;?</P>
</blockquote>
</blockquote>
</blockquote>
</BODY>
</HTML>
