<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<LINK REL="stylesheet" TYPE="text/css" HREF="style.css" TITLE="MTD">
<TITLE>Khai niem ve He dieu hanh</TITLE>
</HEAD>
<BODY LINK="#0000ff">
<STRONG><P align="center"><font face="Verdana" size="2">BÀI 1 </font>
<FONT SIZE=5><font face="Verdana">T&#7892;NG QUAN V&#7872; H&#7878;
&#272;I&#7872;U HÀNH</font> </P>
 </FONT>
</STRONG> 
<EM><P ALIGN="JUSTIFY">B&agrave;i h&#7885;c n&agrave;y cung c&#7845;p cho ch&uacute;ng ta m&#7897;t c&aacute;i nh&igrave;n t&#7893;ng qu&aacute;t v&#7873; nh&#7919;ng nguy&ecirc;n l&yacute; c&#417; b&#7843;n c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh. Ch&uacute;ng ta b&#7855;t <FONT FACE="Times New Roman">&#273;&#7847;u v&#7899;i vi&#7879;c xem xét m&#7909;c ti</FONT>&ecirc;u v&agrave; c&aacute;c ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a h&#7879; &#273;i&#7873;u n</FONT>&agrave;y, sau <FONT FACE="Times New Roman">&#273;ó kh&#7843;o sát các d&#7841;ng khác nhau c&#7911;a chúng c&#361;ng nh</FONT>&#432; xem x&eacute;t qu&aacute; tr&igrave;nh ph&aacute;t tri&#7875;n qua t&#7915;ng giai <FONT FACE="Times New Roman">&#273;o&#7841;n. Các ph&#7847;n n</FONT>&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c tr&igrave;nh b&agrave;y th&ocirc;ng qua c&aacute;c n&#7897;i dung nh&#432; sau: </P>

</EM>
<blockquote>
  <blockquote>
    <P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#khainiem">Khái
    ni&#7879;m v&#7873; h&#7879; &#273;i&#7873;u hành</a></P>
    <P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#phanloai">Phân
    lo&#7841;i h&#7879; &#273;i&#7873;u hành</a></P>
    <P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="Bai012.htm#cautruc">C&#7845;u
    trúc c&#7911;a h&#7879; &#273;i&#7873;u hành</a></P>
    <P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="Bai013.htm">L&#7883;ch
    s&#7917; phát tri&#7875;n c&#7911;a h&#7879; &#273;i&#7873;u hành</a></P>
  </blockquote>
</blockquote>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp; B&agrave;i h&#7885;c n&agrave;y gi&uacute;p ch&uacute;ng ta hi&#7875;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&agrave; g&igrave;, c&oacute; c&#7845;u tr&uacute;c ra sao. H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&acirc;n lo&#7841;i theo nh&#7919;ng ti&ecirc;u chu&#7849;n n&agrave;o. Qu&aacute; tr&igrave;nh ph&aacute;t tri&#7875;n c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ph&#7909; thu&#7897;c v&agrave;o nh&#7919;ng y&#7871;u t&#7889; n&agrave;o.</P>
<P>B&agrave;i h&#7885;c n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&ograve;i h&#7887;i nh&#7919;ng ki&#7871;n th&#7913;c v&#7873; : ki&#7871;n tr&uacute;c m&aacute;y t&iacute;nh. </P>

<P align="center"><img border="0" src="images/dotlineback.gif" width="470" height="10"> </P>

<P align="center">&nbsp; </P>

<B><P ALIGN="JUSTIFY" class="cap1"><a name="khainiem">I.KHÁI NI&#7878;M V&#7872; H&#7878; &#272;I&#7872;U
HÀNH</a></P>
<I><P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh</I> </B> l&agrave; m&#7897;t <I>ch&#432;&#417;ng tr&igrave;nh</I> hay m&#7897;t <I>h&#7879; ch&#432;&#417;ng tr&igrave;nh</I> ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng gi&#7919;a ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng (user) v&agrave; ph&#7847;n c&#7913;ng c&#7911;a m&aacute;y t&iacute;nh. M&#7909;c ti&ecirc;u c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&agrave; cung c&#7845;p m&#7897;t m&ocirc;i tr&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;&#7875; ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng c&oacute; th&#7875; thi h&agrave;nh c&aacute;c ch&#432;&#417;ng tr&igrave;nh. N&oacute; l&agrave;m cho m&aacute;y t&iacute;nh d&#7875; s&#7917; d&#7909;ng h&#417;n, thu&#7853;n l&#7907;i h&#417;n v&agrave; hi&#7879;u qu&#7843; h&#417;n.&nbsp;</P>
<P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&agrave; m&#7897;t ph&#7847;n quan tr&#7885;ng c&#7911;a h&#7847;u h&#7871;t c&aacute;c h&#7879; th&#7889;ng m&aacute;y t&iacute;nh. M&#7897;t h&#7879; th&#7889;ng m&aacute;y t&iacute;nh th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia l&agrave;m b&#7889;n ph&#7847;n ch&iacute;nh : ph&#7847;n c&#7913;ng, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh, c&aacute;c ch&#432;&#417;ng tr&igrave;nh &#7913;ng d&#7909;ng v&agrave; ng&#432;&#7901;i s&#7917; d&#7909;ng.&nbsp; </P>
<B><I><P ALIGN="JUSTIFY">Ph&#7847;n c&#7913;ng</B></I> bao g&#7891;m CPU, b&#7897; nh&#7899;, c&aacute;c thi&#7871;t b&#7883; nh&#7853;p xu&#7845;t, <FONT FACE="Times New Roman">&#273;ây l</FONT>&agrave; nh&#7919;ng t&agrave;i nguy&ecirc;n c&#7911;a m&aacute;y t&iacute;nh. <B><I>Ch&#432;&#417;ng tr&igrave;nh &#7913;ng d&#7909;ng</B></I> nh&#432; c&aacute;c ch&#432;&#417;ng tr&igrave;nh d&#7883;ch, h&#7879; th&#7889;ng c&#417; s&#7903; d&#7919; li&#7879;u, c&aacute;c tr&ograve; ch&#417;i, v&agrave; c&aacute;c ch&#432;&#417;ng tr&igrave;nh th&#432;&#417;ng m&#7841;i. C&aacute;c ch&#432;&#417;ng tr&igrave;nh n&agrave;y s&#7917; d&#7909;ng t&agrave;i nguy&ecirc;n c&#7911;a m&aacute;y t&iacute;nh <FONT FACE="Times New Roman">&#273;&#7875; gi&#7843;i quy&#7871;t các y</FONT>&ecirc;u c&#7847;u c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng. <B><I>H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh</B></I> <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n v</FONT>&agrave; ph&#7889;i h&#7907;p vi&#7879;c s&#7917; d&#7909;ng ph&#7847;n c&#7913;ng cho nh&#7919;ng &#7913;ng d&#7909;ng kh&aacute;c nhau c&#7911;a nhi&#7873;u ng&#432;&#7901;i s&#7917; d&#7909;ng kh&aacute;c nhau. H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh cung c&#7845;p m&#7897;t m&ocirc;i tr&#432;&#7901;ng m&agrave; c&aacute;c ch&#432;&#417;ng tr&igrave;nh c&oacute; th&#7875; l&agrave;m vi&#7879;c h&#7919;u hi&#7879;u tr&ecirc;n <FONT FACE="Times New Roman">&#273;ó.
</FONT>
</P>
<P ALIGN="center"><img border="0" src="images/hinh1.1.gif" width="387" height="288"></P>
<P ALIGN="center"><b>H&igrave;nh 1.1 </b>Mô hình tr&#7915;u t&#432;&#7907;ng c&#7911;a h&#7879; th&#7889;ng
máy tính</P>
<P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c coi nh&#432; l&agrave; b&#7897; ph&acirc;n ph&#7889;i t&agrave;i nguy&ecirc;n c&#7911;a m&aacute;y t&iacute;nh. Nhi&#7873;u t&agrave;i nguy&ecirc;n c&#7911;a m&aacute;y t&iacute;nh nh&#432; th&#7901;i gian s&#7917; d&#7909;ng CPU, v&ugrave;ng b&#7897; nh&#7899;, v&ugrave;ng l&#432;u tr&#7919; t&#7853;p tin, thi&#7871;t b&#7883; nh&#7853;p xu&#7845;t v.v… <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&aacute;c ch&#432;&#417;ng tr&igrave;nh y&ecirc;u c&#7847;u <FONT FACE="Times New Roman">&#273;&#7875; gi&#7843;i quy&#7871;t v&#7845;n &#273;&#7873;. H&#7879; &#273;i&#7873;u h</FONT>&agrave;nh ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng nh</FONT>&#432; m&#7897;t b&#7897; qu&#7843;n l&yacute; c&aacute;c t&agrave;i nguy&ecirc;n v&agrave; ph&acirc;n ph&#7889;i ch&uacute;ng cho c&aacute;c ch&#432;&#417;ng tr&igrave;nh v&agrave; ng&#432;&#7901;i s&#7917; d&#7909;ng khi c&#7847;n thi&#7871;t. Do c&oacute; r&#7845;t nhi&#7873;u y&ecirc;u c&#7847;u, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ph&#7843;i gi&#7843;i quy&#7871;t v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; tranh ch&#7845;p v</FONT>&agrave; ph&#7843;i quy&#7871;t <FONT FACE="Times New Roman">&#273;&#7883;nh </FONT><B><I>c&#7845;p ph&aacute;t t&agrave;i nguy&ecirc;n</B></I> cho nh&#7919;ng y&ecirc;u c&#7847;u theo th&#7913; t&#7921; n&agrave;o <FONT FACE="Times New Roman">&#273;&#7875; ho&#7841;t &#273;&#7897;ng c&#7911;a máy tính l</FONT>&agrave; hi&#7879;u qu&#7843; nh&#7845;t. M&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#361;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c coi nh&#432; l&agrave; m&#7897;t ch&#432;&#417;ng tr&igrave;nh ki&#7875;m so&aacute;t vi&#7879;c s&#7917; d&#7909;ng m&aacute;y t&iacute;nh, <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t l</FONT>&agrave; c&aacute;c thi&#7871;t b&#7883; nh&#7853;p xu&#7845;t.</P>
<P ALIGN="JUSTIFY">Tuy nhi&ecirc;n, nh&igrave;n chung ch&#432;a c&oacute; <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a n</FONT>&agrave;o l&agrave; ho&agrave;n h&#7843;o v&#7873; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh. H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh t&#7891;n t&#7841;i <FONT FACE="Times New Roman">&#273;&#7875; gi&#7843;i quy&#7871;t các v&#7845;n &#273;&#7873; s&#7917; d&#7909;ng h&#7879; th&#7889;ng máy tính. M&#7909;c ti</FONT>&ecirc;u c&#417; b&#7843;n c&#7911;a n&oacute; l&agrave; gi&uacute;p cho vi&#7879;c thi h&agrave;nh c&aacute;c ch&#432;&#417;ng tr&igrave;nh d&#7877; d&agrave;ng h&#417;n. M&#7909;c ti&ecirc;u th&#7913; hai l&agrave; h&#7895; tr&#7907; cho c&aacute;c thao t&aacute;c tr&ecirc;n h&#7879; th&#7889;ng m&aacute;y t&iacute;nh hi&#7879;u qu&#7843; h&#417;n. M&#7909;c ti&ecirc;u n&agrave;y <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t quan tr&#7885;ng trong nh&#7919;ng h&#7879; th&#7889;ng nhi&#7873;u ng</FONT>&#432;&#7901;i d&ugrave;ng v&agrave; trong nh&#7919;ng h&#7879; th&#7889;ng l&#7899;n(ph&#7847;n c&#7913;ng + quy m&ocirc; s&#7917; d&#7909;ng). Tuy nhi&ecirc;n hai m&#7909;c ti&ecirc;u n&agrave;y c&#361;ng c&oacute; ph&#7847;n t&#432;&#417;ng ph&#7843;n v&igrave; v&#7853;y l&yacute; thuy&#7871;t v&#7873; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh t&#7853;p trung v&agrave;o vi&#7879;c t&#7889;i &#432;u h&oacute;a vi&#7879;c s&#7917; d&#7909;ng t&agrave;i nguy&ecirc;n c&#7911;a m&aacute;y t&iacute;nh.</P>

<P ALIGN="JUSTIFY">&nbsp;</P>

<STRONG><P ALIGN="JUSTIFY" class="cap1"><a name="phanloai">II.PH&Acirc;N LO&#7840;I H&#7878;
&#272;I&#7872;U HÀNH</a></P>
<FONT SIZE=4><P ALIGN="JUSTIFY" class="cap2"><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="theolo">II.1 H&#7879; th&#7889;ng x&#7917; l&yacute; theo l&ocirc;</a> </P></FONT></STRONG><B>
<blockquote>
  <P ALIGN="JUSTIFY"><I><img border="0" src="images/red.gif" width="7" height="10"></I>B&#7897; gi&aacute;m s&aacute;t th&#432;&#7901;ng tr&#7921;c&nbsp;:</P>
</B>
<blockquote>
<P ALIGN="JUSTIFY">Khi m&#7897;t c&ocirc;ng vi&#7879;c ch&#7845;m d&#7913;t, h&#7879; th&#7889;ng s&#7869; th&#7921;c hi&#7879;n c&ocirc;ng vi&#7879;c k&#7871; ti&#7871;p  m&agrave; kh&ocirc;ng c&#7847;n s&#7921; can thi&#7879;p c&#7911;a ng&#432;&#7901;i l&#7853;p tr&igrave;nh, do <FONT FACE="Times New Roman">&#273;ó th&#7901;i gian th&#7921;c hi&#7879;n s&#7869; mau h</FONT>&#417;n. M&#7897;t ch&#432;&#417;ng tr&igrave;nh, c&ograve;n g&#7885;i l&agrave; b&#7897; gi&aacute;m s&aacute;t th&#432;&#7901;ng tr&#7921;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi&#7871;t k&#7871; <FONT FACE="Times New Roman">&#273;&#7875; giám sát vi&#7879;c th&#7921;c hi&#7879;n d</FONT>&atilde;y c&aacute;c c&ocirc;ng vi&#7879;c m&#7897;t c&aacute;ch t&#7921; <FONT FACE="Times New Roman">&#273;&#7897;ng, ch</FONT>&#432;&#417;ng tr&igrave;nh n&agrave;y lu&ocirc;n lu&ocirc;n th&#432;&#7901;ng tr&uacute; trong b&#7897; nh&#7899; ch&iacute;nh.</P>

<B><I><P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh theo l&ocirc;</I> </B> th&#7921;c hi&#7879;n c&aacute;c c&ocirc;ng vi&#7879;c l&#7847;n l&#432;&#7907;t theo nh&#7919;ng ch&#7881; th&#7883; <FONT FACE="Times New Roman">&#273;&#7883;nh tr</FONT>&#432;&#7899;c.</P>
</blockquote>

<B><P ALIGN="JUSTIFY"><I><img border="0" src="images/red.gif" width="7" height="10"></I>CPU v&agrave;  thao t&aacute;c nh&#7853;p xu&#7845;t&nbsp;:</P>
<blockquote>
</B>

<P ALIGN="JUSTIFY">CPU th&#432;&#7901;ng hay nh&agrave;n r&#7895;i do t&#7889;c <FONT FACE="Times New Roman">&#273;&#7897; l</FONT>&agrave;m vi&#7879;c c&#7911;a c&aacute;c thi&#7871;t b&#7883; nh&#7853;p xu&#7845;t (th&#432;&#7901;ng l&agrave; thi&#7871;t b&#7883; c&#417;) ch&#7853;m h&#417;n r&#7845;t nhi&#7873;u l&#7847;n so v&#7899;i c&aacute;c thi&#7871;t b&#7883; <FONT FACE="Times New Roman">&#273;i&#7879;n t&#7917;. Cho d</FONT>&ugrave; l&agrave; m&#7897;t CPU ch&#7853;m nh&#7845;t, n&oacute; c&#361;ng nhanh h&#417;n r&#7845;t nhi&#7873;u l&#7847;n so v&#7899;i thi&#7871;t b&#7883; nh&#7853;p xu&#7845;t. Do <FONT FACE="Times New Roman">&#273;ó ph&#7843;i có các ph</FONT>&#432;&#417;ng ph&aacute;p <FONT FACE="Times New Roman">&#273;&#7875; &#273;&#7891;ng b&#7897; hóa vi&#7879;c ho&#7841;t &#273;&#7897;ng c&#7911;a CPU v</FONT>&agrave; thao t&aacute;c nh&#7853;p xu&#7845;t.</P>

<B><I><P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">X&#7917; l&yacute; off_line :</P><blockquote>

</I>

</B>

<P ALIGN="JUSTIFY">X&#7917; l&yacute; off_line l&agrave; thay v&igrave; CPU ph&#7843;i <FONT FACE="Times New Roman">&#273;&#7885;c tr&#7921;c ti&#7871;p t&#7915; thi&#7871;t b&#7883; nh&#7853;p v</FONT>&agrave; xu&#7845;t ra thi&#7871;t b&#7883; xu&#7845;t, h&#7879; th&#7889;ng d&ugrave;ng m&#7897;t <I>b&#7897; l&#432;u tr&#7919; trung gian</I>. CPU ch&#7881; thao th&aacute;c v&#7899;i b&#7897; ph&#7853;n n&agrave;y. Vi&#7879;c <FONT FACE="Times New Roman">&#273;&#7885;c hay xu&#7845;t &#273;&#7873;u &#273;&#7871;n v</FONT>&agrave; t&#7915; b&#7897; l&#432;u tr&#7919; trung gian.</P>

<B><I>
</blockquote>
<P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">Spooling :</P>
</I>
</B>

<I>
<blockquote>
  <P ALIGN="JUSTIFY">Spool</I> (<B>simultaneous</B> <B>peripheral</B> <B>operation</B> <B>on</B>-<B>line</B>) l&agrave; <FONT FACE="Times New Roman">&#273;&#7891;ng b&#7897; hóa các thao tác b</FONT>&ecirc;n ngo&agrave;i on-line. C&#417; ch&#7871; n&agrave;y cho ph&eacute;p x&#7917; l&yacute; c&#7911;a CPU l&agrave; on-line, s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#297;a &#273;&#7875; l</FONT>&#432;u c&aacute;c d&#7919; li&#7879;u nh&#7853;p c&#361;ng nh&#432; xu&#7845;t.</P>
</blockquote>
<P ALIGN="JUSTIFY">&nbsp;</P>
</blockquote>
</blockquote>
<FONT SIZE=4><STRONG><P class="cap2"><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="dachuong">II.2 H&#7879; th&#7889;ng x&#7917; l&yacute; theo l&ocirc; </a></STRONG> </FONT><STRONG><a name="dachuong"><FONT FACE="Times New Roman" SIZE=4>&#273;a ch</FONT><FONT SIZE=4>&#432;&#417;ng

</FONT></a></P>

</STRONG>
<blockquote>

<P ALIGN="JUSTIFY">Khi c&oacute; nhi&#7873;u c&ocirc;ng vi&#7879;c c&ugrave;ng truy xu&#7845;t l&ecirc;n thi&#7871;t b&#7883;, v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; l&#7853;p l&#7883;ch cho các công vi&#7879;c l</FONT>&agrave; c&#7847;n thi&#7871;t. Kh&iacute;a c&#7841;nh quan tr&#7885;ng nh&#7845;t trong vi&#7879;c l&#7853;p l&#7883;ch l&agrave; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng &#273;a ch</FONT>&#432;&#417;ng. <I><FONT FACE="Times New Roman">&#272;a ch</FONT>&#432;&#417;ng</I> (multiprogram) gia t<FONT FACE="Times New Roman">&#259;ng khai thác CPU b&#7857;ng cách t&#7893; ch&#7913;c các công vi&#7879;c sao cho CPU luôn luôn ph&#7843;i trong t</FONT>&igrave;nh tr&#7841;ng l&agrave;m vi&#7879;c .</P>
<P ALIGN="JUSTIFY">&Yacute; t&#432;&#7903;ng nh&#432; sau : h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&#432;u gi&#7919; m&#7897;t ph&#7847;n c&#7911;a c&aacute;c c&ocirc;ng vi&#7879;c &#7903; n&#417;i l&#432;u tr&#7919;  trong b&#7897; nh&#7899; . CPU s&#7869; l&#7847;n l&#432;&#7907;t th&#7921;c hi&#7879;n c&aacute;c ph&#7847;n c&ocirc;ng vi&#7879;c n&agrave;y. Khi <FONT FACE="Times New Roman">&#273;ang th&#7921;c hi&#7879;n, n&#7871;u có y</FONT>&ecirc;u c&#7847;u truy xu&#7845;t thi&#7871;t b&#7883; th&igrave; CPU kh&ocirc;ng ngh&#7881; m&agrave; th&#7921;c hi&#7879;n ti&#7871;p c&ocirc;ng vi&#7879;c th&#7913; hai…</P>
<P ALIGN="JUSTIFY">V&#7899;i h&#7879; <FONT FACE="Times New Roman">&#273;a ch</FONT>&#432;&#417;ng h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ra quy&#7871;t <FONT FACE="Times New Roman">&#273;&#7883;nh cho ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng v&igrave; v&#7853;y, <B><I>h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;a ch</FONT>&#432;&#417;ng</B></I> r&#7845;t tinh vi. H&#7879; ph&#7843;i x&#7917; l&yacute; c&aacute;c v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; l&#7853;p l&#7883;ch cho công vi&#7879;c, l&#7853;p l&#7883;ch cho b&#7897; nh&#7899; v</FONT>&agrave; cho c&#7843; CPU n&#7919;a.</P>
</blockquote>
<FONT SIZE=4><STRONG><P ALIGN="JUSTIFY" class="cap2"><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="thoigian">II.3 H&#7879; th&#7889;ng chia x&#7867; th&#7901;i gian</a></P></FONT></STRONG>
<blockquote>
  <P ALIGN="JUSTIFY">H&#7879; th&#7889;ng chia x&#7867; th&#7901;i gian l&agrave; m&#7897;t m&#7903; r&#7897;ng logic c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;a ch</FONT>&#432;&#417;ng. H&#7879; th&#7889;ng n&agrave;y c&ograve;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; <B><I>h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;a nhi&#7879;m</B></I></FONT> (multitasking). Nhi&#7873;u c&ocirc;ng vi&#7879;c c&ugrave;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n th&ocirc;ng qua c&#417; ch&#7871; chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i c&#7911;a CPU nh</FONT>&#432; h&#7879; <FONT FACE="Times New Roman">&#273;a ch</FONT>&#432;&#417;ng nh&#432;ng th&#7901;i gian m&#7895;i l&#7847;n chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i di&#7877;n ra r&#7845;t nhanh.</P>
</FONT>
<P ALIGN="JUSTIFY">H&#7879; th&#7889;ng chia x&#7867; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&aacute;t tri&#7875;n <FONT FACE="Times New Roman">&#273;&#7875; cung c&#7845;p vi&#7879;c s&#7917; d&#7909;ng b</FONT>&ecirc;n trong c&#7911;a m&#7897;t m&aacute;y t&iacute;nh c&oacute; gi&aacute; tr&#7883; h&#417;n. <B><I>H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh chia x&#7867;</B></I> th&#7901;i gian d&ugrave;ng l&#7853;p l&#7883;ch CPU v&agrave; <FONT FACE="Times New Roman">&#273;a ch</FONT>&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7875; cung c&#7845;p cho m&#7895;i ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng m&#7897;t ph&#7847;n nh&#7887; trong m&aacute;y t&iacute;nh chia x&#7867;. M&#7897;t ch&#432;&#417;ng tr&igrave;nh khi thi h&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; m&#7897;t ti&#7871;n tr&igrave;nh. Trong qu&aacute; tr&igrave;nh thi h&agrave;nh c&#7911;a m&#7897;t ti&#7871;n tr&igrave;nh, n&oacute; ph&#7843;i th&#7921;c hi&#7879;n c&aacute;c thao t&aacute;c nh&#7853;p xu&#7845;t v&agrave; trong kho&#7843;ng th&#7901;i gian <FONT FACE="Times New Roman">&#273;ó CPU s&#7869; thi h</FONT>&agrave;nh m&#7897;t ti&#7871;n tr&igrave;nh kh&aacute;c. H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh chia x&#7867; cho ph&eacute;p nhi&#7873;u ng&#432;&#7901;i s&#7917; d&#7909;ng chia x&#7867; m&aacute;y t&iacute;nh m&#7897;t c&aacute;ch <FONT FACE="Times New Roman">&#273;&#7891;ng b&#7897; do th&#7901;i gian chuy&#7875;n &#273;&#7893;i nhanh n</FONT>&ecirc;n h&#7885; c&oacute; c&#7843;m gi&aacute;c l&agrave; c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang &#273;</FONT>&#432;&#7907;c thi h&agrave;nh c&ugrave;ng l&uacute;c.</P>
<P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh chia x&#7867; ph&#7913;c t&#7841;p h&#417;n h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;a ch</FONT>&#432;&#417;ng. N&oacute; ph&#7843;i c&oacute; c&aacute;c ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng : qu&#7843;n tr&#7883; v</FONT>&agrave; b&#7843;o v&#7879; b&#7897; nh&#7899;, s&#7917; d&#7909;ng b&#7897; nh&#7899; &#7843;o. N&oacute; c&#361;ng cung c&#7845;p h&#7879; th&#7889;ng t&#7853;p tin truy xu&#7845;t on-line…</P>
<P ALIGN="JUSTIFY">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh chia x&#7867; l&agrave; ki&#7875;u c&#7911;a c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh hi&#7879;n <FONT FACE="Times New Roman">&#273;&#7841;i ng</FONT>&agrave;y nay.</P>
</blockquote>
<FONT SIZE=4><STRONG><P ALIGN="JUSTIFY" class="cap2"><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="songsong">II.4 H&#7879; th&#7889;ng song song</a></P></STRONG></FONT>
<blockquote>
  <P ALIGN="JUSTIFY">Ngo&agrave;i c&aacute;c h&#7879; th&#7889;ng ch&#7881; c&oacute; m&#7897;t b&#7897; x&#7917; l&yacute; c&ograve;n c&oacute; c&aacute;c h&#7879; th&#7889;ng c&oacute; nhi&#7873;u b&#7897; x&#7917; l&yacute; c&ugrave;ng chia x&#7867; h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng truy&#7873;n d&#7919; li&#7879;u, <FONT FACE="Times New Roman">&#273;&#7891;ng h&#7891;, b&#7897; nh&#7899; v</FONT>&agrave; c&aacute;c thi&#7871;t b&#7883; ngo&#7841;i vi. C&aacute;c b&#7897; x&#7917; l&yacute; n&agrave;y li&ecirc;n l&#7841;c b&ecirc;n trong v&#7899;i nhau .</P>
<P ALIGN="JUSTIFY">C&oacute; nhi&#7873;u nguy&ecirc;n nh&acirc;n x&acirc;y d&#7921;ng d&#7841;ng h&#7879; th&#7889;ng n&agrave;y. V&#7899;i s&#7921; gia t<FONT FACE="Times New Roman">&#259;ng s&#7889; l</FONT>&#432;&#7907;ng b&#7897; x&#7917; l&yacute;, c&ocirc;ng vi&#7879;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n nhanh ch&oacute;ng h&#417;n, Nh&#432;ng kh&ocirc;ng ph&#7843;i theo <FONT FACE="Times New Roman">&#273;úng t&#7881; l&#7879; th&#7901;i gian, ngh&#297;a l</FONT>&agrave; c&oacute; n b&#7897; x&#7917; l&yacute; kh&ocirc;ng c&oacute; ngh&#297;a l&agrave; s&#7869; th&#7921;c hi&#7879;n nhanh h&#417;n n l&#7847;n.</P>
<P ALIGN="JUSTIFY">H&#7879; th&#7889;ng v&#7899;i m&aacute;y nhi&#7873;u b&#7897; x&#7917; l&yacute; s&#7869; t&#7889;i &#432;u h&#417;n h&#7879; th&#7889;ng c&oacute; nhi&#7873;u m&aacute;y c&oacute; m&#7897;t b&#7897; x&#7917; l&yacute; v&igrave; c&aacute;c b&#7897; x&#7917; l&yacute; chia x&#7867; c&aacute;c thi&#7871;t b&#7883; ngo&#7841;i vi, h&#7879; th&#7889;ng l&#432;u tr&#7919;, ngu&#7891;n … v&agrave; r&#7845;t thu&#7853;n ti&#7879;n cho nhi&#7873;u ch&#432;&#417;ng tr&igrave;nh c&ugrave;ng l&agrave;m vi&#7879;c tr&ecirc;n c&ugrave;ng m&#7897;t t&#7853;p h&#7907;p d&#7919; li&#7879;u.</P>
<P ALIGN="JUSTIFY">M&#7897;t l&yacute; do n&#7919;a l&agrave; <FONT FACE="Times New Roman">&#273;&#7897; tin c&#7853;y. Các ch&#7913;c n&#259;ng &#273;</FONT>&#432;&#7907;c x&#7917; l&yacute; tr&ecirc;n nhi&#7873;u b&#7897; x&#7917; l&yacute; v&agrave; s&#7921; h&#7887;ng h&oacute;c c&#7911;a m&#7897;t b&#7897; x&#7917; l&yacute; s&#7869; kh&ocirc;ng &#7843;nh h&#432;&#7903;ng <FONT FACE="Times New Roman">&#273;&#7871;n to</FONT>&agrave;n b&#7897; h&#7879; th&#7889;ng.</P>
<B><I><P ALIGN="JUSTIFY">H&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;a x&#7917; lý</B></I></FONT> th&ocirc;ng th&#432;&#7901;ng s&#7917; d&#7909;ng c&aacute;ch <B><I><FONT FACE="Times New Roman">&#273;a x&#7917; lý &#273;&#7889;i x&#7913;ng</B></I></FONT>, trong c&aacute;ch n&agrave;y m&#7895;i b&#7897; x&#7917; l&yacute; ch&#7841;y v&#7899;i m&#7897;t b&#7843;n sao c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh, nh&#7919;ng b&#7843;n sao n&agrave;y li&ecirc;n l&#7841;c v&#7899;i nhau khi c&#7847;n thi&#7871;t. M&#7897;t s&#7889; h&#7879; th&#7889;ng s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;a x&#7917; lý b&#7845;t &#273;&#7889;i x&#7913;ng, trong &#273;ó m&#7895;i b&#7897; x&#7917; lý &#273;</FONT>&#432;&#7907;c giao m&#7897;t c&ocirc;ng vi&#7879;c ri&ecirc;ng bi&#7879;t.. M&#7897;t b&#7897; x&#7917; l&yacute; ch&iacute;nh ki&#7875;m so&aacute;t to&agrave;n b&#7897; h&#7879; th&#7889;ng, c&aacute;c b&#7897; x&#7917; l&yacute; kh&aacute;c th&#7921;c hi&#7879;n theo l&#7879;nh c&#7911;a b&#7897; x&#7917; l&yacute; ch&iacute;nh ho&#7863;c theo nh&#7919;ng ch&#7881; th&#7883; <FONT FACE="Times New Roman">&#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a tr</FONT>&#432;&#7899;c. M&ocirc; h&igrave;nh n&agrave;y theo d&#7841;ng quan h&#7879; ch&#7911; t&#7899;. B&#7897; x&#7917; l&yacute; ch&iacute;nh s&#7869; l&#7853;p l&#7883;ch cho c&aacute;c b&#7897; x&#7917; l&yacute; kh&aacute;c. </P>
<P ALIGN="JUSTIFY">M&#7897;t v&iacute; d&#7909; v&#7873; h&#7879; th&#7889;ng x&#7917; l&yacute; <FONT FACE="Times New Roman">&#273;&#7889;i x&#7913;ng l</FONT>&agrave; version Encore c&#7911;a UNIX cho m&aacute;y t&iacute;nh Multimax. H&#7879; th&#7889;ng n&agrave;y c&oacute; h&agrave;ng t&aacute; b&#7897; x&#7917; l&yacute;. &#431;u <FONT FACE="Times New Roman">&#273;i&#7875;m c&#7911;a nó l</FONT>&agrave; nhi&#7873;u ti&#7871;n tr&igrave;nh c&oacute; th&#7875; th&#7921;c hi&#7879;n c&ugrave;ng l&uacute;c . M&#7897;t h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;a x&#7917; lý cho phép nhi&#7873;u công vi&#7879;c v</FONT>&agrave; t&agrave;i nguy&ecirc;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia x&#7867; t&#7921; <FONT FACE="Times New Roman">&#273;&#7897;ng trong nh&#7919;ng b&#7897; x&#7917; lý khác nhau.</P>
</FONT>
<P ALIGN="JUSTIFY">H&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;a x&#7917; lý không &#273;&#7891;ng b&#7897; th</FONT>&#432;&#7901;ng xu&#7845;t hi&#7879;n trong nh&#7919;ng h&#7879; th&#7889;ng l&#7899;n, trong <FONT FACE="Times New Roman">&#273;ó h&#7847;u h&#7871;t th&#7901;i gian ho&#7841;t &#273;&#7897;ng &#273;&#7873;u d</FONT>&agrave;nh cho x&#7917; l&yacute; nh&#7853;p xu&#7845;t. </P>
</blockquote>
<FONT SIZE=4><STRONG><P class="cap2"><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="phantan">II.5 H&#7879; th&#7889;ng ph&acirc;n t&aacute;n</a></P>
</FONT></STRONG>
<blockquote>
  <P ALIGN="JUSTIFY">H&#7879; th&#7889;ng n&agrave;y c&#361;ng t&#432;&#417;ng t&#7921; nh&#432; h&#7879; th&#7889;ng chia x&#7867; th&#7901;i gian nh&#432;ng c&aacute;c b&#7897; x&#7917; l&yacute; kh&ocirc;ng chia x&#7867; b&#7897; nh&#7899; v&agrave; <FONT FACE="Times New Roman">&#273;&#7891;ng h&#7891;, thay v</FONT>&agrave;o <FONT FACE="Times New Roman">&#273;ó m&#7895;i b&#7897; x&#7917; lý có b&#7897; nh&#7899; c&#7909;c b&#7897; ri</FONT>&ecirc;ng. C&aacute;c b&#7897; x&#7917; l&yacute; th&ocirc;ng tin v&#7899;i nhau th&ocirc;ng qua c&aacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng truy&#7873;n th&ocirc;ng nh&#432; nh&#7919;ng bus t&#7889;c <FONT FACE="Times New Roman">&#273;&#7897; cao hay &#273;</FONT>&#432;&#7901;ng d&acirc;y <FONT FACE="Times New Roman">&#273;i&#7879;n tho&#7841;i.</FONT>&nbsp;</P>
<P ALIGN="JUSTIFY">C&aacute;c b&#7897; x&#7917; l&yacute; trong h&#7879; ph&acirc;n t&aacute;n  th&#432;&#7901;ng kh&aacute;c nhau v&#7873; k&iacute;ch th&#432;&#7899;c v&agrave; ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng. Nó có th&#7875; bao g&#7891;m máy vi tính, tr&#7841;m l</FONT>&agrave;m vi&#7879;c, m&aacute;y mini, v&agrave; nh&#7919;ng h&#7879; th&#7889;ng m&aacute;y l&#7899;n. C&aacute;c b&#7897; x&#7917; l&yacute; th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c tham kh&#7843;o v&#7899;i nhi&#7873;u t&ecirc;n kh&aacute;c nhau nh&#432; site, node, computer v.v.... t&ugrave;y thu&#7897;c v&agrave;o tr&#7841;ng th&aacute;i l&agrave;m vi&#7879;c c&#7911;a ch&uacute;ng.</P>
<P ALIGN="JUSTIFY">C&aacute;c nguy&ecirc;n nh&acirc;n ph&#7843;i x&acirc;y d&#7921;ng h&#7879; th&#7889;ng ph&acirc;n t&aacute;n l&agrave;:</P>
<blockquote>

<B><I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Chia x&#7867; t&agrave;i nguy&ecirc;n</B></I> : M&#7897;t ng&#432;&#7901;i s&#7917; d&#7909;ng A c&oacute; th&#7875; s&#7917; d&#7909;ng m&aacute;y in laser c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng B v&agrave; ng&#432;&#7901;i s&#7917; d&#7909;ng B c&oacute; th&#7875; truy xu&#7845;t nh&#7919;ng t&#7853;p tin c&#7911;a A. T&#7893;ng qu&aacute;t, chia x&#7867; t&agrave;i nguy&ecirc;n trong h&#7879; th&#7889;ng ph&acirc;n t&aacute;n cung c&#7845;p m&#7897;t c&#417; ch&#7871; <FONT FACE="Times New Roman">&#273;&#7875; chia x&#7867; t&#7853;p tin &#7903; v&#7883; trí xa, x&#7917; lý thông tin trong m&#7897;t c</FONT>&#417; s&#7903; d&#7919; li&#7879;u ph&acirc;n t&aacute;n, in &#7845;n t&#7841;i m&#7897;t v&#7883; tr&iacute; xa, s&#7917; d&#7909;ng nh&#7919;ng thi&#7871;t b&#7883; &#7903; xa <FONT FACE="Times New Roman">&#273;&#7875;</FONT>&otilde; th&#7921;c hi&#7879;n c&aacute;c thao t&aacute;c.</P></blockquote>

<blockquote>

<B><I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">T<FONT FACE="Times New Roman">&#259;ng t&#7889;c &#273;&#7897; tính toán</B></I></FONT> : M&#7897;t thao t&aacute;c t&iacute;nh to&aacute;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia l&agrave;m nhi&#7873;u ph&#7847;n nh&#7887; c&ugrave;ng th&#7921;c hi&#7879;n m&#7897;t l&uacute;c. H&#7879; th&#7889;ng ph&acirc;n t&aacute;n cho ph&eacute;p ph&acirc;n chia vi&#7879;c t&iacute;nh to&aacute;n tr&ecirc;n nhi&#7873;u v&#7883; tr&iacute; kh&aacute;c nhau <FONT FACE="Times New Roman">&#273;&#7875; tính toán song song.

</FONT></P>

<B><I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">An to&agrave;n</B></I> : N&#7871;u m&#7897;t v&#7883; tr&iacute; trong h&#7879; th&#7889;ng ph&acirc;n t&aacute;n b&#7883; h&#7887;ng, c&aacute;c v&#7883; tr&iacute; kh&aacute;c v&#7851;n ti&#7871;p t&#7909;c l&agrave;m vi&#7879;c.</P>
<B><I><P><img border="0" src="images/red.gif" width="7" height="10">Th&ocirc;ng tin li&ecirc;n l&#7841;c v&#7899;i nhau</B></I> :C&oacute; nhi&#7873;u l&uacute;c , ch&#432;&#417;ng tr&igrave;nh c&#7847;n chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i d&#7919; li&#7879;u t&#7915; v&#7883; trí n</FONT>&agrave;y sang v&#7883; tr&iacute; kh&aacute;c. V&iacute; d&#7909; trong h&#7879; th&#7889;ng Windows, th&#432;&#7901;ng c&oacute; s&#7921; chia x&#7867; v&agrave; chuy&#7875;n d&#7919; li&#7879;u gi&#7919;a c&aacute;c c&#7917;a s&#7893;. Khi c&aacute;c v&#7883; tr&iacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7889;i k&#7871;t v&#7899;i nhau trong m&#7897;t h&#7879; th&#7889;ng m&#7841;ng, vi&#7879;c trao <FONT FACE="Times New Roman">&#273;&#7893;i d&#7919; li&#7879;u di&#7877;n ra r&#7845;t d&#7877;. Ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng c&oacute; th&#7875; chuy&#7875;n t&#7853;p tin hay c&aacute;c E_mail cho nhau t&#7915; c&ugrave;ng v&#7883; tr&iacute; hay nh&#7919;ng v&#7883; tr&iacute; kh&aacute;c.</P></blockquote>

</blockquote>

<FONT SIZE=4><STRONG><P class="cap2"><a name="thoigianthuc"><img border="0" src="images/read_single.gif" width="15" height="12">
II.6 H&#7879; th&#7889;ng x&#7917; l&yacute; th&#7901;i gian th&#7921;c</a></P>
</STRONG>
</FONT><B><I>
<blockquote>
  <P ALIGN="JUSTIFY">H&#7879; th&#7889;ng x&#7917; l&yacute; th&#7901;i gian th&#7921;c</I> </B> <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng khi c&oacute; nh&#7919;ng <FONT FACE="Times New Roman">&#273;</FONT>&ograve;i h&#7887;i kh&#7855;t khe v&#7873; th&#7901;i gian tr&ecirc;n c&aacute;c thao t&aacute;c c&#7911;a b&#7897; x&#7917; l&yacute; ho&#7863;c d&ograve;ng d&#7919; li&#7879;u, n&oacute; th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c d&ugrave;ng <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n các thi&#7871;t b&#7883; trong các &#7913;ng d&#7909;ng t&#7853;n hi&#7871;n (dedicated). Máy tính phân tích d&#7919; li&#7879;u v</FONT>&agrave; c&oacute; th&#7875; ch&#7881;nh c&aacute;c <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n gi&#7843;i quy&#7871;t cho d&#7919; li&#7879;u nh&#7853;p. </P>
</FONT><P ALIGN="JUSTIFY">&nbsp;M&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh x&#7917; l&yacute; th&#7901;i gian th&#7921;c ph&#7843;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a t&#7889;t, th&#7901;i gian x&#7917; lý nhanh. H&#7879; th&#7889;ng ph&#7843;i cho k&#7871;t qu&#7843; chính xác trong kho&#7843;ng th&#7901;i gian b&#7883; thúc ép nhanh nh&#7845;t. Có hai h&#7879; th&#7889;ng x&#7917; lý th&#7901;i gian th&#7921;c l</FONT>&agrave; h&#7879; th&#7889;ng th&#7901;i gian th&#7921;c c&#7913;ng v&agrave; h&#7879; th&#7889;ng th&#7901;i gian th&#7921;c m&#7873;m..</P>
<P ALIGN="JUSTIFY">H&#7879; th&#7889;ng th&#7901;i gian th&#7921;c c&#7913;ng l&agrave; c&ocirc;ng vi&#7879;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ho&agrave;n t&#7845;t <FONT FACE="Times New Roman">&#273;úng lúc. Lúc &#273;ó d&#7919; li&#7879;u th</FONT>&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u trong b&#7897; nh&#7899; ng&#7855;n h&#7841;n hay trong ROM. Vi&#7879;c x&#7917; l&yacute; theo th&#7901;i gian th&#7921;c s&#7869; xung <FONT FACE="Times New Roman">&#273;&#7897;t v&#7899;i t&#7845;t c&#7843; h&#7879; th&#7889;ng li&#7879;t k</FONT>&ecirc; &#7903; tr&ecirc;n.</P>
<P ALIGN="JUSTIFY">D&#7841;ng th&#7913; hai l&agrave; h&#7879; th&#7889;ng th&#7901;i gian th&#7921;c m&#7873;m, m&#7895;i c&ocirc;ng vi&#7879;c c&oacute; m&#7897;t <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n ri&ecirc;ng v&agrave; s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi h&agrave;nh theo <FONT FACE="Times New Roman">&#273;&#7897; </FONT>&#432;u ti&ecirc;n <FONT FACE="Times New Roman">&#273;ó. Có m&#7897;t s&#7889; l&#297;nh v&#7921;c áp d&#7909;ng h&#7919;u hi&#7879;u ph</FONT>&#432;&#417;ng ph&aacute;p n&agrave;y l&agrave; multimedia hay th&#7921;c t&#7841;i &#7843;o.</P>
</BODY>
</HTML>
