<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<LINK REL="stylesheet" TYPE="text/css" HREF="style.css" TITLE="MTD">
<TITLE>He dieu hanh LINUX</TITLE>
</HEAD>
<BODY LINK="#0000ff">

<B><P ALIGN="CENTER"><font face="Verdana" size="2">Bài 15 </font><font size="5" face="Verdana">H&#7878; &#272;I&#7872;U H&Agrave;NH LINUX</font></P>

</B><P><EM><img border="0" src="images/Linux.gif" align="left" width="259" height="207">Linux l&agrave; m&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh t&#7921;a Unix r&#7845;t m&#7841;nh, linh <FONT FACE="Times New Roman">&#273;&#7897;ng, d&#7877; m&#7903; r&#7897;ng v</FONT>&agrave; ho&agrave;n to&agrave;n mi&#7877;n ph&iacute;. N&oacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng hi&#7879;u qu&#7843; trong nhi&#7873;u l&#297;nh v&#7921;c c&#7911;a tin h&#7885;c v&agrave; nh&#7919;ng &#7913;ng d&#7909;ng m&#7899;i <FONT FACE="Times New Roman">&#273;ang &#273;</FONT>&#432;&#7907;c x&acirc;y d&#7921;ng cho Linux m&#7895;i ng&agrave;y. Trong b&agrave;i n&agrave;y ch&uacute;ng ta t&igrave;m hi&#7875;u h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh Linux v&#7899;i nh&#7919;ng n&#7897;i dung sau:

</EM> </P>

<blockquote>
  <P><img border="0" src="images/dotgreen.gif" width="9" height="9"> <a href="#gioithieu">Gi&#7899;i
  thi&#7879;u v&#7873; h&#7879; &#273;i&#7873;u hành Linux</a> </P>

  <P><img border="0" src="images/dotgreen.gif" width="9" height="9"> <a href="#tochuc">T&#7893;
  ch&#7913;c h&#7879; th&#7889;ng</a> </P>

</blockquote>

<P>&nbsp;&nbsp;&nbsp; Qua b&agrave;i h&#7885;c n&agrave;y, ch&uacute;ng ta hi&#7875;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c nh&#7919;ng <FONT FACE="Times New Roman">&#273;&#7863;c &#273;i&#7875;m c</FONT>&#417; b&#7843;n v&agrave; m&#7897;t s&#7889; v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; v&#7873; t&#7893; ch&#7913;c h&#7879; th&#7889;ng c&#7911;a h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh Linux. T&#7915; <FONT FACE="Times New Roman">&#273;ó chúng ta có m&#7897;t cái</FONT> nh&igrave;n r&#7897;ng h&#417;n v&#7873; c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh v&agrave; c&oacute; th&#7875; l&#7921;a ch&#7885;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c cho m&igrave;nh m&#7897;t m&ocirc;i tr&#432;&#7901;ng l&agrave;m vi&#7879;c v&agrave; ph&aacute;t tri&#7875;n thu&#7853;n l&#7907;i nh&#7845;t.</P>
<P>B&agrave;i h&#7885;c n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&ograve;i h&#7887;i nh&#7919;ng ki&#7871;n th&#7913;c t&#7893;ng qu&aacute;t v&#7873; c&#7845;u tr&uacute;c v&agrave; t&#7893; ch&#7913;c c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh.</P>

<STRONG><P ALIGN="JUSTIFY" class="cap1"><a name="gioithieu">I. GI&#7898;I THI&#7878;U</a></P>
</STRONG>
<P ALIGN="JUSTIFY">Unix l&agrave; m&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh th&ocirc;ng d&#7909;ng tr&ecirc;n th&#7871; gi&#7899;i do <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c nhi&#7873;u h&#7879; th&#7889;ng h&#7895; tr&#7907;. H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh n&agrave;y t&#7891;n t&#7841;i tr&ecirc;n h&#7847;u h&#7871;t c&aacute;c ki&#7875;u m&aacute;y t&iacute;nh k&#7875; c&#7843; m&aacute;y t&iacute;nh c&aacute; nh&acirc;n.</P>


<P ALIGN="JUSTIFY">Linux l&agrave; m&#7897;t h&#7879; th&#7889;ng Unix t&#7921; do <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c h&igrave;nh th&agrave;nh t&#7915; m&#7897;t <FONT FACE="Times New Roman">&#273;&#7891; án gi&#7843;i trí c&#7911;a m&#7897;t sinh vi</FONT>&ecirc;n ng&#432;&#7901;i Ph&#7847;n Lan&nbsp;: Linus Torvalds, l&#7845;y ngu&#7891;n c&#7843;m h&#7913;ng t&#7915; Minix, m&#7897;t h&#7879; th&#7889;ng Unix nh&#7887; do Andy Tanenbaum thi&#7871;t k&#7871;. Th&aacute;ng 10/1991 Linus Torvalds c&ocirc;ng b&#7889; version ch&iacute;nh th&#7913;c <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n c&#7911;a Linux (version 0.02).</P>
<P ALIGN="JUSTIFY">Ng&agrave;y nay, Linux l&agrave; m&#7897;t h&#7879; th&#7889;ng 32-bits, multi-tasking, multi-user, m&#7841;ng...n&oacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&agrave;i tr&ecirc;n ph&#7847;n l&#7899;n m&aacute;y PC (c&oacute; th&#7875; chung v&#7899;i nh&#7919;ng h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh kh&aacute;c). N&oacute; h&#7895; tr&#7907; <FONT FACE="Times New Roman">&#273;&#7911; lo&#7841;i ch</FONT>&#432;&#417;ng tr&igrave;nh kh&aacute;c nhau nh&#432; X Windows, TCP/IP, C/C++GNU v&agrave; nh&#7919;ng c&ocirc;ng c&#7909; kh&aacute;c c&#7911;a GNU, th&#432; <FONT FACE="Times New Roman">&#273;i&#7879;n t&#7917;, nh&#7919;ng công c&#7909; v&#7899;i LateX ho&#7863;c nh&#7919;ng ti&#7879;n ích cho v&#259;n ph</FONT>&ograve;ng (ApplixWare, StartOffice).</P>
<P ALIGN="JUSTIFY">S&#7921; th&agrave;nh c&ocirc;ng c&#7911;a Linux d&#7921;a v&agrave;o nhi&#7873;u y&#7871;u t&#7889; nh&#432;&nbsp;:</P>
<blockquote>

<P ALIGN="JUSTIFY">M&atilde; ngu&#7891;n c&#7911;a h&#7879; th&#7889;ng, c&#361;ng nh&#432; c&#7911;a h&#7841;t nh&acirc;n, c&aacute;c c&ocirc;ng c&#7909; l&#7853;p tr&igrave;nh c&#361;ng nh&#432; ph&aacute;t tri&#7875;n <FONT FACE="Times New Roman">&#273;&#7873;u &#273;</FONT>&#432;&#7907;c ph&acirc;n ph&#7889;i t&#7921; do.</P>
<P ALIGN="JUSTIFY">Linux t&#432;&#417;ng th&iacute;ch v&#7899;i m&#7897;t s&#7889; l&#7899;n c&aacute;c chu&#7849;n c&#7911;a Unix &#7903; m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; m</FONT>&atilde; ngu&#7891;n, bao g&#7891;m nh&#7919;ng <FONT FACE="Times New Roman">&#273;&#7863;c tính c&#7911;a POSIX, system V, v</FONT>&agrave; BSD.</P>
<P ALIGN="JUSTIFY">M&#7897;t s&#7889; l&#432;&#7907;ng l&#7899;n c&aacute;c tr&igrave;nh &#7913;ng d&#7909;ng Unix mi&#7877;n ph&iacute; c&oacute; th&#7875; s&#7917; d&#7909;ng l&#7841;i d&#432;&#7899;i Linux m&agrave; kh&ocirc;ng c&#7847;n m&ocirc; t&#7843; l&#7841;i.</P>
<P ALIGN="JUSTIFY">H&#7879; th&#7889;ng Linux <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi&#7871;t k&#7871; d&#7921;a tr&ecirc;n b&#7897; x&#7917; l&yacute; c&#7911;a Intel v&agrave; t&#7853;n d&#7909;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7845;t c&#7843; nh&#7919;ng ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a chúng.</P><blockquote>
</blockquote>
</blockquote>

<P ALIGN="JUSTIFY">Linux l&agrave; m&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh bao g&#7891;m h&#7841;t nh&acirc;n, b&#7897; th&ocirc;ng d&#7883;ch l&#7879;nh v&agrave; nhi&#7873;u tr&igrave;nh ti&#7879;n  &iacute;ch.</P>
<P ALIGN="JUSTIFY">H&#7841;t nh&acirc;n qu&#7843;n l&yacute; nh&#7919;ng t&agrave;i nguy&ecirc;n v&#7853;t l&yacute; (nh&#432; b&#7897; x&#7917; l&yacute;, b&#7897; nh&#7899;, thi&#7871;t b&#7883; ngo&#7841;i vi) v&agrave; logic (nh&#432; ti&#7871;n tr&igrave;nh, t&#7853;p tin...). H&#7841;t nh&acirc;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o th&agrave;nh t&#7915; m&#7897;t t&#7853;p h&#7907;p c&aacute;c th&#7911; t&#7909;c v&agrave; h&agrave;m <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi&#7871;t k&#7871; b&#7857;ng ng&ocirc;n ng&#7919; C. C&#7845;u tr&uacute;c c&#7911;a h&#7841;t nh&acirc;n l&agrave; nguy&ecirc;n kh&#7889;i v&agrave; l&#7899;p.Ng&#432;&#7901;i s&#7917; d&#7909;ng thao t&aacute;c v&#7899;i Linux th&ocirc;ng qua b&#7897; th&ocirc;ng d&#7883;ch l&#7879;nh. M&#7897;t trong nh&#7919;ng <FONT FACE="Times New Roman">&#273;i&#7875;m &#273;&#7863;c bi&#7879;t c&#7911;a Li</FONT>nux l&agrave; c&oacute; nhi&#7873;u shell kh&aacute;c nhau.</P><STRONG><P ALIGN="JUSTIFY">&nbsp;</P><P ALIGN="JUSTIFY" class="cap1"><a name="tochuc">II.
T&#7892; CH&#7912;C H&#7878; TH&#7888;NG</a></P></STRONG><B><FONT SIZE=4><P ALIGN="JUSTIFY" class="cap2"><a name="httaptin"><img border="0" src="images/read_single.gif" width="15" height="12">
II.1 H&#7879; th&#7889;ng t&#7853;p tin</a></P>

</FONT>

</B>
<blockquote>
<P ALIGN="JUSTIFY">M&#7897;t trong nh&#7919;ng <FONT FACE="Times New Roman">&#273;&#7863;c &#273;i&#7875;m quan tr&#7885;ng c&#7911;a Linux l</FONT>&agrave; n&oacute; h&#7895; tr&#7907; nhi&#7873;u h&#7879; th&#7889;ng t&#7853;p tin. <FONT FACE="Times New Roman">&#272;i&#7873;u n</FONT>&agrave;y l&agrave;m cho n&oacute; r&#7845;t linh <FONT FACE="Times New Roman">&#273;&#7897;ng v</FONT>&agrave; c&oacute; th&#7875; c&ugrave;ng t&#7891;n t&#7841;i v&#7899;i nhi&#7873;u h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh kh&aacute;c. T&#7915; nh&#7919;ng phi&ecirc;n b&#7843;n <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n, Linux <FONT FACE="Times New Roman">&#273;</FONT>&atilde; h&#7895; tr&#7907; 15 lo&#7841;i t&#7853;p tin&nbsp;: ext, ext2, xia, minix, umsdos, msdos, vfat, proc, smb, ncp, iso9660, sysv, hpfs, affs v&agrave; ufs.</P>
<P ALIGN="JUSTIFY">Trong Linux, c&#361;ng nh&#432; Unix, h&#7879; th&#7889;ng t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c truy xu&#7845;t th&ocirc;ng qua m&#7897;t c&#7845;u tr&uacute;c c&acirc;y th&#7915;a k&#7871; <FONT FACE="Times New Roman">&#273;</FONT>&#417;n thay v&igrave; l&agrave; c&aacute;c thi&#7871;t b&#7883; x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh (nh</FONT>&#432; t&ecirc;n &#7893; <FONT FACE="Times New Roman">&#273;&#297;a ho&#7863;c s&#7889; hi&#7879;u c&#7911;a &#7893; &#273;&#297;a). Linux th</FONT>&ecirc;m nh&#7919;ng h&#7879; th&#7889;ng t&#7853;p tin m&#7899;i v&agrave;o c&acirc;y n&agrave;y khi n&oacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi&#7871;t l&#7853;p (mount). T&#7845;t c&#7843; h&#7879; th&#7889;ng t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi&#7871;t l&#7853;p v&agrave;o m&#7897;t th&#432; m&#7909;c v&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; th&#432; m&#7909;c thi&#7871;t l&#7853;p.&nbsp;</P>
<P ALIGN="JUSTIFY">Khi m&#7897;t <FONT FACE="Times New Roman">&#273;&#297;a &#273;</FONT>&#432;&#7907;c kh&#7903;i t&#7841;o, tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a &#273;</FONT>&#432;&#7907;c chia th&agrave;nh nhi&#7873;u partitions. M&#7895;i partition c&oacute; m&#7897;t h&#7879; th&#7889;ng t&#7853;p tin. H&#7879; th&#7889;ng t&#7853;p tin c&#7911;a Linux coi nh&#7919;ng thi&#7871;t b&#7883; kh&#7889;i m&#7897;t c&aacute;ch <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n nh&#432; l&agrave; m&#7897;t t&#7853;p h&#7907;p tuy&#7871;n t&iacute;nh c&aacute;c kh&#7889;i m&agrave; kh&ocirc;ng quan t&acirc;m <FONT FACE="Times New Roman">&#273;&#7871;n t&#7893; ch&#7913;c v&#7853;t lý tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a. Ch</FONT>&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; kh&#7889;i ch&#7883;u trách nhi&#7879;m ánh x&#7841; kh&#7889;i c&#7847;n &#273;&#7885;c th</FONT>&agrave;nh v&#7883; tr&iacute; v&#7853;t l&yacute; c&#7909; th&#7875; tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a.</FONT>&nbsp;</P>
<P ALIGN="JUSTIFY">Trong h&#7879; th&#7889;ng t&#7853;p tin c&#7911;a Linux, ng&#432;&#7901;i s&#7917; d&#7909;ng kh&ocirc;ng quan t&acirc;m <FONT FACE="Times New Roman">&#273;&#7871;n nh&#7919;ng khác bi&#7879;t c&#7911;a chúng tr</FONT>&ecirc;n nh&#7919;ng thi&#7871;t b&#7883; v&#7853;t l&yacute; kh&aacute;c nhau. H&#7879; th&#7889;ng t&#7853;p tin kh&ocirc;ng ch&#7881; tr&ecirc;n h&#7879; th&#7889;ng c&#7909;c b&#7897; m&agrave; c&ograve;n l&agrave; nh&#7919;ng &#7893; <FONT FACE="Times New Roman">&#273;&#297;a t&#7915; xa tr</FONT>&ecirc;n m&#7841;ng. V&iacute; d&#7909; m&#7897;t h&#7879; th&#7889;ng t&#7853;p tin c&#7911;a Linux&nbsp;:</P>
  <blockquote>
    <div align="center">
      <center>
      <table border="0" cellpadding="0" cellspacing="0" width="60%">
        <tr>
          <td width="13%">A</td>
          <td width="13%">E</td>
          <td width="13%">boot</td>
          <td width="17%">etc</td>
          <td width="14%">lib</td>
          <td width="7%">opt</td>
          <td width="10%">tmp</td>
        </tr>
        <tr>
          <td width="13%">C</td>
          <td width="13%">F</td>
          <td width="13%">cdrom</td>
          <td width="17%">fd</td>
          <td width="14%">proc</td>
          <td width="7%">root</td>
          <td width="10%">var</td>
        </tr>
        <tr>
          <td width="13%">D</td>
          <td width="13%">bin</td>
          <td width="13%">dev</td>
          <td width="17%">home</td>
          <td width="14%">mnt</td>
          <td width="7%">lost+found</td>
          <td width="10%"><b>.....</b></td>
        </tr>
      </table>
      </center>
    </div>
  </blockquote>
<P ALIGN="JUSTIFY">H&#7879; th&#7889;ng t&#7853;p tin <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n Linux h&#7895; tr&#7907; l&agrave; Minix cho ph&eacute;p t&#7853;p tin c&oacute; t&ecirc;n t&#7889;i <FONT FACE="Times New Roman">&#273;a l</FONT>&agrave; 14 k&yacute; t&#7921; v&agrave; k&iacute;ch th&#432;&#7899;c kh&ocirc;ng v&#432;&#7907;t qu&aacute; 64Mb. H&#7879; th&#7889;ng t&#7853;p tin <FONT FACE="Times New Roman">&#273;&#7863;c th</FONT>&ugrave; <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n c&#7911;a Linux l&agrave; ‘h&#7879; th&#7889;ng t&#7853;p tin m&#7903; r&#7897;ng’ (EXT) <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c gi&#7899;i thi&#7879;u v&agrave;o th&aacute;ng 4/1992, h&#7879; th&#7889;ng n&agrave;y kh&ocirc;ng hi&#7879;u qu&#7843; n&ecirc;n sau <FONT FACE="Times New Roman">&#273;ó v</FONT>&agrave;o n<FONT FACE="Times New Roman">&#259;m 1993 ‘h&#7879; th&#7889;ng</FONT> t&#7853;p tin m&#7903; r&#7897;ng th&#7871; h&#7879; 2’ <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&ecirc;m v&agrave;o.</P>
<P ALIGN="JUSTIFY">C&oacute; m&#7897;t <FONT FACE="Times New Roman">&#273;i&#7875;m quan tr&#7885;ng khi h&#7879; th&#7889;ng t&#7853;p tin EXT &#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o Linux. H&#7879; th&#7889;ng t&#7853;p tin th&#7853;t b&#7883; t&aacute;ch kh&#7887;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh v&agrave; c&aacute;c d&#7883;ch v&#7909; h&#7879; th&#7889;ng b&#7857;ng m&#7897;t t&#7847;ng giao ti&#7871;p g&#7885;i l&agrave; h&#7879; th&#7889;ng t&#7853;p tin &#7843;o VFS. VFS cho ph&eacute;p Linux h&#7895; tr&#7907; nhi&#7873;u lo&#7841;i h&#7879; th&#7889;ng t&#7853;p tin kh&aacute;c nhau, m&#7895;i lo&#7841;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c xem nh&#432; l&agrave; m&#7897;t giao ti&#7871;p ph&#7847;n m&#7873;m v&#7899;i VFS. T&#7845;t c&#7843; chi ti&#7871;t c&#7911;a h&#7879; th&#7889;ng t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i sao cho chúng xu&#7845;t hi&#7879;n nh</FONT>&#432; nhau <FONT FACE="Times New Roman">&#273;&#7889;i v&#7899;i ph&#7847;n c</FONT>&ograve;n l&#7841;i c&#7911;a h&#7841;t nh&acirc;n Linux v&agrave; c&aacute;c ch&#432;&#417;ng tr&igrave;nh thi h&agrave;nh trong h&#7879; th&#7889;ng. L&#7899;p VFS cho ph&eacute;p thi&#7871;t l&#7853;p m&#7897;t c&aacute;ch trong su&#7889;t nhi&#7873;u h&#7879; th&#7889;ng t&#7853;p tin kh&aacute;c nhau c&ugrave;ng l&uacute;c. VFS <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t sao cho vi&#7879;c truy xu&#7845;t các t&#7853;p tin c&#7911;a nó nhanh nh&#7845;t có th&#7875; v</FONT>&agrave; n&oacute; c&#361;ng <FONT FACE="Times New Roman">&#273;&#7843;m b&#7843;o tính chính xác khi truy xu&#7845;t. </P>
</FONT>
<P ALIGN="JUSTIFY">VFS <FONT FACE="Times New Roman">&#273;&#7863;t các thôn</FONT>g tin c&#7911;a m&#7895;i h&#7879; th&#7889;ng t&#7853;p tin v&agrave;o b&#7897; nh&#7899; m&#7895;i khi ch&uacute;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi&#7871;t l&#7853;p v&agrave; s&#7917; d&#7909;ng. C&aacute;c c&#7845;u tr&uacute;c d&#7919; li&#7879;u m&ocirc; t&#7843; t&#7853;p tin v&agrave; th&#432; m&#7909;c truy xu&#7845;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o v&agrave; h&#7911;y th&#432;&#7901;ng tr&#7921;c. Khi c&aacute;c kh&#7889;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c truy xu&#7845;t, ch&uacute;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7863;t v</FONT>&agrave;o v&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7879;m. V</FONT>&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7879;m không ch&#7881; l</FONT>&#432;u gi&#7919; d&#7919; li&#7879;u m&agrave; c&ograve;n h&#7895; tr&#7907; qu&#7843;n l&yacute; giao ti&#7871;p kh&ocirc;ng  <FONT FACE="Times New Roman">&#273;&#7891;ng b&#7897; v&#7899;i b&#7897; ph&#7853;n &#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; kh&#7889;i.</P>
</FONT>
<B><I><P ALIGN="JUSTIFY">‘h&#7879; th&#7889;ng t&#7853;p tin m&#7903; r&#7897;ng th&#7871; h&#7879; 2’ EXT2</P>
</B></I>
  <blockquote>
<P ALIGN="JUSTIFY">L&agrave; h&#7879; th&#7889;ng t&#7853;p tin th&agrave;nh c&ocirc;ng nh&#7845;t c&#7911;a Linux. H&#7879; th&#7889;ng n&agrave;y, c&#361;ng nh&#432; c&aacute;c h&#7879; th&#7889;ng t&#7853;p tin kh&aacute;c, <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c x&acirc;y d&#7921;ng tr&ecirc;n c&#417; s&#7903; c&aacute;c kh&#7889;i d&#7919; li&#7879;u. C&aacute;c kh&#7889;i d&#7919; li&#7879;u n&agrave;y c&oacute; c&ugrave;ng k&iacute;ch th&#432;&#7899;c v&agrave; m&#7885;i k&iacute;ch th&#432;&#7899;c t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&agrave;m tr&ograve;n th&agrave;nh m&#7897;t s&#7889; nguy&ecirc;n c&aacute;c kh&#7889;i n&agrave;y.</P>
<P ALIGN="JUSTIFY">EXT2 <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a h&#7879; th&#7889;ng t&#7853;p tin b&#7857;ng cách mô t&#7843; m&#7895;i t&#7853;p tin trong h&#7879; th&#7889;ng b&#7857;ng m&#7897;t c&#7845;u trúc I-node duy nh&#7845;t v</FONT>&agrave; m&#7895;i inode c&oacute; m&#7897;t s&#7889; <FONT FACE="Times New Roman">&#273;&#7875; &#273;&#7883;nh danh. Các I-node n</FONT>&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7863;t trong b&#7843;ng I-node. Các th</FONT>&#432; m&#7909;c trong EXT2 <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c xem nh&#432; nh&#7919;ng t&#7853;p tin <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t ch&#7913;a nh&#7919;ng con tr&#7887; &#273;&#7871;n các i-node c&#7911;a các entry.</P>
</FONT>
<P ALIGN="JUSTIFY">H&igrave;nh 15.1 cho th&#7845;y t&#7893;ng quan c&#7911;a h&#7879; th&#7889;ng t&#7853;p tin EXT2. H&#7879; th&#7889;ng n&agrave;y chia nh&#7919;ng partitions m&agrave; n&oacute; qu&#7843;n l&yacute; v&agrave;o c&aacute;c Block Group. </P>
<P ALIGN="center"><img border="0" src="images/hinh15.1.gif" width="544" height="257"> </P>
  </blockquote>
</blockquote>

<B><FONT FACE="Times New Roman" SIZE=4><P ALIGN="JUSTIFY" class="cap2"><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="dieukhien">II.2 &#272;i&#7873;u khi&#7875;n thi&#7871;t b&#7883;</a></P>

</FONT>

</B>
<blockquote>
<P ALIGN="JUSTIFY">Nh&#432; <FONT FACE="Times New Roman">&#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;&#7873; c&#7853;p trong ph&#7847;n qu&#7843;n lý nh&#7853;p xu&#7845;t, m&#7897;t trong nh&#7919;ng m&#7909;c ti</FONT>&ecirc;u ch&iacute;nh c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&agrave; gi&uacute;p cho ng&#432;&#7901;i s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p v&#7899;i thi&#7871;t b&#7883;. Trong Linux, các thi&#7871;t b&#7883; ph&#7847;n c&#7913;</FONT>&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7873;u &#273;</FONT>&#432;&#7907;c xem nh&#432; l&agrave; c&aacute;c t&#7853;p tin th&ocirc;ng th&#432;&#7901;ng : ch&uacute;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c m&#7903;, <FONT FACE="Times New Roman">&#273;óng , &#273;&#7885;c , ghi, v</FONT>&agrave; s&#7917; d&#7909;ng c&ugrave;ng nh&#7919;ng l&#7901;i g&#7885;i h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#7875; thao tác. M&#7885;i thi&#7871;t b&#7883; trong h&#7879; th&#7889;ng &#273;&#7873;u &#273;</FONT>&#432;&#7907;c bi&#7875;u di&#7877;n b&#7903;i c&aacute;c t&#7853;p tin thi&#7871;t b&#7883;, v&iacute; d&#7909; <FONT FACE="Times New Roman">&#273;&#297;a IDE &#273;&#7847;u ti</FONT>&ecirc;n c&#7911;a h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c bi&#7875;u di&#7877;n b&#7903;i <I>/dev/hda</I>.</P>
<P ALIGN="JUSTIFY">Linux &aacute;nh x&#7841; t&#7853;p tin thi&#7871;t b&#7883; v&agrave;o c&aacute;c l&#7901;i g&#7885;i h&#7879; th&#7889;ng. Linux h&#7895; tr&#7907; ba lo&#7841;i thi&#7871;t b&#7883; l&agrave;&nbsp;: k&yacute; t&#7921;, kh&#7889;i v&agrave; m&#7841;ng. C&oacute; nhi&#7873;u ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; khác nhau trong h&#7841;t nhân c&#7911;a Linux  nh</FONT>&#432;ng ch&uacute;ng c&ugrave;ng chia x&#7867; nh&#7919;ng thu&#7897;c t&iacute;nh chung&nbsp;:</P>
<P ALIGN="JUSTIFY">M&atilde; ngu&#7891;n c&#7911;a h&#7841;t nh&acirc;n&nbsp;: ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; l</FONT>&agrave; m&#7897;t ph&#7847;n c&#7911;a h&#7841;t nh&acirc;n v&agrave; c&#361;ng nh&#432; nh&#7919;ng <FONT FACE="Times New Roman">&#273;o&#7841;n m</FONT>&atilde; ngu&#7891;n kh&aacute;c n&#7871;u n&oacute; b&#7883; l&#7895;i n&oacute; c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;e d&#7885;a nghi</FONT>&ecirc;m tr&#7885;ng <FONT FACE="Times New Roman">&#273;&#7871;n h&#7879; th&#7889;ng.</P>
</FONT>
<P ALIGN="JUSTIFY">Ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; cung c&#7845;p m&#7897;t giao ti&#7871;p chu&#7849;n v&#7899;i h&#7841;t nhân c&#7911;a Linux. Chúng s&#7917; d&#7909;ng nh&#7919;ng d&#7883;ch v&#7909; chu&#7849;n t&#7915; h&#7841;t nhân n</FONT>&agrave;y.</P>
<P ALIGN="JUSTIFY">H&#7847;u h&#7871;t c&aacute;c ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; c&#7911;a Linux &#273;</FONT>&#432;&#7907;c n&#7841;p nh&#432; nh&#7919;ng <FONT FACE="Times New Roman">&#273;</FONT>&#417;n th&#7875; c&#7911;a h&#7841;t nh&acirc;n khi c&oacute; y&ecirc;u c&#7847;u v&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7905; ra khi n&oacute; kh&ocirc;ng c&ograve;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng n&#7919;a.</P>
<P ALIGN="JUSTIFY">Khi kh&#7903;i <FONT FACE="Times New Roman">&#273;&#7897;ng h&#7879; th&#7889;ng m&#7895;i ch</FONT>&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; &#273;</FONT>&#432;&#7907;c kh&#7903;i t&#7841;o v&agrave; n&oacute; s&#7869; t&igrave;m thi&#7871;t b&#7883; ph&#7847;n c&#7913;ng m&agrave; n&oacute; s&#7869; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n.</P>
</FONT>
<P ALIGN="JUSTIFY">Linux s&#7917; d&#7909;ng c&#417; ch&#7871; DMA v&agrave; s&#7917; d&#7909;ng m&#7897;t vector c&#7845;u tr&uacute;c <B><I>dma_chan</B></I> <FONT FACE="Times New Roman">&#273;&#7875; qu&#7843;n lý các k</FONT>&ecirc;nh DMA (m&#7895;i k&ecirc;nh c&oacute; m&#7897;t vector).</P>
<P ALIGN="JUSTIFY">M&#7895;i l&#7899;p <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883;&nbsp;: ký t&#7921;, kh&#7889;i, m&#7841;ng cung c&#7845;p nh&#7919;ng giao ti&#7871;p chung v&#7899;i h&#7841;t nhân. Khi m&#7897;t thi&#7871;t b&#7883; &#273;</FONT>&#432;&#7907;c kh&#7903;i t&#7841;o, thanh ghi <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; b</FONT>&ecirc;n trong h&#7841;t nh&acirc;n c&#7911;a Linux <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&ecirc;m m&#7897;t entry trong vector chrdevs c&#7911;a c&#7845;u tr&uacute;c <B><I>devive_struct</B></I>. M&#7897;t <FONT FACE="Times New Roman">&#273;&#7883;nh danh(id) &#273;</FONT>&#432;&#7907;c x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh cho vector n</FONT>&agrave;y v&agrave; l&agrave; c&#7889; <FONT FACE="Times New Roman">&#273;&#7883;nh. M&#7895;i entry trong vector </FONT><B><I>chrdevs</B></I>, m&#7897;t device_struct g&#7891;m hai ph&#7847;n t&#7917; : m&#7897;t con tr&#7887; <FONT FACE="Times New Roman">&#273;&#7871;n t</FONT>&ecirc;n c&#7911;a thanh ghi <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; v</FONT>&agrave; m&#7897;t con tr&#7887; t&#7899;i kh&#7889;i c&#7911;a t&#7853;p tin thao t&aacute;c. Kh&#7889;i c&#7911;a t&#7853;p tin thao t&aacute;c n&agrave;y l&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#7911;a nh&#7919;ng th&#7911;</FONT> t&#7909;c trong ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; m</FONT>&agrave; ch&uacute;ng ki&#7875;m so&aacute;t nh&#7919;ng thao t&aacute;c nh&#432; m&#7903;, <FONT FACE="Times New Roman">&#273;óng, &#273;&#7885;c, ghi. N&#7897;i dung c&#7911;a </FONT><I>/proc/devices</I> cho c&aacute;c thi&#7871;t b&#7883; k&yacute; t&#7921; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#7845;y t&#7915; vector <B><I>chrdevs</B></I>.</P>
<P ALIGN="JUSTIFY">C&aacute;c thi&#7871;t b&#7883; kh&#7889;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c truy xu&#7845;t nh&#432; nh&#7919;ng t&#7853;p tin. Linux qu&#7843;n l&yacute; c&aacute;c thanh ghi thi&#7871;t b&#7883; kh&#7889;i b&#7857;ng vector <B><I>blkdevs</B></I>, v&agrave; t&#432;&#417;ng t&#7921; nh&#432; vector chrdevs m&#7895;i entry c&#7911;a n&oacute; l&agrave; c&aacute;c c&#7845;u tr&uacute;c <B><I>device_struct</B></I> nh&#432;ng c&oacute; hai lo&#7841;i thi&#7871;t b&#7883; kh&#7889;i&nbsp;: SCSI v&agrave; IDE. M&#7895;i ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; kh&#7889;i ph&#7843;i cung c&#7845;p m&#7897;t giao ti&#7871;p v&#7899;i v</FONT>&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7879;m c&#361;ng nh</FONT>&#432; nh&#7919;ng thao t&aacute;c t&#7853;p tin th&ocirc;n th&#432;&#7901;ng. C&#7845;u tr&uacute;c <B><I>blk_dev_struct</B></I> bao g&#7891;m <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#7911;a các th&#7911; t&#7909;c &#273;</FONT>&#432;&#7907;c y&ecirc;u c&#7847;u v&agrave; m&#7897;t con tr&#7887; <FONT FACE="Times New Roman">&#273;&#7871;n nh&#7919;ng c&#7845;u trúc d&#7919; li&#7879;u c&#7847;n thi&#7871;t, m&#7895;i c&#7845;u trúc n</FONT>&agrave;y s&#7869; <FONT FACE="Times New Roman">&#273;&#7841;i di&#7879;n cho m&#7897;t y</FONT>&ecirc;u c&#7847;u t&#7915; v&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7879;m cho nh&#7919;ng &#273;i&#7873;u khi&#7875;n &#273;&#7885;c ho&#7863;c ghi m&#7897;t kh&#7889;i d&#7919; li&#7879;u.</P>
</FONT>
<P ALIGN="JUSTIFY">Trong Linux, m&#7895;i thi&#7871;t b&#7883; m&#7841;ng l&agrave; m&#7897;t th&#7921;c th&#7875; c&oacute; th&#7875; nh&#7853;n ho&#7863;c g&#7917;i g&oacute;i d&#7919; li&#7879;u. M&#7895;i thi&#7871;t b&#7883; m&#7841;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c bi&#7875;u di&#7877;n b&#7857;ng m&#7897;t c&#7845;u tr&uacute;c <B><I>device</B></I>. C&aacute;c ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; m&#7841;ng s&#7869; ghi nh&#7853;n nh&#7919;ng thi&#7871;t b&#7883; m</FONT>&agrave; ch&uacute;ng s&#7869; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n trong quá</FONT> tr&igrave;nh kh&#7903;i t&#7841;o m&#7841;ng l&uacute;c kh&#7903;i <FONT FACE="Times New Roman">&#273;&#7897;ng h&#7879; th&#7889;ng. C&#7845;u trúc </FONT><B><I>device</B></I> ch&#7913;a nh&#7919;ng th&ocirc;ng tin v&#7873; c&aacute;c thi&#7871;t b&#7883; v&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; c&#7911;a các h</FONT>&agrave;m h&#7895; tr&#7907; nh&#7919;ng nghi th&#7913;c v&agrave; d&#7883;ch v&#7909; m&#7841;ng kh&aacute;c nhau. Nh&#7919;&otilde;ng h&agrave;m n&agrave;y ch&#7911; y&#7871;u t&#7853;p trung v&agrave;o vi&#7879;c chuy&#7875;n d&#7919; li&#7879;u s&#7917; d&#7909;ng c&aacute;c thi&#7871;t b&#7883; m&#7841;ng. c&aacute;c thi&#7871;t b&#7883; s&#7917; d&#7909;ng c&aacute;c c&#417; ch&#7871; h&#7895; tr&#7907; m&#7841;ng chu&#7849;n <FONT FACE="Times New Roman">&#273;&#7875; chuy&#7875;n d&#7919; li&#7879;u nh&#7853;n &#273;</FONT>&#432;&#7907;c cho l&#7899;p nghi th&#7913;c th&iacute;ch h&#7907;p. T&#7845;t c&#7843; c&aacute;c g&oacute;i d&#7919; li&#7879;u chuy&#7875;n v&agrave; nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c bi&#7875;u di&#7877;n b&#7903;i c&#7845;u tr&uacute;c <B><I>sk_buff</B></I>, <FONT FACE="Times New Roman">&#273;ây l</FONT>&agrave; m&#7897;t c&#7845;u tr&uacute;c linh <FONT FACE="Times New Roman">&#273;&#7897;ng cho phép các ti</FONT>&ecirc;u <FONT FACE="Times New Roman">&#273;&#7873; (header) nghi th&#7913;c m&#7841;ng </FONT>c&oacute; th&#7875; d&#7875; d&agrave;ng th&ecirc;m v&agrave;o ho&#7863;c lo&#7841;i b&#7887;.</P>
<P ALIGN="JUSTIFY">C&#7845;u tr&uacute;c <B><I>device</B></I> l&#432;u nh&#7919;ng th&ocirc;ng tin v&#7873; thi&#7871;t b&#7883; m&#7841;ng&nbsp;: t&ecirc;n, th&ocirc;ng tin v&#7873; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng truy&#7873;n, c&#7901; tr&#7841;ng th&aacute;i giao ti&#7871;p(m&ocirc; t&#7843; c&aacute;c thu&#7897;c t&iacute;nh v&agrave; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng c&#7911;a các thi&#7871;t b&#7883; m&#7841;ng), thông tin v&#7873; nghi th&#7913;c, h</FONT>&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i gói tin(&#273;ây l</FONT>&agrave; h&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i c&#7911;a các gói </FONT><B><I>sk_buff</B></I> ch&#7901; chuy&#7875;n d&#7919; li&#7879;u tr&ecirc;n thi&#7871;t b&#7883; m&#7841;ng <FONT FACE="Times New Roman">&#273;ó), các h</FONT>&agrave;m h&#7895; tr&#7907; (m&#7895;i thi&#7871;t b&#7883; cung c&#7845;p m&#7897;t t&#7853;p h&#7907;p c&aacute;c th&#7911; t&#7909;c chu&#7849;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i b&#7903;i l&#7899;p nghi th&#7913;c).</P>
</blockquote>
<P ALIGN="JUSTIFY"></P>

<B><FONT SIZE=4><P ALIGN="JUSTIFY" class="cap2"><a name="qltientrinh"><img border="0" src="images/read_single.gif" width="15" height="12">
II.3 Qu&#7843;n l&yacute; ti&#7871;n tr&igrave;nh</a></P>

</FONT>

</B>
<blockquote>
<P ALIGN="JUSTIFY">M&#7895;i ti&#7871;n tr&igrave;nh trong Linux <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c bi&#7875;u di&#7877;n b&#7857;ng m&#7897;t c&#7845;u tr&uacute;c d&#7919; li&#7879;u <B><I>task_struct</B></I> (task c&oacute; ngh&#297;a l&agrave; ti&#7871;n tr&igrave;nh trong Linux). Linux s&#7917; d&#7909;ng <B><I>task</B></I> vector <FONT FACE="Times New Roman">&#273;&#7875; qu&#7843;n lý các con tr&#7887; &#273;&#7871;n các </FONT><B><I>task_struct</B></I>, m&#7863;c <FONT FACE="Times New Roman">&#273;&#7883;nh l</FONT>&agrave; c&oacute; 512 ph&#7847;n t&#7917;. Khi m&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o ra, m&#7897;t <B><I>task_struct</B></I> m&#7899;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7845;p ph&aacute;t trong b&#7897; nh&#7899; v&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&ecirc;m v&agrave;o vector <B><I>task</B></I>. Linux h&#7895; tr&#7907; hai lo&#7841;i ti&#7871;n tr&igrave;nh l&agrave; lo&#7841;i b&igrave;nh th&#432;&#7901;ng v&agrave; lo&#7841;i th&#7901;i gian th&#7921;c. C&#7845;u tr&uacute;c <B><I>task_struct</B></I> g&#7891;n nh&#7919;ng tr&#432;&#7901;ng nh&#432; sau&nbsp;: tr&#7841;ng th&aacute;i (thi h&agrave;nh, ch&#7901;, ng&#432;ng, l&#432;ng ch&#7915;ng), th&ocirc;ng tin l&#7853;p l&#7883;ch, <FONT FACE="Times New Roman">&#273;&#7883;nh danh, thông tin li</FONT>&ecirc;n l&#7841;c gi&#7919;a c&aacute;c ti&#7871;n tr&igrave;nh, li&ecirc;n k&#7871;t, <FONT FACE="Times New Roman">&#273;&#7883;nh th&#7901;i gian, h&#7879; th&#7889;ng t&#7853;p tin, b&#7897; nh&#7899; &#7843;o, ng&#7919; c&#7843;nh.</P>
</FONT>
<P ALIGN="JUSTIFY">Trong Linux c&#361;ng nh&#432;  Unix, ch&#432;&#417;ng tr&igrave;nh v&agrave; l&#7879;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n theo c&#417; ch&#7871; th&ocirc;ng d&#7883;ch. B&#7897; th&ocirc;ng d&#7883;ch <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; shell. Linux h&#7895; tr&#7907; nhi&#7873;u lo&#7841;i shell nh&#432; sh, bash, tcsh.  T&#7853;p tin thi h&agrave;nh c&oacute; nhi&#7873;u d&#7841;ng, d&#7841;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng th&ocirc;ng d&#7909;ng nh&#7845;t trong Linux l&agrave; EFL, ngo&agrave;i ra Linux c&#361;ng c&oacute; th&#7875; hi&#7875;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c nhi&#7873;u d&#7841;ng t&#7853;p tin kh&aacute;c.</P>
<P ALIGN="JUSTIFY">C&aacute;c c&#417; ch&#7871; th&ocirc;ng tin li&ecirc;n l&#7841;c gi&#7919;a c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng l&agrave; t&iacute;n hi&#7879;u (SIGNALS), <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng &#7889;ng (PIPE), sockets, semaphore v&agrave; b&#7897; nh&#7899; chia x&#7867;.</P>
<P ALIGN="JUSTIFY">C&oacute; m&#7897;t t&#7853;p h&#7907;p c&aacute;c t&iacute;n hi&#7879;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a tr</FONT>&#432;&#7899;c, c&aacute;c t&iacute;nh hi&#7879;u n&agrave;y c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&aacute;t sinh b&#7903;i h&#7841;t nh&acirc;n ho&#7863;c nh&#7919;ng ti&#7871;n tr&igrave;nh kh&aacute;c trong b&#7897; nh&#7899;. Linux c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t các tín hi&#7879;u trong </FONT><B><I>task_struct</B></I>. Kh&ocirc;ng ph&#7843;i m&#7885;i ti&#7871;n tr&igrave;nh trong h&#7879; th&#7889;ng c&oacute; th&#7875; g&#7917;i t&iacute;n hi&#7879;u <FONT FACE="Times New Roman">&#273;&#7871;n m&#7885;i ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c. T&iacute;n hi&#7879;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&aacute;t sinh b&#7857;ng c&aacute;ch thi&#7871;t l&#7853;p m&#7897;t bit th&iacute;ch h&#7907;p trong tr&#432;&#7901;ng signal c&#7911;a c&#7845;u tr&uacute;c <B><I>task_struct</B></I>. T&iacute;n hi&#7879;u kh&ocirc;ng xu&#7845;t hi&#7879;n cho ti&#7871;n tr&igrave;nh ngay khi n&oacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o m&agrave; ph&#7843;i ch&#7901; <FONT FACE="Times New Roman">&#273;&#7871;n khi ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n tr&#7903; l&#7841;i.</P>
<P ALIGN="JUSTIFY">Trong Linux c&#417; ch&#7871; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng &#7889;ng c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t s&#7917; d&#7909;ng hai c&#7845;u trúc file tr&#7887; &#273;&#7871;n c</FONT>&ugrave;ng inode VFS t&#7841;m th&#7901;i x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh m&#7897;t trang v&#7853;t lý trong b&#7897; nh&#7899;. Khi ti&#7871;n tr</FONT>&igrave;nh ghi th&#7921;c hi&#7879;n vi&#7879;c ghi v&agrave;o <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng &#7889;ng, c&aacute;c byte s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ch&eacute;p v&agrave;o trang d&#7919; li&#7879;u chia s&#7867;. Linux ph&#7843;i <FONT FACE="Times New Roman">&#273;&#7891;ng b&#7897; quá tr</FONT>&igrave;nh truy xu&#7845;t trong <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng &#7889;ng. Ti&#7871;n tr&igrave;nh ghi s&#7917; d&#7909;ng c&aacute;c h&agrave;m th&#432; vi&#7879;n ghi chu&#7849;n.</P>
<P ALIGN="JUSTIFY">C&aacute;c c&#417; ch&#7871; socket, semaphores v&agrave; b&#7897; nh&#7899; chia s&#7867; c&#7911;a Linux g&#7847;n gi&#7889;ng v&#7899;i h&#7879; th&#7889;ng Unix System V.</P>
</blockquote>

<B><FONT SIZE=4><P ALIGN="JUSTIFY" class="cap2"><a name="qlbonho"><img border="0" src="images/read_single.gif" width="15" height="12">
II.4 Qu&#7843;n l&yacute; b&#7897; nh&#7899;</a></P>

</FONT>

</B>
<blockquote>
<P ALIGN="JUSTIFY">Linux h&#7895; tr&#7907; h&#7879; th&#7889;ng chia s&#7867; b&#7897; nh&#7899; IPC (Inter Process Communication- th&ocirc;ng tin li&ecirc;n l&#7841;c gi&#7919;a c&aacute;c ti&#7871;n tr&igrave;nh) c&#7911;a Unix System V.</P>
<P ALIGN="JUSTIFY">Linux s&#7917; d&#7909;ng b&#7897; nh&#7899; &#7843;o v&agrave; c&#417; ch&#7871; ph&acirc;n trang. Tr&ecirc;n h&#7879; th&#7889;ng Alpha AXP m&#7897;t trang c&oacute; k&iacute;ch th&#432;&#7899;c 8Kb v&agrave; tr&ecirc;n h&#7879; th&#7889;ng Intel x86 m&#7897;t trang c&oacute; k&iacute;ch th&#432;&#7899;c 4Kb. Chi&#7871;n l&#432;&#7907;c thay trang <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c &aacute;p d&#7909;ng l&agrave; LRU. </P>
<P ALIGN="JUSTIFY">Linux c&oacute; s&#7889; c&#7845;p b&#7843;ng trang t&ugrave;y v&agrave;o c&aacute;c n&#7873;n kh&aacute;c nhau (Alpha 3, Intel x86 2). B&#7843;ng trang s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chuy&#7875;n th&agrave;nh c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7863;c th</FONT>&ugrave; tr&ecirc;n c&aacute;c n&#7873;n kh&aacute;c nhau, <FONT FACE="Times New Roman">&#273;i&#7873;u n</FONT>&agrave;y gi&uacute;p cho vi&#7879;c thao t&aacute;c tr&ecirc;n b&#7843;ng trang kh&ocirc;ng l&#7879; thu&#7897;c v&agrave;o c&aacute;c n&#7873;n n&agrave;y.</P>
<P ALIGN="JUSTIFY">Linux s&#7917; d&#7909;ng thu&#7853;t to&aacute;n Buddy <FONT FACE="Times New Roman">&#273;&#7875; th&#7921;c hi&#7879;n vi&#7879;c c&#7845;p phát v</FONT>&agrave; thu h&#7891;i c&aacute;c kh&#7889;i c&#7911;a trang. ( 1 kh&#7889;i = 1, 2, ho&#7863;c 4 trang...)</P>

</blockquote>

<P>&nbsp;</P>
<STRONG>
<P ALIGN="JUSTIFY"><font size="4" color="#FF0000"><img border="0" src="images/blebul1a.gif" width="20" height="20">
<a name="cauhoi">C&acirc;u h&#7887;i ki&#7875;m tra ki&#7871;n th&#7913;c</a></font></P></STRONG></font>
<blockquote>
  <FONT FACE="Times New Roman"><P>1. Cho bi&#7871;t qu&aacute; tr&igrave;nh ph&aacute;t tri&#7875;n c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh Linux.</P>
<P>2. N&ecirc;u nh&#7919;ng <FONT FACE="Times New Roman">&#273;&#7863;c &#273;i&#7875;m n&#7893;i b&#7853;t c&#7911;a h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh Linux.</P>
<P>3. H&#7879; th&#7889;ng qu&#7843;n l&yacute; t&#7853;p tin c&#7911;a Linux c&oacute; g&igrave; <FONT FACE="Times New Roman">&#273;&#7863;c bi&#7879;t ?</P>
</FONT><P>4. Linux qu&#7843;n l&yacute; nh&#7853;p xu&#7845;t nh&#432; th&#7871; n&agrave;o?</P>
<P>5. Theo anh(ch&#7883;), trong t&#432;&#417;ng lai h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh Linux c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng r&#7897;ng r&atilde;i nh&#432; Windows ng&agrave;y nay kh&ocirc;ng&nbsp;? T&#7841;i sao</P>
<P>6. N&#7871;u ph&#7843;i ch&#7885;n m&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;&#7875; c</FONT>&agrave;i l&ecirc;n m&aacute;y PC c&#7911;a m&igrave;nh, anh (ch&#7883;) ch&#7885;n h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh n&agrave;o&nbsp;? T&#7841;i sao&nbsp;?</P>
  </blockquote>
</BODY>
</HTML>
