<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<TITLE>Bao ve va an toan he thong</TITLE>
<META NAME="subject" CONTENT="OS">
<LINK REL="stylesheet" TYPE="text/css" HREF="style.css" TITLE="MTD">
</HEAD>
<BODY LINK="#0000ff">

<P ALIGN="JUSTIFY"><font face="Verdana" size="2"><b>B&agrave;i 13</b></font>              <B><FONT FACE="VNI-Bodon">   </FONT><FONT FACE="Verdana" SIZE=5>B&#7842;O V&#7878; V&Agrave; AN TO&Agrave;N H&#7878; TH&#7888;NG</P></B></FONT>
<B><p ALIGN="JUSTIFY" class="cap1"><a name="caidat">IV. C&agrave;i &#273;&#7863;t ma tr&#7853;n quy&#7873;n truy xu&#7845;t</a><P ALIGN="JUSTIFY" class="cap2"><a name="toancuc"><img border="0" src="images/read_single.gif" width="15" height="12">
 IV.1. B&#7843;ng to&agrave;n c&#7909;c</a></P>
</B>
<blockquote>
  <P ALIGN="JUSTIFY">C&aacute;ch <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n nh&#7845;t <FONT FACE="Times New Roman">&#273;&#7875; c</FONT>&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t ma tr&#7853;n truy xu&#7845;t l</FONT>&agrave; s&#7917; d&#7909;ng m&#7897;t b&#7843;ng bao g&#7891;m c&aacute;c b&#7897; ba th&#7913; t&#7921; &lt; mi&#7873;n b&#7843;o v&#7879;, <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng, c&aacute;c quy&#7873;n truy xu&#7845;t &gt;. M&#7895;i khi th&#7921;c hi&#7879;n thao t&aacute;c <I>M</I> tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng  <I>Oj</I> trong mi&#7873;n b&#7843;o v&#7879; <I>Di</I>, c&#7847;n t&igrave;m trong b&#7843;ng to&agrave;n c&#7909;c m&#7897;t b&#7897; ba &lt;<I> Di, Oj, Rk</I> &gt; m&agrave;  M <FONT FACE="Symbol">&#206;</FONT>
 <I>Rk.</I> N&#7871;u t&igrave;m th&#7845;y, thao t&aacute;c <I>M</I> <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&eacute;p thi h&agrave;nh, n&#7871;u kh&ocirc;ng, x&#7843;y ra l&#7895;i truy xu&#7845;t.</P>
</blockquote>
<B><P ALIGN="JUSTIFY" class="cap2"><a name="danhsach"><img border="0" src="images/read_single.gif" width="15" height="12">
 IV.<FONT FACE="VNI-Times">2.&#9;</FONT>Danh s&aacute;ch quy&#7873;n truy xu&#7845;t ( Access control list _ ACL)</a></P>
</B>
<blockquote>
  <P ALIGN="JUSTIFY">C&oacute; th&#7875; c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t m&#7895;i c&#7897;t trong ma tr&#7853;n quy&#7873;n truy xu&#7845;t nh</FONT>&#432; m&#7897;t danh s&aacute;ch quy&#7873;n truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7889;i v&#7899;i m&#7897;t &#273;&#7889;i t</FONT>&#432;&#7907;ng. M&#7895;i <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng trong h&#7879; th&#7889;ng s&#7869; c&oacute; m&#7897;t danh s&aacute;ch bao g&#7891;m c&aacute;c ph&#7847;n t&#7917; l&agrave; c&aacute;c b&#7897; hai th&#7913; t&#7921;  &lt;mi&#7873;n b&#7843;o v&#7879;, c&aacute;c quy&#7873;n truy xu&#7845;t&gt;, danh s&aacute;ch n&agrave;y s&#7869; x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh các quy&#7873;n truy xu&#7845;t &#273;</FONT>&#432;&#7907;c qui <FONT FACE="Times New Roman">&#273;&#7883;nh trong t&#7915;ng mi&#7873;n b&#7843;o v&#7879; có th&#7875; tác &#273;&#7897;ng tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng. M&#7895;i khi th&#7921;c hi&#7879;n thao t&aacute;c <I>M</I> tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng  <I>Oj</I> trong mi&#7873;n b&#7843;o v&#7879; <I>Di</I>, c&#7847;n t&igrave;m trong danh s&aacute;ch quy&#7873;n truy xu&#7845;t c&#7911;a <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng <I>Oj<SUB>  </I></SUB>m&#7897;t b&#7897; hai &lt;<I> Di,Rk</I> &gt; m&agrave;  M <FONT FACE="Symbol">&#206;</FONT>
 <I>Rk.</I> N&#7871;u t&igrave;m th&#7845;y, thao t&aacute;c <I>M</I> <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&eacute;p thi h&agrave;nh, n&#7871;u kh&ocirc;ng, x&#7843;y ra l&#7895;i truy xu&#7845;t.</P>
</blockquote>
<DIR>

<U><P ALIGN="JUSTIFY">V&iacute; d&#7909;&nbsp;</U>: M&#7897;t mi&#7873;n b&#7843;o v&#7879; trong h&#7879;  th&#7889;ng UNIX  <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh t</FONT>&#432;&#417;ng &#7913;ng v&#7899;i m&#7897;t ng&#432;&#7901;i s&#7917; d&#7909;ng (uid) trong m&#7897;t nh&oacute;m (gid) n&agrave;o <FONT FACE="Times New Roman">&#273;ó. Gi&#7843; s&#7917; có 4 ng</FONT>&#432;&#7901;i d&ugrave;ng&nbsp;: A,B,C,D thu&#7897;c c&aacute;c nh&oacute;m t&#432;&#417;ng &#7913;ng l&agrave; system, staff, student, student. Khi <FONT FACE="Times New Roman">&#273;ó các t&#7853;p tin trong h&#7879; th&#7889;ng có th&#7875; có các ACL nh</FONT>&#432; sau&nbsp;:</P>
<blockquote>
<P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">File0&nbsp;: ( A,*,RWX)</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">File1&nbsp;: ( A,system,RWX)</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">File2&nbsp;: ( A,*,RW-),(B,staff,R--),(D,*,RW-)</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">File3&nbsp;: ( *,student,R--)</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/dotgreen.gif" width="9" height="9">File4&nbsp;: (C,*,---),(*,student,R--)</P>
</blockquote>
<P ALIGN="JUSTIFY">Th&#7921;c t&#7871;, h&#7879; th&#7889;ng t&#7853;p tin trong UNIX <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7843;o v&#7879; b&#7857;ng c&aacute;ch m&#7895;i t&#7853;p tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&aacute;n t&#432;&#417;ng &#7913;ng 9 bit b&#7843;o v&#7879; , t&#7915;ng 3 bit s&#7869; m&ocirc; t&#7843; quy&#7873;ntruy xu&#7845;t R(<FONT FACE="Times New Roman">&#273;&#7885;c), W(ghi) hay X(x&#7917; lý) c&#7911;a các ti&#7871;n tr</FONT>&igrave;nh tr&ecirc;n t&#7853;p tin n&agrave;y theo th&#7913; t&#7921;&nbsp;: ti&#7871;n tr&igrave;nh s&#7905; h&#7919;u c&aacute;c ti&#7871;n tr&igrave;nh c&ugrave;ng nh&oacute;m v&#7899;i ti&#7871;n tr&igrave;nh s&#7905; h&#7919;u, c&aacute;c ti&#7871;n tr&igrave;nh kh&aacute;c. <FONT FACE="Times New Roman">&#272;ây l</FONT>&agrave; m&#7897;t d&#7841;ng ACL nh&#432;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&eacute;n th&agrave;nh 9 bit.</P>

<B>
</dir>
<P ALIGN="JUSTIFY" class="cap2"><a name="tiemnang"><img border="0" src="images/read_single.gif" width="15" height="12">
 IV.<FONT FACE="VNI-Times">3.&#9;</FONT>Danh s&aacute;ch ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng c&#7911;a mi&#7873;n b&#7843;o v&#7879; (Ca</FONT>pability list – C_List)</a></P>
</B><DIR>

<P ALIGN="JUSTIFY">M&#7895;i d&ograve;ng trong ma tr&#7853;n quy&#7873;n truy xu&#7845;t t&#432;&#417;ng &#7913;ng v&#7899;i m&#7897;t mi&#7873;n b&#7843;o v&#7879; s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7893; ch&#7913;c th&agrave;nh m&#7897;t danh s&aacute;ch ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng </FONT><I>(capabilities list)</I> :</P><DIR>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">M&#7897;t danh s&aacute;ch ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng c&#7911;a m&#7897;t mi&#7873;n b&#7843;o v&#7879; l</FONT>&agrave; m&#7897;t danh s&aacute;ch c&aacute;c <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng v&agrave; c&aacute;c thao t&aacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c quy&#7873;n th&#7921;c hi&#7879;n tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng khi ti&#7871;n tr&igrave;nh ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng trong mi&#7873;n b&#7843;o v&#7879; n</FONT>&agrave;y. </P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">M&#7897;t ph&#7847;n t&#7917; c&#7911;a C-List <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; m&#7897;t ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng (capability) l</FONT>&agrave; m&#7897;t h&igrave;nh th&#7913;c bi&#7877;u di&#7875;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a m&#7897;t cách có c&#7845;u trúc cho m&#7897;t &#273;&#7889;i t</FONT>&#432;&#7907;ng trong h&#7879; th&#7889;ng v&agrave; c&aacute;c quy&#7873;n truy xu&#7845;t h&#7907;p l&#7879; tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng n&agrave;y. </P></DIR>
<CENTER><TABLE BORDER="1" CELLSPACING=1 CELLPADDING=4 WIDTH=397>
<TR><TD WIDTH="101" VALIGN="TOP">
<P ALIGN="CENTER">ki&#7875;u <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng</P>
  </TD>
<TD WIDTH="97" VALIGN="TOP">
<P ALIGN="CENTER">quy&#7873;n truy xu&#7845;t</TD>
<TD WIDTH="159" VALIGN="TOP">
<P ALIGN="CENTER">con tr&#7887; <FONT FACE="Times New Roman">&#273;&#7871;n</FONT> <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng </P>
  </TD>
</TR>
</TABLE>

<B><P ALIGN="CENTER">               H&igrave;nh 5.7 </B>Ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng</P>

</FONT><U>
</dir>
<blockquote>
  <blockquote>
    <blockquote>
      <P ALIGN="JUSTIFY">V&iacute; d&#7909;</U>&nbsp;: </P>
      <P ALIGN="JUSTIFY"><img border="0" src="images/vdc_list.gif" width="473" height="119"> </P>
  </blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Ti&#7871;n tr&igrave;nh ch&#7881; c&oacute; th&#7875; th&#7921;c hi&#7879;n thao t&aacute;c <I>M</I> tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng  <I>Oj</I> trong mi&#7873;n b&#7843;o v&#7879; <I>Di</I>, n&#7871;u trong C_List c&#7911;a <I>Di</I> c&oacute; ch&#7913;a ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng t</FONT>&#432;&#417;ng &#7913;ng c&#7911;a <I>Oj</I>.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Danh s&aacute;ch ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng &#273;</FONT>&#432;&#7907;c g&aacute;n t&#432;&#417;ng &#7913;ng v&#7899;i t&#7915;ng mi&#7873;n b&#7843;o v&#7879;, th&#7921;c ch&#7845;t n&oacute; c&#361;ng l&agrave; m&#7897;t <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7843;o v&#7879; b&#7903;i h&#7879; th&#7889;ng, v&agrave; ti&#7871;n tr&igrave;nh c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng ch&#7881; c&oacute; th&#7875; truy xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7871;n nó m&#7897;t cách gián ti&#7871;p &#273;&#7875; tránh l</FONT>&agrave;m sai l&#7841;c C_List.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh cung c&#7845;p c&aacute;c th&#7911; t&#7909;c cho ph&eacute;p t&#7841;o l&#7853;p, h&#7911;y b&#7887; v&agrave; s&#7917;a <FONT FACE="Times New Roman">&#273;&#7893;i các ti&#7873;m n&#259;ng c&#7911;a m&#7897;t &#273;&#7889;i t</FONT>&#432;&#7907;ng, v&agrave; ch&#7881; c&aacute;c ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;óng vai tr</FONT>&ograve; server (th&#432;&#7901;ng l&agrave; ti&#7871;n tr&igrave;nh h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh) m&#7899;i c&oacute; th&#7875; s&#7917;a <FONT FACE="Times New Roman">&#273;&#7893;i n&#7897;i dung C_List.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</blockquote>
</blockquote>
</FONT>
</center>
<CENTER><B><P ALIGN="JUSTIFY" class="cap2"><a name="khoa"><img border="0" src="images/read_single.gif" width="15" height="12">
 IV.<FONT FACE="VNI-Times">4.&#9;</FONT>C&#417; ch&#7871; kh&oacute;a v&agrave; ch&igrave;a</a> </P>

</B><FONT FACE="Times New Roman">
<blockquote>
  <P ALIGN="JUSTIFY">&#272;ây l</FONT>&agrave; c&aacute;ch ti&#7871;p c&#7853;n k&#7871;t h&#7907;p gi&#7919;a danh s&aacute;ch quy&#7873;n truy xu&#7845;t v&agrave; danh s&aacute;ch kh&#7843; n<FONT FACE="Times New Roman">&#259;ng. M&#7895;i &#273;&#7889;i t</FONT>&#432;&#7907;ng s&#7905; h&#7919;u m&#7897;t danh s&aacute;ch c&aacute;c m&atilde; nh&#7883; ph&acirc;n , <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; «&nbsp;kho&aacute;&nbsp;» <I>(lock)</I>. C&#361;ng nh&#432; th&#7871;, m&#7895;i mi&#7873;n b&#7843;o v&#7879; s&#7869; s&#7905; h&#7919;u m&#7897;t danh s&aacute;ch m&atilde; nh&#7883; ph&acirc;n g&#7885;i l&agrave;&nbsp; «&nbsp;ch&igrave;a&nbsp;» <I>(key)</I>. M&#7897;t ti&#7871;n tr&igrave;nh ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng trong m&#7897;t mi&#7873;n b&#7843;o v&#7879; ch&#7881; có th&#7875; truy xu&#7845;t &#273;&#7871;n m&#7897;t &#273;&#7889;i t</FONT>&#432;&#7907;ng n&#7871;u mi&#7873;n b&#7843;o v&#7879; s&#7905; h&#7919;u m&#7897;t ch&igrave;a t&#432;&#417;ng &#7913;ng v&#7899;i m&#7897;t kh&oacute;a trong danh s&aacute;ch c&#7911;a <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng.</P>
<P ALIGN="JUSTIFY">C&#361;ng nh&#432; C_List, danh s&aacute;ch «&nbsp;kh&oacute;a&nbsp;» v&agrave; «&nbsp;ch&igrave;a&nbsp;» <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh qu&#7843;n l&yacute;, ng&#432;&#7901;i s&#7917; d&#7909;ng kh&ocirc;ng th&#7875; truy xu&#7845;t tr&#7921;c ti&#7871;p <FONT FACE="Times New Roman">&#273;&#7871;n chúng &#273;&#7875; thay &#273;&#7893;i n&#7897;i dung.</P>
</blockquote>

</FONT><B><P ALIGN="JUSTIFY" class="cap2"><a name="thuhoi"><img border="0" src="images/read_single.gif" width="15" height="12">
 IV.<FONT FACE="VNI-Times">5.&#9;</FONT>Thu h&#7891;i quy&#7873;n truy xu&#7845;t</a></P>

</B>
<blockquote>
  <P ALIGN="JUSTIFY">Trong m&#7897;t h&#7879; th&#7889;ng b&#7843;o v&#7879; <FONT FACE="Times New Roman">&#273;&#7897;ng, &#273;ôi khi h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh c&#7847;n thu h&#7891;i m&#7897;t s&#7889; quy&#7873;n truy xu&#7845;t tr&ecirc;n c&aacute;c <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia s&#7867; gi&#7919;a nhi&#7873;u ng&#432;&#7901;i s&#7917; d&#7909;ng. Khi <FONT FACE="Times New Roman">&#273;ó &#273;&#7863;t ra m&#7897;t s&#7889; v&#7845;n &#273;&#7873; nh</FONT>&#432; sau&nbsp;:</P><DIR>

<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Thu h&#7891;i t&#7913;c kh&#7855;c hay tr&igrave; ho&atilde;n, tr&igrave; ho&atilde;n <FONT FACE="Times New Roman">&#273;&#7871;n khi n</FONT>&agrave;o&nbsp;?</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">N&#7871;u lo&#7841;i b&#7887; m&#7897;t quy&#7873;n truy xu&#7845;t tr&ecirc;n m&#7897;t <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng, thu h&#7891;i quy&#7873;n n&agrave;y tr&ecirc;n t&#7845;t c&#7843; hay chi m&#7897;t s&#7889; ng&#432;&#7901;i s&#7917; d&#7909;ng?</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Thu h&#7891;i m&#7897;t s&#7889; quy&#7873;n hay to&agrave;n b&#7897; quy&#7873;n tr&ecirc;n m&#7897;t <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng&nbsp;?</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Thu h&#7891;i t&#7841;m th&#7901;i hay v&#297;nh vi&#7875;n m&#7897;t quy&#7873;n truy xu&#7845;t&nbsp;?</P></DIR>

</I><FONT FACE="Times New Roman"><P ALIGN="JUSTIFY">&#272;&#7889;i v&#7899;i các h&#7879; th&#7889;ng s&#7917; d&#7909;ng danh sách quy&#7873;n truy xu&#7845;t, vi&#7879;c thu h&#7891;i có th&#7875; th&#7921;c hi&#7879;n d&#7877; d</FONT>&agrave;ng&nbsp;: t&igrave;m v&agrave; h&#7911;y tr&ecirc;n ACL quy&#7873;n truy xu&#7845;t c&#7847;n thu h&#7891;i, nh&#432; v&#7853;y vi&#7879;c thu h&#7891;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ht&#7921;c hi&#7879;n t&#7913;c th&#7901;i, c&oacute; th&#7875; &aacute;p d&#7909;ng cho t&#7845;t c&#7843; hay m&#7897;t nh&oacute;m ng&#432;&#7901;i d&ugrave;ng, thu h&#7891;i to&agrave;n b&#7897; hay m&#7897;t ph&#7847;n, v&agrave; thu h&#7891;i v&#297;nh vi&#7877;n hay t&#7841;m th&#7901;i <FONT FACE="Times New Roman">&#273;&#7873;u &#273;</FONT>&#432;&#7907;c.</P>
<P ALIGN="JUSTIFY">Tuy nhi&ecirc;n trong c&aacute;c h&#7879; s&#7917; d&#7909;ng C_List, v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; thu h&#7891;i g&#7863;p khó kh&#259;n v</FONT>&igrave; c&aacute;c ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng &#273;</FONT>&#432;&#7907;c ph&acirc;n t&aacute;n tr&ecirc;n kh&#7855;p c&aacute;c mi&#7873;n b&#7843;o v&#7879; trong h&#7879; th&#7889;ng, do v&#7853;y c&#7847;n t&igrave;m ra ch&uacute;ng tr&#432;&#7899;c khi lo&#7841;i b&#7887;. C&oacute; th&#7875; gi&#7843;i quy&#7871;t v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; n</FONT>&agrave;y theo nhi&#7873;u ph&#432;&#417;ng ph&aacute;p&nbsp;:</P><DIR>

<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">T&aacute;i y&ecirc;u c&#7847;u&nbsp;(Reacquisiton):  </I>lo&#7841;i b&#7887; c&aacute;c ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng ra kh&#7887;i m&#7895;i mi&#7873;n b&#7843;o v&#7879; sau t&#7915;ng chu k&#7923;, n&#7871;u mi&#7873;n b&#7843;o v&#7879; v&#7851;n c</FONT>&ograve;n c&#7847;n ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng n</FONT>&agrave;o, n&oacute; s&#7869; t&aacute;i y&ecirc;u c&#7847;u ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng &#273;ó l&#7841;i.</P>
</FONT><I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">S&#7917; d&#7909;ng c&aacute;c con tr&#7887; <FONT FACE="Times New Roman">&#273;&#7871;n ti&#7873;m n&#259;ng (Back-pointers)&nbsp;:  </I></FONT>v&#7899;i m&#7895;i <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng, l&#432;u tr&#7919; c&aacute;c con tr&#7887; <FONT FACE="Times New Roman">&#273;&#7871;n nh&#7919;ng ti&#7873;m n&#259;ng t</FONT>&#432;&#417;ng &#7913;ng tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng n&agrave;y. Khi c&#7847;n thu h&#7891;i quy&#7873;n truy xu&#7845;t n&agrave;o tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng, l&#7847;n theo c&aacute;c con tr&#7887; <FONT FACE="Times New Roman">&#273;&#7875; c&#7853;p nh&#7853;t ti&#7873;m n&#259;ng t</FONT>&#432;&#417;ng &#7913;ng.</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">S&#7917; d&#7909;ng con tr&#7887; gi&aacute;n ti&#7871;p (Indirection)&nbsp;: </I> c&aacute;c ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng không tr&#7921;c ti&#7871;p tr&#7887; &#273;&#7871;n các &#273;&#7889;i t</FONT>&#432;&#7907;ng, m&agrave; tr&#7887; <FONT FACE="Times New Roman">&#273;&#7871;n m&#7897;t b&#7843;ng to</FONT>&agrave;n c&#7909;c do h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh qu&#7843;n l&yacute;. KHi c&#7847;n thu h&#7891;i quy&#7873;n, s&#7869; xo&aacute; ph&#7847;n t&#7917; t&#432;&#417;ng &#7913;ng trong b&#7843;ng n&agrave;y.</P>
<I><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Kh&oacute;a ( Key)&nbsp;: </I>n&#7871;u s&#7917; d&#7909;ng c&#417; ch&#7871; kh&oacute;a v&agrave; ch&igrave;a, khi c&#7847;n thu h&#7891;i quy&#7873;n, ch&#7881; c&#7847;n thay <FONT FACE="Times New Roman">&#273;&#7893;i khóa v</FONT>&agrave; b&#7855;t bu&#7897;c ti&#7871;n tr&igrave;nh hay ng&#432;&#7901;i d&ugrave;ng y&ecirc;u c&#7847;u ch&igrave;a m&#7899;i.</P></DIR>

  </blockquote>

<B><P ALIGN="JUSTIFY">&nbsp;</P><P ALIGN="JUSTIFY" class="cap1"><a name="antoan">V. An to&agrave;n h&#7879; th&#7889;ng (Security)</a></P>

</B><P ALIGN="JUSTIFY">B&#7843;o v&#7879; h&#7879; th&#7889;ng <I>(protection)</I> l&agrave; m&#7897;t c&#417; ch&#7871; ki&#7875;m so&aacute;t vi&#7879;c s&#7917; d&#7909;ng t&agrave;i nguy&ecirc;n c&#7911;a c&aacute;c ti&#7871;n tr&igrave;nh hay ng&#432;&#7901;i s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;&#7875; &#273;&#7889;i phó v&#7899;i các t</FONT>&igrave;nh hu&#7889;ng l&#7895;i c&oacute; th&#7875; ph&aacute;t sinh t&#7915; trong h&#7879; th&#7889;ng . Trong khi <FONT FACE="Times New Roman">&#273;ó khái ni&#7879;m an to</FONT>&agrave;n h&#7879; th&#7889;ng  <I>(security)</I> mu&#7889;n <FONT FACE="Times New Roman">&#273;&#7873; c&#7853;p &#273;&#7871;n m&#7913;c &#273;&#7897; tin c&#7853;y m</FONT>&agrave; h&#7879; th&#7889;ng duy tr&igrave; khi ph&#7843;i <FONT FACE="Times New Roman">&#273;&#7889;i phó không nh&#7919;ng v&#7899;i các v&#7845;n &#273;&#7873; n&#7897;i b&#7897;, m</FONT>&agrave; c&ograve;n c&#7843; v&#7899;i nh&#7919;ng t&aacute;c h&#7841;i <FONT FACE="Times New Roman">&#273;&#7871;n t&#7915; môi tr</FONT>&#432;&#7901;ng ngo&agrave;i .</P>
<B><P ALIGN="JUSTIFY" class="cap2"><a name="vande"><img border="0" src="images/read_single.gif" width="15" height="12">
 V.<FONT FACE="VNI-Times">1.&#9;</FONT>C&aacute;c v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; v&#7873; an to</FONT>&agrave;n h&#7879; th&#7889;ng</a></P>

</B>
  <blockquote>
    <P ALIGN="JUSTIFY">H&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; an to&agrave;n n&#7871;u c&aacute;c t&agrave;i nguy&ecirc;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;úng nh</FONT>&#432; quy &#432;&#7899;c trong m&#7885;i ho&agrave;n c&#7843;nh. K&eacute;m may m&#7855;m l&agrave; <FONT FACE="Times New Roman">&#273;i&#7873;u n</FONT>&agrave;y hi&#7871;m khi <FONT FACE="Times New Roman">&#273;&#7841;t &#273;</FONT>&#432;&#7907;c trong th&#7921;c t&#7871;&nbsp;! Th&ocirc;ng th&#432;&#7901;ng, an to&agrave;n b&#7883; vi ph&#7841;m v&igrave; c&aacute;c nguy&ecirc;n nh&acirc;n v&ocirc; t&igrave;nh hay c&#7889; &yacute; ph&aacute; ho&#7841;i. Vi&#7879;c ch&#7889;ng <FONT FACE="Times New Roman">&#273;&#7905; các phá ho&#7841;i c&#7889; ý l</FONT>&agrave; r&#7845;t kh&oacute; kh<FONT FACE="Times New Roman">&#259;n v</FONT>&agrave; g&#7847;n nh&#432; kh&ocirc;ng th&#7875; <FONT FACE="Times New Roman">&#273;&#7841;t hi&#7879;u qu&#7843; ho</FONT>&agrave;n to&agrave;n. B&#7843;o <FONT FACE="Times New Roman">&#273;&#7843;m an to</FONT>&agrave;n h&#7879; th&#7889;ng &#7903; c&#7845;p cao ch&#7889;ng l&#7841;i c&aacute;c t&aacute;c h&#7841;i t&#7915; m&ocirc;i tr&#432;&#7901;ng ngo&agrave;i nh&#432; ho&#7843; ho&#7841;n, m&#7845;t <FONT FACE="Times New Roman">&#273;i&#7879;n</FONT>, ph&aacute;i ho&#7841;i...c&#7847;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n &#7903; 2 m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; </FONT><I>v&#7853;t l&yacute;</I> (trang b&#7883; c&aacute;c thi&#7871;t b&#7883; an to&agrave;n cho v&#7883; tr&iacute; <FONT FACE="Times New Roman">&#273;&#7841;t h&#7879; th&#7889;ng...) v</FONT>&agrave; <I>nh&acirc;n s&#7921;</I> (ch&#7885;n l&#7885;c c&#7849;n th&#7853;n nh&#7919;ng nh&acirc;n vi&ecirc;n l&agrave;m vi&#7879;c trong h&#7879; th&#7889;ng...). N&#7871;u an to&agrave;n m&ocirc;i tr&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7843;o <FONT FACE="Times New Roman">&#273;&#7843;m khá t&#7889;t, an to</FONT>&agrave;n c&#7911;a h&#7879; th&#7889;ng s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c duy tr&igrave; t&#7889;t nh&#7901; c&aacute;c c&#417; ch&#7871; c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh (v&#7899;i s&#7921; tr&#7907; gi&uacute;p c&#7911;a ph&#7847;n c&#7913;ng).</P>
<P ALIGN="JUSTIFY">L&#432;u &yacute; r&#7857;ng n&#7871;u b&#7843;o v&#7879; h&#7879; th&#7889;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;&#7841;t &#273;&#7897; tin c&#7853;y 100%, th</FONT>&igrave; c&aacute;c c&#417; ch&#7871; an to&agrave;n h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c cung c&#7845;p ch&#7881; v&#7899;i hy v&#7885;ng ng<FONT FACE="Times New Roman">&#259;n ch&#7863;n b&#7899;t các t</FONT>&igrave;nh hu&#7889;ng b&#7845;t an h&#417;n l&agrave; <FONT FACE="Times New Roman">&#273;&#7841;t &#273;&#7871;n &#273;&#7897; a</FONT>n to&agrave;n tuy&#7879;t <FONT FACE="Times New Roman">&#273;&#7889;i.</P>
    </blockquote>

</FONT><B><P ALIGN="JUSTIFY" class="cap2"><a name="kiemdinh"><img border="0" src="images/read_single.gif" width="15" height="12">
  V.<FONT FACE="VNI-Times">2.&#9;</FONT>Ki&#7875;m <FONT FACE="Times New Roman">&#273;&#7883;nh danh tính (Authentication)</FONT></a></P>

</B>
 <FONT FACE="Times New Roman">
  <blockquote>
    <P ALIGN="JUSTIFY">&#272;&#7875; &#273;&#7843;m b&#7843;o an to</FONT>&agrave;n, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&#7847;n gi&#7843;i quy&#7871;t t&#7889;t v&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; ch&#7911; y&#7871;u l</FONT>&agrave; <I>ki&#7875;m <FONT FACE="Times New Roman">&#273;&#7883;nh danh tính (authentication)</I></FONT>. Ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng c&#7911;a h&#7879; th&#7889;ng b&#7843;o v&#7879; ph&#7909; thu&#7897;c v</FONT>&agrave;o kh&#7843; n<FONT FACE="Times New Roman">&#259;ng xác &#273;&#7883;nh các ti&#7871;n tr</FONT>&igrave;nh <FONT FACE="Times New Roman">&#273;ang x&#7917; lý. Kh&#7843; n&#259;ng n</FONT>&agrave;y, <FONT FACE="Times New Roman">&#273;&#7871;n l</FONT>&#432;&#7907;t n&oacute;, l&#7841;i ph&#7909; thu&#7897;c v&agrave;o vi&#7879;c x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh &#273;</FONT>&#432;&#7907;c <I>ng&#432;&#7901;i d&ugrave;ng</I> <FONT FACE="Times New Roman">&#273;ang s&#7917; d&#7909;ng h&#7879; th&#7889;ng &#273;&#7875; có th&#7875; ki&#7875;m tra ng</FONT>&#432;&#7901;i d&ugrave;ng n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c cho ph&eacute;p thao t&aacute;c tr&ecirc;n nh&#7919;ng t&agrave;i nguy&ecirc;n n&agrave;o. </P>
<P ALIGN="JUSTIFY">C&aacute;ch ti&#7871;p c&#7853;n ph&#7893; bi&#7871;n nh&#7845;t <FONT FACE="Times New Roman">&#273;&#7875; gi&#7843;i quy&#7871;t v&#7845;n &#273;&#7873; l</FONT>&agrave; s&#7917; d&#7909;ng <I>password</I> <FONT FACE="Times New Roman">&#273;&#7875; ki&#7875;m &#273;&#7883;nh &#273;úng danh tính c&#7911;a ng</FONT>&#432;&#7901;i d&ugrave;ng. M&#7895;i khi ng&#432;&#7901;i d&ugrave;ng mu&#7889;n s&#7917; d&#7909;ng t&agrave;i nguy&ecirc;n, h&#7879; th&#7889;ng s&#7869; ki&#7875;m tra password c&#7911;a ng&#432;&#7901;i d&ugrave;ng nh&#7853;p v&agrave;o v&#7899;i password <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919;, n&#7871;u <FONT FACE="Times New Roman">&#273;úng, ng</FONT>&#432;&#7901;i d&ugrave;ng m&#7899;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c cho ph&eacute;p s&#7917; d&#7909;ng t&agrave;i nguy&ecirc;n. Password c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;u&#7907;c &#273;&#7875; b&#7843;o v&#7879; t&#7915;ng &#273;&#7889;i t</FONT>&#432;&#7907;ng trong h&#7879; th&#7889;ng, th&#7853;m ch&iacute; c&ugrave;ng m&#7897;t <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng s&#7869; c&oacute; c&aacute;c password kh&aacute;c nhau &#7913;ng v&#7899;i nh&#7919;ng quy&#7873;n truy xu&#7845;t kh&aacute;c nhau.</P>
<P ALIGN="JUSTIFY">C&#417; ch&#7871; password r&#7845;t d&#7877; hi&#7875;u v&agrave; d&#7877; s&#7917; d&#7909;ng do v&#7853;y <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng r&#7897;ng r&atilde;i, tuy nhi&ecirc;n y&#7871;u <FONT FACE="Times New Roman">&#273;i&#7875;m nghi</FONT>&ecirc;m tr&#7885;ng c&#7911;a ph&#432;&#417;ng ph&aacute;p n&agrave;y l&agrave; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng b&#7843;o m&#7853;t password r&#7845;t khó &#273;&#7841;t &#273;</FONT>&#432;&#7907;c s&#7921; ho&agrave;n h&#7843;o, nh&#7919;ng t&aacute;c nh&acirc;n ti&ecirc;u c&#7921;c c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;oán ra password c&#7911;a ng</FONT>&#432;&#7901;i kh&aacute;c nh&#7901; nhi&#7873;u c&aacute;ch th&#7913;c kh&aacute;c nhau.</P>
</blockquote>

<B><P ALIGN="JUSTIFY" class="cap2"><a name="dedoa"><img border="0" src="images/read_single.gif" width="15" height="12">
 V.<FONT FACE="VNI-Times">3.&#9;</FONT>M&#7889;i <FONT FACE="Times New Roman">&#273;e d&#7885;a t&#7915; các ch</FONT>&#432;&#417;ng tr&igrave;nh</a></P>

</B>
<blockquote>
  <P ALIGN="JUSTIFY">Trong m&ocirc;i tr&#432;&#7901;ng m&agrave; m&#7897;t ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7841;o l&#7853;p b&#7903;i ng&#432;&#7901;i n&agrave;y l&#7841;i c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ng&#432;&#7901;i kh&aacute;c s&#7917; d&#7909;ng, c&oacute; th&#7875; x&#7843;y ra c&aacute;c t&igrave;nh hu&#7889;ng s&#7917; d&#7909;ng kh&ocirc;ng <FONT FACE="Times New Roman">&#273;úng, t&#7915; &#273;ó d&#7851;n &#273;&#7871;n nh&#7919;ng h&#7853;u q&#7911;a khó l</FONT>&#432;&#7901;ng. Hai tr&#432;&#7901;ng h&#7907;p <FONT FACE="Times New Roman">&#273;i&#7875;n h</FONT>&igrave;nh l&agrave;&nbsp;:</P>

<B><I><P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp; <img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
V.<FONT FACE="VNI-Times">3</FONT>.1. Ng&#7921;a th&agrave;nh Troy</P>

</B></I>
  <blockquote>
    <P ALIGN="JUSTIFY">Khi m&#7897;t ng&#432;&#7901;i d&ugrave;ng A cho m&#7897;t ch&#432;&#417;ng tr&igrave;nh do B vi&#7871;t ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng d</FONT>&#432;&#7899;i danh ngh&#297;a c&#7911;a m&igrave;nh ( trong mi&#7873;n b&#7843;o v&#7879; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&aacute;n t&#432;&#417;ng &#7913;ng cho ng&#432;&#7901;i d&ugrave;ng A), ch&#432;&#417;ng tr&igrave;nh n&agrave;y c&oacute; th&#7875; tr&#7903; th&agrave;nh m&#7897;t «&nbsp;con ng&#7921;a th&agrave;nh Troy&nbsp;»&nbsp;v&igrave; khi <FONT FACE="Times New Roman">&#273;ó các &#273;o&#7841;n l&#7879;nh trong ch</FONT>&#432;&#417;ng tr&igrave;nh c&oacute; th&#7875; thao t&aacute;c tr&ecirc;n c&aacute;c t&agrave;i nguy&ecirc;n v&#7899;i nh&#7919;ng quy&#7873;n t&#432;&#417;ng &#7913;ng c&#7911;a ng&#432;&#7901;i A (m&agrave; c&oacute; th&#7875; ng&#432;&#7901;i B v&#7889;n b&#7883; c&#7845;m!), nhi&#7873;u ch&#432;&#417;ng tr&igrave;nh nh&#432; th&#7871; <FONT FACE="Times New Roman">&#273;</FONT>&atilde; «&nbsp;l&#7907;i d&#7909;ng ho&agrave;n c&#7843;nh&nbsp;» <FONT FACE="Times New Roman">&#273;&#7875; gây ra các tác h&#7841;i &#273;áng ti&#7871;c. </P>

</FONT><B><I>
    </blockquote>
    <P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp; <img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
    V.<FONT FACE="VNI-Times">3</FONT>.2. C&aacute;nh c&#7917;a nh&#7887; ( Trap-door)</P>

</B></I>
  <blockquote>
    <P ALIGN="JUSTIFY">M&#7897;t m&#7889;i <FONT FACE="Times New Roman">&#273;e d&#7885;a &#273;&#7863;c bi&#7879;t nguy hi&#7875;m v</FONT>&agrave; kh&oacute; ch&#7889;ng <FONT FACE="Times New Roman">&#273;&#7905; &#273;&#7871;n t&#7915; s&#7921; vô t</FONT>&igrave;nh hay &yacute; ngh&#297; b&#7845;t ch&iacute;nh c&#7911;a c&aacute;c l&#7853;p tr&igrave;nh vi&ecirc;n. Khi x&acirc;y d&#7921;ng ch&#432;&#417;ng tr&igrave;nh, c&aacute;c l&#7853;p tr&igrave;nh vi&ecirc;n c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;&#7875; l&#7841;i m&#7897;t «&nbsp;cánh c&#7917;a nh&#7887;&nbsp;» trong ph&#7847;n m&#7873;m m</FONT>&agrave; ch&#7881; c&oacute; h&#7885; l&agrave; c&oacute; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng s&#7917; d&#7909;ng , qua &#273;ó thâm nh&#7853;p v</FONT>&agrave; ph&aacute; ho&#7841;i h&#7879; th&#7889;ng ( v&iacute; d&#7909; l&agrave;m tr&ograve;n c&aacute;c s&#7889; l&#7867; trong nh&#7919;ng t&agrave;i kho&#7843;n, v&agrave; thu l&#7907;i ri&ecirc;ng t&#7915; ph&#7847;n d&#432; n&agrave;y...). V&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; n</FONT>&agrave;y r&#7845;t kh&oacute; <FONT FACE="Times New Roman">&#273;&#7889;i phó v</FONT>&igrave; c&#7847;n ph&#7843;i ti&#7871;n h&agrave;nh ph&acirc;n t&iacute;ch ch&#432;&#417;ng tr&igrave;nh ngu&#7891;n <FONT FACE="Times New Roman">&#273;&#7875; t</FONT>&igrave;m ra ch&#7895; s&#417; h&#7903;.</P>
  </blockquote>

<B>
  </blockquote>
  <P ALIGN="JUSTIFY" class="cap2"><I><a name="hethong"><img border="0" src="images/read_single.gif" width="15" height="12">
  </a>
  </I><a name="hethong">V.<FONT FACE="VNI-Times">4.&#9;</FONT>M&#7889;i <FONT FACE="Times New Roman">&#273;e d&#7885;a t&#7915; h&#7879; th&#7889;ng</FONT>
  </a></P>

</B>
<blockquote>
  <P ALIGN="JUSTIFY">H&#7847;u h&#7871;t c&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;&#7873;u cung c&#7845;p ph</FONT>&#432;&#417;ng ti&#7879;n cho ph&eacute;p c&aacute;c ti&#7871;n tr&igrave;nh khi ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng có th&#7875; t&#7841;o ra </FONT><I>(spawn)</I> nh&#7919;ng ti&#7871;n tr&igrave;nh kh&aacute;c. Trong c&aacute;c m&ocirc;i tr&#432;&#7901;ng nh&#432; th&#7871;, t&agrave;i nguy&ecirc;n h&#7879; th&#7889;ng v&agrave; c&aacute;c t&#7853;p tin c&#7911;a ng&#432;&#7901;i d&ugrave;ng c&oacute; th&#7875; b&#7883; s&#7917; d&#7909;ng sai l&#7841;c <FONT FACE="Times New Roman">&#273;&#7875; gây tác h&#7841;i. Hai ph</FONT>&#432;&#417;ng ph&aacute;p ph&#7893; bi&#7871;n <FONT FACE="Times New Roman">&#273;&#7875; phá ho&#7841;i h&#7879; th&#7889;ng theo ph</FONT>&#432;&#417;ng th&#7913;c n&agrave;y l&agrave;&nbsp;: </P>

<B><I><P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp; <img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
V.<FONT FACE="VNI-Times">4</FONT>.1. C&aacute;c ch&#432;&#417;ng tr&igrave;nh «&nbsp;s&acirc;u b&#7885;&nbsp;» ( Worm)</P>

</B></I>
  <blockquote>
    <P ALIGN="JUSTIFY">M&#7897;t ch&#432;&#417;ng tr&igrave;nh «&nbsp;s&acirc;u b&#7885;&nbsp;» l&agrave; ch&#432;&#417;ng tr&igrave;nh l&#7907;i d&#7909;ng c&#417; ch&#7871; ph&aacute;t sinh ti&#7871;n tr&igrave;nh c&#7911;a h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;&#7875; &#273;ánh b&#7841;i chính h&#7879; th&#7889;ng. Ti&#7871;n tr</FONT>&igrave;nh «&nbsp;s&acirc;u bo&nbsp;»&iuml; c&oacute; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng t&#7921; &#273;&#7897;ng phát sinh các phi</FONT>&ecirc;n b&#7843;n ngay c&#7843; tr&ecirc;n m&ocirc;i tr&#432;&#7901;ng m&#7841;ng, lan tr&agrave;n tr&ecirc;n nhi&#7873;u m&aacute;y t&iacute;nh kh&aacute;c nhau, sau <FONT FACE="Times New Roman">&#273;ó chi&#7871;m d&#7909;ng các t</FONT>&agrave;i nguy&ecirc;n h&#7879; th&#7889;ng v&agrave; l&agrave;m ng&#7915;ng tr&#7879; ho&agrave;n to&agrave;n ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng c&#7911;a các ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c tr&ecirc;n h&#7879; th&#7889;ng m&#7841;ng .</P>
<U><P ALIGN="JUSTIFY">V&iacute; d&#7909;</U>&nbsp;: ch&#432;&#417;ng tr&igrave;nh c&#7911;a Robert Tappan Morris, 11/1988 lan truy&#7873;n tr&ecirc;n Internet</P>
  </blockquote>

<B><I><P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp; <img border="0" src="images/symble_asterisk_blue.gif" width="13" height="14">
V.<FONT FACE="VNI-Times">4</FONT>.2. C&aacute;c ch&#432;&#417;ng tr&igrave;nh Virus</P>

</B></I>
  <blockquote>
    <P ALIGN="JUSTIFY">Virus l&agrave; m&#7897;t d&#7841;ng ph&aacute; ho&#7841;i nguy hi&#7875;m kh&aacute;c <FONT FACE="Times New Roman">&#273;&#7889;i v&#7899;i các h&#7879; th&#7889;ng thông tin. Khác v&#7899;i «&nbsp;sâu b&#7885;&nbsp;» l</FONT>&agrave; nh&#7919;ng ch&#432;&#417;ng tr&igrave;nh ho&agrave;n ch&#7881;nh, virus ch&#7881; l&agrave; nh&#7919;ng <FONT FACE="Times New Roman">&#273;o&#7841;n code có kh&#7843; n&#259;ng lây truy&#7873;n v</FONT>&agrave;o c&aacute;c ch&#432;&#417;ng tr&igrave;nh ch&iacute;nh th&#7889;ng kh&aacute;c v&agrave; t&#7915; <FONT FACE="Times New Roman">&#273;ó t</FONT>&agrave;n ph&aacute; h&#7879; th&#7889;ng. Virus th&#432;&#7901;ng ho&agrave;nh h&agrave;nh tr&ecirc;n c&aacute;c m&aacute;y <FONT FACE="Times New Roman">&#273;</FONT>&#417;n, v&agrave; ch&#7911; y&#7871;u l&acirc;y truy&#7873;n gi&#7919;a c&aacute;c m&aacute;y qua vi&#7879;c trao <FONT FACE="Times New Roman">&#273;&#7893;i &#273;&#297;a m&#7873;m.</P>
    </blockquote>
  </blockquote>

</FONT><B><P ALIGN="JUSTIFY" class="cap2"><a name="giamsat"><img border="0" src="images/read_single.gif" width="15" height="12">
 V.<FONT FACE="VNI-Times">5.&#9;</FONT>Gi&aacute;m s&aacute;t c&aacute;c m&#7889;i <FONT FACE="Times New Roman">&#273;e do&#7841;</FONT>
</a></P>

</B>
<blockquote>
  <P ALIGN="JUSTIFY">Nh&igrave;n chung vi&#7879;c b&#7843;o <FONT FACE="Times New Roman">&#273;&#7843;m an to</FONT>&agrave;n h&#7879; th&#7889;ng l&agrave; r&#7845;t kh&oacute; do c&oacute; c&aacute;c y&#7871;u t&#7889; con ng&#432;&#7901;i.  H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ch&#7881; c&oacute; th&#7875; &aacute;p d&#7909;ng m&#7897;t s&#7889; k&#7929; thu&#7853;t <FONT FACE="Times New Roman">&#273;&#7875; gi&#7843;m b&#7899;t kh&#7843; n&#259;ng b&#7883; phá ho&#7841;i nh</FONT>&#432;&nbsp;ghi nh&#7853;n c&aacute;c s&#7921; ki&#7879;n nh&#432; :</P>
</blockquote>
<DIR>
<DIR>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10"> c&#7889; g&#7855;ng nh&#7853;p nhi&#7873;u l&#7847;n password sai</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10"> s&#7917; d&#7909;ng c&aacute;c password d&#7877; <FONT FACE="Times New Roman">&#273;oán</P>
</FONT><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">
c&aacute;c ti&#7871;n tr&igrave;nh v&#7899;i <FONT FACE="Times New Roman">&#273;&#7883;nh danh nghi ng&#7901; không &#273;</FONT>&#432;&#7907;c &#7911;y quy&#7873;n</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10"> c&aacute;c ti&#7871;n tr&igrave;nh kh&ocirc;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c &#7911;y quy&#7873;n trong nh&#7919;ng th&#432; m&#7909;c h&#7879; th&#7889;ng</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10"> c&aacute;c ch&#432;&#417;ng tr&igrave;nh k&eacute;o d&agrave;i x&#7917; l&yacute; m&#7897;t c&aacute;ch <FONT FACE="Times New Roman">&#273;áng ng&#7901;</P>
</FONT><P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">
b&#7843;o v&#7879; c&aacute;c t&#7853;p tin v&agrave; th&#432; m&#7909;c kh&ocirc;ng h&#7907;p l&yacute;</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10"> thay <FONT FACE="Times New Roman">&#273;&#7893;i kích th</FONT>&#432;&#7899;c c&#7911;a c&aacute;c ch&#432;&#417;ng tr&igrave;nh h&#7879; th&#7889;ng</P></DIR>
</DIR>

<blockquote>

<P ALIGN="JUSTIFY">Vi&#7879;c ki&#7875;m tra th&#432;&#7901;ng k&#7923; v&agrave; ghi nh&#7853;n c&aacute;c th&ocirc;ng tin n&agrave;y gi&uacute;p h&#7879; th&#7889;ng ph&aacute;t hi&#7879;n k&#7883;p th&#7901;i c&aacute;c nguy c&#417;, v&agrave; cho ph&eacute;p ph&acirc;n t&iacute;ch , d&#7921; <FONT FACE="Times New Roman">&#273;oán các cách &#273;&#7889;i phó v&#7873; sau.</P>
  </blockquote>
</FONT><B><P ALIGN="JUSTIFY">&nbsp; </P><P ALIGN="JUSTIFY" class="cap1"><a name="tomtat">VI. T&oacute;m t&#7855;t</a> </P>

</B>
<blockquote>
  <P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif" width="6" height="12">
  C&aacute;c <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng trong h&#7879; th&#7889;ng ( c&oacute; th&#7875; l&agrave; ph&#7847;n c&#7913;ng nh&#432; CPU, b&#7897; nh&#7899; ch&iacute;nh&nbsp;; hay ph&#7847;n m&#7873;m nh&#432; t&#7853;p tin, ch&#432;&#417;ng tr&igrave;nh) c&#7847;n ph&#7843;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7843;o v&#7879; kh&#7887;i s&#7921; s&#7917; d&#7909;ng sai tr&aacute;i. <FONT FACE="Times New Roman">&#272;i&#7873;u n</FONT>&agrave;y c&oacute; th&#7875; th&#7921;c hi&#7879;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c b&#7857;ng c&aacute;ch <FONT FACE="Times New Roman">&#273;&#7863;t các &#273;&#7889;i t</FONT>&#432;&#7907;ng v&agrave;o nh&#7919;ng mi&#7873;n b&#7843;o v&#7879; th&iacute;ch h&#7907;p v&#7899;i c&aacute;c quy&#7873;n truy xu&#7845;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;nh ngh&#297;a tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;ó</FONT>.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif" width="6" height="12">
Quy&#7873;n truy xu&#7845;t tr&ecirc;n m&#7897;t <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng l&agrave; thao t&aacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;cph&eacute;p th&#7921;c hi&#7879;n tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng <FONT FACE="Times New Roman">&#273;ó.</P>
</FONT><P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif" width="6" height="12">
  Mi&#7873;n b&#7843;o v&#7879; l&agrave; t&#7853;p c&aacute;c quy&#7873;n truy xu&#7845;t tr&ecirc;n m&#7897;t s&#7889; c&aacute;c <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng. M&#7895;i ti&#7871;n tr&igrave;nh s&#7869; ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng trong m&#7897;t mi&#7873;n b&#7843;o v&#7879; t&#7841;i m&#7897;t th&#7901;i &#273;i&#7875;m.</P>
</FONT><P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif" width="6" height="12">
  Ma tr&#7853;n quy&#7873;n truy xu&#7845;t l&agrave; m&ocirc; h&igrave;nh t&#7893;ng qu&aacute;t cho b&agrave;i to&aacute;n b&#7843;o v&#7879; h&#7879; th&#7889;ng. Ma tr&#7853;n n&agrave;y c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&agrave;i <FONT FACE="Times New Roman">&#273;&#7863;t nh</FONT>&#432; m&#7897;t m&#7843;ng, c&aacute;c danh s&aacute;ch quy&#7873;n truy xu&#7845;t ho&#7863;c c&aacute;c danh s&aacute;ch ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng.</P>
</FONT><P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif" width="6" height="12">
  M&ocirc; h&igrave;nh b&#7843;o v&#7879; <FONT FACE="Times New Roman">&#273;&#7897;ng cho phép ti&#7871;n tr</FONT>&igrave;nh c&oacute; th&#7875; chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i mi&#7873;n b&#7843;o v&#7879; trong th&#7901;i gian x&#7917; lý. Có th&#7875; t&#7893; ch&#7913;c m</FONT>&ocirc; h&igrave;nh b&#7843;o v&#7879; <FONT FACE="Times New Roman">&#273;&#7897;ng n&#7871;u xem các mi&#7873;n b&#7843;o v&#7879; v</FONT>&agrave; b&#7843;n th&acirc;n ma tr&#7853;n quy&#7873;n truy xu&#7845;t c&#361;ng l&agrave; c&aacute;c <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng trong h&#7879; th&#7889;ng.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif" width="6" height="12">
An to&agrave;n h&#7879; th&#7889;ng kh&ocirc;ng ch&#7881; quan t&acirc;m <FONT FACE="Times New Roman">&#273;&#7871;n các nguy c</FONT>&#417; n&#7897;i b&#7897; h&#7879; th&#7889;ng, m&agrave; ph&#7843;i <FONT FACE="Times New Roman">&#273;&#7889;i phó v&#7899;i c&#7843; các nguy c</FONT>&#417; t&#7915; m&ocirc;i tr&#432;&#7901;ng ngo&agrave;i.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif" width="6" height="12">
V&#7845;n <FONT FACE="Times New Roman">&#273;&#7873; quan tr&#7885;ng nh&#7845;t trong an to</FONT>&agrave;n h&#7879; th&#7889;ng l&agrave; ki&#7875;m <FONT FACE="Times New Roman">&#273;&#7883;nh danh tính c&#7911;a ng</FONT>&#432;&#7901;i d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7875; xác &#273;&#7883;nh &#273;úng các quy&#7873;n t</FONT>&#432;&#417;ng &#7913;ng c&#7911;a h&#7885;. Ph&#432;&#417;ng ph&aacute;p th&ocirc;ng d&#7909;ng nh&#7845;t <FONT FACE="Times New Roman">&#273;&#7875; l</FONT>&agrave;m <FONT FACE="Times New Roman">&#273;i&#7873;u n</FONT>&agrave;y l&agrave; ki&#7875;m tra  password.</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif" width="6" height="12">
Ngo&agrave;i ra h&#7879; th&#7889;ng c&ograve;n ph&#7843;i <FONT FACE="Times New Roman">&#273;&#7889;i phó v&#7899; các tác h&#7841;i c&#7911;a nh&#7919;ng s&#7921; t&#7845;n công c&#7889;</FONT> &yacute; t&#7915; ph&iacute;a nh&#7919;ng ch&#432;&#417;ng tr&igrave;nh «&nbsp;s&acirc;u b&#7885;&nbsp;», virus, c&aacute;c lo&#7841;i khe h&#7903; trong ch&#432;&#417;ng tr&igrave;nh...</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/rightarrow.gif" width="6" height="12">
Nh&igrave;n chung kh&ocirc;ng th&#7875; <FONT FACE="Times New Roman">&#273;&#7841;t &#273;</FONT>&#432;&#7907;c m&#7913;c <FONT FACE="Times New Roman">&#273;&#7897; an to</FONT>&agrave;n h&#7879; th&#7889;ng 100%, nh&#432;ng  c&oacute; th&#7875; &aacute;p d&#7909;ng c&aacute;c bi&#7879;n ph&aacute;p <FONT FACE="Times New Roman">&#273;&#7875; h&#7841;n ch&#7871; t&#7889;i &#273;a các nguy c</FONT>&#417; ph&aacute; ho&#7841;i h&#7879; th&#7889;ng.</P>
</blockquote>
</center>
<P align="left"><a name="cauhoi"><img border="0" src="images/blebul1a.gif" width="20" height="20">
<b><font color="#FF0000" face="Times New Roman" size="4">C&#7911;ng c&#7889; bài
h&#7885;c</font></b></a></P>
<blockquote>
<P align="left"> C&aacute;c c&acirc;u h&#7887;i c&#7847;n tr&#7843; l&#7901;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c sau b&agrave;i h&#7885;c n&agrave;y :</P>
<CENTER>
<P ALIGN="JUSTIFY">1. C&aacute;c kh&aacute;i ni&#7879;m : quy&#7873;n truy xu&#7845;t, mi&#7873;n b&#7843;o v&#7879;, ma tr&#7853;n quy&#7873;n truy xu&#7845;t</P>
<P ALIGN="JUSTIFY">2. C&aacute;c c&#417; ch&#7871; b&#7843;o v&#7879; : ACL, Capalities</P>
<P ALIGN="JUSTIFY">3. C&aacute;c chi&#7871;n l&#432;&#7907;c an to&agrave;n h&#7879; th&#7889;ng :ki&#7875;m <FONT FACE="Times New Roman">&#273;&#7883;nh danh tính.</P>
</blockquote>
</FONT>
<P align="left"><a name="baitap"><img border="0" src="images/blebul1a.gif" width="20" height="20">
<b><font color="#FF0000" face="Times New Roman" size="4">Bài t&#7853;p</font></b></a></P>
  <blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 1.</b> Kh&#7843; n<FONT FACE="Times New Roman">&#259;ng h&#7841;n ch&#7871; truy xu&#7845;t d&#7921;a tr</FONT>&ecirc;n nguy&ecirc;n l&yacute; «&nbsp;need-to-know&nbsp;» c&oacute; th&#7875; gi&uacute;p ch&#7889;ng l&#7841;i lo&#7841;i ch&#432;&#417;ng tr&igrave;nh  ph&aacute; ho&#7841;i n&agrave;o&nbsp;? </P>
<P ALIGN="JUSTIFY"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 2.</b> X&eacute;t 4 ti&#7871;n tr&igrave;nh sau, m&#7895;i ti&#7871;n tr&igrave;nh ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng trong m&#7897;t mi&#7873;n b&#7843;o v&#7879; khác nhau &#273;</FONT>&#432;&#7907;c m&ocirc; t&#7843; trong ma tr&#7853;n quy&#7873;n truy xu&#7845;t d&#432;&#7899;i <FONT FACE="Times New Roman">&#273;ây.  Trong mi&#7873;n b&#7843;o v&#7879; n</FONT>&agrave;o ti&#7871;n tr&igrave;nh kh&ocirc;ng th&#7875; <FONT FACE="Times New Roman">&#273;&#7885;c t&#7853;p tin F1 ( m</FONT>&agrave; kh&ocirc;ng c&oacute; s&#7921; gi&uacute;p <FONT FACE="Times New Roman">&#273;&#7905; c&#7911;a các ti&#7871;n tr</FONT>&igrave;nh kh&aacute;c)&nbsp;? </P>
  </blockquote>
<center>
<TABLE CELLSPACING=0 BORDER=0>
<TR><TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="CENTER"></TD>
<TD WIDTH="17%" VALIGN="TOP">
<B><P ALIGN="CENTER">FF1 </B></TD>
<TD WIDTH="17%" VALIGN="TOP">
<B><P ALIGN="CENTER">DD1 </B></TD>
<TD WIDTH="17%" VALIGN="TOP">
<B><P ALIGN="CENTER">DD2 </B></TD>
<TD WIDTH="19%" VALIGN="TOP">
<B><P ALIGN="CENTER">DD3 </B></TD>
<TD WIDTH="17%" VALIGN="TOP">
<B><P ALIGN="CENTER">DD4 </B></TD>
</TR>
<TR><TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="JUSTIFY">DD1 </TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">Ownerer</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="19%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
</TR>
<TR><TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="JUSTIFY">DD2 </TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">Readad*</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="19%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
</TR>
<TR><TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="JUSTIFY">DD3 </TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="19%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">Controlol</TD>
</TR>
<TR><TD WIDTH="13%" VALIGN="TOP">
<P ALIGN="JUSTIFY">DD4 </TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">Switchch</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="19%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
<TD WIDTH="17%" VALIGN="TOP">
<P ALIGN="CENTER">-</TD>
</TR>
<TR><TD WIDTH="13%" VALIGN="TOP">
 </TD>
<TD WIDTH="17%" VALIGN="TOP">
  </TD>
<TD WIDTH="17%" VALIGN="TOP">
  </TD>
<TD WIDTH="17%" VALIGN="TOP">
  </TD>
<TD WIDTH="19%" VALIGN="TOP">
  </TD>
<TD WIDTH="17%" VALIGN="TOP">
  </TD>
</TR>
</TABLE>
</center>

<DIR>

<P ALIGN="JUSTIFY"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 3.</b> Gi&#7843; s&#7917; ti&#7871;n tr&igrave;nh A <FONT FACE="Times New Roman">&#273;ang ho&#7841;t &#273;&#7897;ng trong mi&#7873;n b&#7843;o v&#7879; </FONT>D , thao t&aacute;c n&agrave;o A <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ph&eacute;p th&#7921;c hi&#7879;n trong c&aacute;c c&#417; ch&#7871; b&#7843;o v&#7879; d&#432;&#7899;i <FONT FACE="Times New Roman">&#273;ây&nbsp;: </P>
</FONT>
<blockquote>
  <P ALIGN="JUSTIFY">a)S&#7917; d&#7909;ng danh s&aacute;ch quy&#7873;n truy xu&#7845;t (access list system), th&ecirc;m m&#7897;t ph&#7847;n t&#7917; v&agrave;o danh s&aacute;ch quy&#7873;n truy xu&#7845;t c&#7911;a m&#7897;t <FONT FACE="Times New Roman">&#273;&#7889;i t</FONT>&#432;&#7907;ng s&#7905; h&#7919;u b&#7903;i D </P>
<P ALIGN="JUSTIFY">b)S&#7917; d&#7909;ng danh s&aacute;ch ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng (capability list s</FONT>ystem), th&ecirc;m m&#7897;t ph&#7847;n t&#7917; v&agrave;o danh s&aacute;ch ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng c&#7911;a D </P>
  </blockquote>
</FONT><P ALIGN="JUSTIFY"><img border="0" src="images/help.gif" width="16" height="16">
<b>Bài 4.</b> Gi&#7843; s&#7917;  m&#7897;t l&#7899;p th&#7921;c h&agrave;nh UNIX <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7893; ch&#7913;c nh&#432; sau :</P>
</DIR>
  <blockquote>
    <blockquote>

<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">T&#7845;t c&#7843; sinh vi&ecirc;n trong l&#7899;p thu&#7897;c v&#7873; m&#7897;t nh&oacute;m th&#7921;c h&agrave;nh c&#7911;a l&#7899;p .</P>
<P ALIGN="JUSTIFY"><img border="0" src="images/red.gif" width="7" height="10">Gi&aacute;o vi&ecirc;n h&#432;&#7899;ng d&#7851;n th&#7921;c h&agrave;nh kh&ocirc;ng thu&#7897;c v&#7873; nh&oacute;m th&#7921;c h&agrave;nh, nh&#432;ng l&#7841;i s&#7905; h&#7919;u c&aacute;c t&#7853;p tin trong th&#432; m&#7909;c c&#7911;a nh&oacute;m. Nh&#432; v&#7853;y, quy&#7873;n truy xu&#7845;t c&#7911;a gi&aacute;o vi&ecirc;n h&#432;&#7899;ng d&#7851;n tr&ecirc;n c&aacute;c t&#7853;p tin n&agrave;y l&agrave; quy&#7873;n s&#7905; h&#7919;u, trong khi c&aacute;c sinh vi&ecirc;n nh&#7853;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c quy&#7873;n truy xu&#7845;t nh&#432; l&agrave; th&agrave;nh vi&ecirc;n c&#7911;a nh&oacute;m. </P>
    </blockquote>
  </blockquote>
  <DIR>

<P ALIGN="JUSTIFY">X&eacute;t chi&#7871;n l&#432;&#7907;c b&#7843;o v&#7879; sau&nbsp;: l&#7899;p <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; CLASS; bao g&#7891;m 2 sinh vi&ecirc;n A v&agrave;  B. C kh&ocirc;ng ph&#7843;i l&agrave; sinh vi&ecirc;n thu&#7897;c l&#7899;p CLASS. Gi&aacute;o vi&ecirc;n h&#432;&#7899;ng d&#7851;n l&agrave; GVHD. M&#7895;i sinh vi&ecirc;n c&oacute; m&#7897;t t&#7853;p tin ri&ecirc;ng l&#432;u b&agrave;i t&#7853;p g&#7885;i l&agrave; HW, ch&#7881; c&oacute; sinh vi&ecirc;n <FONT FACE="Times New Roman">&#273;ó &#273;</FONT>&#432;&#7907;c quy&#7873;n <FONT FACE="Times New Roman">&#273;&#7885;c, ghi. GVHD có m&#7897;t t&#7853;p tin l</FONT>&#432;u k&#7871;t q&#7911;a <FONT FACE="Times New Roman">&#273;ánh giá th&#7921;c h</FONT>&agrave;nh l&agrave; GRADES, ch&#7881; c&oacute; GVHD<FONT FACE="Times New Roman">&#273;ó &#273;</FONT>&#432;&#7907;c quy&#7873;n <FONT FACE="Times New Roman">&#273;&#7885;c, ghi. GVHD có quy&#7873;n &#273;&#7885;c ghi hai t&#7853;p tin &#273;&#7873; c</FONT>&#432;&#417;ng SYLLABUS , v&agrave; b&agrave;i t&#7853;p th&#7921;c h&agrave;nh ASSIGNMENT ; t&#7845;t c&#7843; sinh vi&ecirc;n c&#7911;a l&#7899;p c&oacute; quy&#7873;n <FONT FACE="Times New Roman">&#273;&#7885;c ASSIGNMENT. T&#7845;t c&#7843; m&#7885;i ng</FONT>&#432;&#7901;i <FONT FACE="Times New Roman">&#273;&#7873;u có quy&#7873;n &#273;&#7885;c SYLLABUS.</P>

</FONT>
</DIR>
  <blockquote>
    <blockquote>
      <P ALIGN="JUSTIFY">a) M&ocirc; t&#7843; chi&#7871;n l&#432;&#7907;c b&#7843;o v&#7879; n&agrave;y b&#7857;ng ma tr&#7853;n quy&#7873;n truy xu&#7845;t. </P>

<P ALIGN="JUSTIFY">b) M&ocirc; t&#7843; chi&#7871;n l&#432;&#7907;c b&#7843;o v&#7879; n&agrave;y b&#7857;ng t&#7853;p c&aacute;c danh s&aacute;ch ti&#7873;m n<FONT FACE="Times New Roman">&#259;ng cho m&#7895;i ng</FONT>&#432;&#7901;i d&ugrave;ng . </P>
<P ALIGN="JUSTIFY">c) M&ocirc; t&#7843; chi&#7871;n l&#432;&#7907;c b&#7843;o v&#7879; n&agrave;y b&#7857;ng t&#7853;p c&aacute;c danh s&aacute;ch quy&#7873;n truy xu&#7845;t cho m&#7895;i t&#7853;p tin </P>

<P ALIGN="JUSTIFY">d) M&ocirc; t&#7843; c&aacute;ch th&#7913;c UNIX cho ph&eacute;p th&#7921;c hi&#7879;n chi&#7871;n l&#432;&#7907;c n&agrave;y. </P>
    </blockquote>
  </blockquote>
</center>
</BODY>
</HTML>
