<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<LINK REL="stylesheet" TYPE="text/css" HREF="style.css" TITLE="MTD">
<TITLE>He thong quan ly nhap xuat</TITLE>
</HEAD>
<BODY LINK="#0000ff">

<B><P ALIGN="CENTER"><font face="Verdana" size="2">BÀI 11 </font><font size="5" face="Verdana">H&#7878; TH&#7888;NG QU&#7842;N L&Yacute; NH&#7852;P/XU&#7844;T</font></P>

</B>
<blockquote>
  <P><EM>M&#7897;t trong nh&#7919;ng ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng chính c&#7911;a h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh l&agrave; qu&#7843;n l&yacute; t&#7845;t c&#7843; nh&#7919;ng thi&#7871;t b&#7883; nh&#7853;p/xu&#7845;t c&#7911;a m&aacute;y t&iacute;nh. H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ph&#7843;i ra c&aacute;c ch&#7881; th&#7883; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883;, ki&#7875;m soát các ng&#7855;t v</FONT>&agrave; l&#7895;i. H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ph&#7843;i cung c&#7845;p m&#7897;t c&aacute;ch giao ti&#7871;p <FONT FACE="Times New Roman">&#273;</FONT>&#417;n gi&#7843;n v&agrave; ti&#7879;n d&#7909;ng gi&#7919;a c&aacute;c thi&#7871;t b&#7883; v&agrave; ph&#7847;n c&ograve;n l&#7841;i c&#7911;a h&#7879; th&#7889;ng v&agrave; giao ti&#7871;p n&agrave;y ph&#7843;i <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p v&#7899;i thi&#7871;t b&#7883;. Trong b</FONT>&agrave;i n&agrave;y ch&uacute;ng ta t&igrave;m hi&#7875;u h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh qu&#7843;n l&yacute; nh&#7853;p/xu&#7845;t nh&#432; th&#7871; n&agrave;o v&#7899;i nh&#7919;ng n&#7897;i dung sau: </P>

</EM>
  <blockquote>
    <P><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#khainiem">Khái ni&#7879;m
    v&#7873; h&#7879; th&#7889;ng nh&#7853;p/ xu&#7845;t</a></P>
    <P><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#phancung">Ph&#7847;n c&#7913;ng
    nh&#7853;p / xu&#7845;t</a></P>
    <P><img border="0" src="images/dotgreen.gif" width="9" height="9"><a href="#phanmem">Ph&#7847;n m&#7873;m
    nh&#7853;p / xu&#7845;t</a></P>
  </blockquote>
  </blockquote>

<P>&nbsp;&nbsp;&nbsp; Qua b&agrave;i h&#7885;c n&agrave;y, ch&uacute;ng ta hi&#7875;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#417; ch&#7871; qu&#7843;n l&yacute; nh&#7853;p/xu&#7845;t c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh m&#7897;t c&aacute;ch t&#7893;ng qu&aacute;t. T&#7915; <FONT FACE="Times New Roman">&#273;ó chúng ta có th&#7875; hi&#7875;u r</FONT>&otilde; h&#417;n qu&aacute; tr&igrave;nh nh&#7853;p xu&#7845;t di&#7877;n ra tr&ecirc;n m&aacute;y t&iacute;nh th&ocirc;ng qua h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh nh&#432; th&#7871; n&agrave;o. B&agrave;i h&#7885;c n&agrave;y c&#361;ng gi&uacute;p cho vi&#7879;c t&igrave;m hi&#7875;u c&#417; ch&#7871; t&#432;&#417;ng t&aacute;c gi&#7919;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh v&agrave; c&aacute;c thi&#7871;t b&#7883; nh&#7853;p/xu&#7845;t c&#7909; th&#7875;(<FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7873; c&#7853;p trong b</FONT>&agrave;i h&#7885;c sau) d&#7877; d&agrave;ng h&#417;n.</P>
<P>B&agrave;i h&#7885;c n&agrave;y <FONT FACE="Times New Roman">&#273;</FONT>&ograve;i h&#7887;i nh&#7919;ng ki&#7871;n th&#7913;c v&#7873; : ki&#7871;n tr&uacute;c m&aacute;y t&iacute;nh, c&#417; ch&#7871; ng&#7855;t tr&ecirc;n m&aacute;y t&iacute;nh. </P>
<P>&nbsp;</P><STRONG><P ALIGN="JUSTIFY" class="cap1"><a name="khainiem">I.KH&Aacute;I NI&#7878;M V&#7872; H&#7878; TH&#7888;NG QU&#7842;N L&Yacute; NH&#7852;P/XU&#7844;T</a></P></STRONG><P>&nbsp;&nbsp;&nbsp; H&#7879; th&#7889;ng qu&#7843;n l&yacute; nh&#7853;p/xu&#7845;t <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7893; ch&#7913;c theo t&#7915;ng l&#7899;p, m&#7895;i l&#7899;p c&oacute; m&#7897;t ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng nh&#7845;t &#273;&#7883;nh v</FONT>&agrave; c&aacute;c l&#7899;p c&oacute; giao ti&#7871;p v&#7899;i nhau nh&#432; s&#417; <FONT FACE="Times New Roman">&#273;&#7891; sau :</P>

</FONT>
<blockquote>
  <blockquote>
    <P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <STRONG>C&Aacute;C L&#7898;P</STRONG> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <STRONG>CH&#7912;C N<FONT FACE="Times New Roman">&#258;NG NH&#7852;P/XU&#7844;T</P>
    </blockquote>
    </blockquote>
</FONT></STRONG>
<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 BORDERCOLOR="#7f7f7f" CELLPADDING=7 WIDTH=433>
<TR><TD WIDTH="33%" VALIGN="TOP" BGCOLOR="#00ffff">
<P ALIGN="CENTER">X&#7917; l&yacute; c&#7911;a ng&#432;&#7901;i d&ugrave;ng</TD>
<TD WIDTH="67%" VALIGN="TOP">
<P>T&#7841;o l&#7901;i g&#7885;i nh&#7853;p/xu&#7845;t, <FONT FACE="Times New Roman">&#273;&#7883;nh d&#7841;ng nh&#7853;p/xu&#7845;t</FONT></TD>
</TR>
<TR><TD WIDTH="33%" VALIGN="TOP" BGCOLOR="#00ff00">
<P ALIGN="CENTER">Ph&#7847;n m&#7873;m <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883;</FONT></TD>
<TD WIDTH="67%" VALIGN="TOP">
<FONT FACE="Times New Roman"><P>&#272;&#7863;t t</FONT>&ecirc;n, b&#7843;o v&#7879;, t&#7893; ch&#7913;c kh&#7889;i, b&#7897; <FONT FACE="Times New Roman">&#273;&#7879;m, &#273;&#7883;nh v&#7883;</FONT></TD>
</TR>
<TR><TD WIDTH="33%" VALIGN="TOP" BGCOLOR="#ffff00">
<FONT FACE="Times New Roman"><P ALIGN="CENTER">&#272;i&#7873;u khi&#7875;n thi&#7871;t b&#7883;</FONT></TD>
<TD WIDTH="67%" VALIGN="TOP">
<P>Thi&#7871;t l&#7853;p thanh ghi thi&#7871;t b&#7883;, ki&#7875;m tra tr&#7841;ng th&aacute;i</TD>
</TR>
<TR><TD WIDTH="33%" VALIGN="TOP" BGCOLOR="#ffff00">
<P ALIGN="CENTER">Ki&#7875;m so&aacute;t ng&#7855;t</TD>
<TD WIDTH="67%" VALIGN="TOP">
<P>B&aacute;o cho driver khi nh&#7853;p/xu&#7845;t ho&agrave;n t&#7845;t</TD>
</TR>
<TR><TD WIDTH="33%" VALIGN="TOP" BGCOLOR="#0000ff">
<P ALIGN="CENTER">Ph&#7847;n c&#7913;ng</TD>
<TD WIDTH="67%" VALIGN="TOP">
<P>Th&#7921;c hi&#7879;n thao t&aacute;c nh&#7853;p/xu&#7845;t</TD>
</TR>
</TABLE>
</CENTER>
<U><P>V&iacute; d&#7909;</U>: Trong m&#7897;t ch&#432;&#417;ng tr&igrave;nh &#7913;ng d&#7909;ng, ng&#432;&#7901;i d&ugrave;ng mu&#7889;n <FONT FACE="Times New Roman">&#273;&#7885;c m&#7897;t kh&#7889;i t&#7915; m&#7897;t t&#7853;p tin, h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c k&iacute;ch ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7875; th&#7921;c hi&#7879;n y</FONT>&ecirc;u c&#7847;u n&agrave;y. Ph&#7847;n m&#7873;m <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883; t</FONT>&igrave;m ki&#7871;m trong cache, n&#7871;u kh&#7889;i c&#7847;n <FONT FACE="Times New Roman">&#273;&#7885;c không có s&#7861;n, nó s&#7869; g&#7885;i ch</FONT>&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; g&#7917;i y</FONT>&ecirc;u c&#7847;u <FONT FACE="Times New Roman">&#273;&#7871;n ph&#7847;n</FONT> c&#7913;ng. Ti&#7871;n tr&igrave;nh b&#7883; ng&#432;ng l&#7841;i cho <FONT FACE="Times New Roman">&#273;&#7871;n khi thao tác &#273;&#297;a ho</FONT>&agrave;n t&#7845;t. Khi thao t&aacute;c n&agrave;y ho&agrave;n t&#7845;t, ph&#7847;n c&#7913;ng ph&aacute;t sinh m&#7897;t ng&#7855;t. B&#7897; ph&#7853;n ki&#7875;m so&aacute;t ng&#7855;t ki&#7875;m tra bi&#7871;n c&#7889; n&agrave;y, ghi nh&#7853;n tr&#7841;ng th&aacute;i c&#7911;a thi&#7871;t b&#7883; v&agrave; <FONT FACE="Times New Roman">&#273;ánh th&#7913;c ti&#7871;n tr</FONT>&igrave;nh b&#7883; ng&#432;ng <FONT FACE="Times New Roman">&#273;&#7875; ch&#7845;m d&#7913;t y</FONT>&ecirc;u c&#7847;u I/O v&agrave; cho ti&#7871;n tr&igrave;nh c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng ti&#7871;p t&#7909;c th&#7921;c hi&#7879;n.[TAN]</P>
<P>&nbsp;</P><STRONG><P ALIGN="JUSTIFY" class="cap1"><a name="phancung">II. PH&#7846;N C&#7912;NG NH&#7852;P/XU&#7844;T</a></P>
</STRONG><P>&nbsp;&nbsp;&nbsp; C&oacute; nhi&#7873;u c&aacute;ch nh&igrave;n kh&aacute;c nhau v&#7873; ph&#7847;n c&#7913;ng nh&#7853;p/xu&#7845;t. C&aacute;c k&#7929; s&#432; <FONT FACE="Times New Roman">&#273;i&#7879;n t&#7917; th</FONT>&igrave; nh&igrave;n d&#432;&#7899;i g&oacute;c <FONT FACE="Times New Roman">&#273;&#7897; l</FONT>&agrave; c&aacute;c thi&#7871;t b&#7883; nh&#432; IC, d&acirc;y d&#7851;n, b&#7897; ngu&#7891;n, motor v.v….C&aacute;c l&#7853;p tr&igrave;nh vi&ecirc;n th&igrave; nh&igrave;n ch&uacute;ng d&#432;&#7899;i g&oacute;c <FONT FACE="Times New Roman">&#273;&#7897; ph&#7847;n m&#7873;m - nh&#7919;ng l&#7879;nh n</FONT>&agrave;o thi&#7871;t b&#7883; ch&#7845;p nh&#7853;n, ch&uacute;ng s&#7869; th&#7921;c hi&#7879;n nh&#7919;ng ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng n</FONT>&agrave;o, v&agrave; th&ocirc;ng b&aacute;o l&#7895;i c&#7911;a ch&uacute;ng bao g&#7891;m nh&#7919;ng g&igrave;, ngh&#297;a l&agrave; ch&uacute;ng ta quan t&acirc;m <FONT FACE="Times New Roman">&#273;&#7871;n l&#7853;p tr</FONT>&igrave;nh thi&#7871;t b&#7883; ch&#7913; kh&ocirc;ng ph&#7843;i c&aacute;c thi&#7871;t b&#7883; n&agrave;y ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng nh</FONT>&#432; th&#7871; n&agrave;o&nbsp; m&#7863;c d&ugrave; kh&iacute;a c&#7841;nh n&agrave;y c&oacute; li&ecirc;n quan m&#7853;t thi&#7871;t v&#7899;i c&aacute;c thao t&aacute;c b&ecirc;n trong c&#7911;a ch&uacute;ng. Ph&#7847;n n&agrave;y ch&uacute;ng ta <FONT FACE="Times New Roman">&#273;&#7873; c&#7853;p &#273;&#7871;n m&#7897;t s&#7889; khái ni&#7879;m v&#7873; ph&#7847;n c&#7913;ng I/O li</FONT>&ecirc;n quan <FONT FACE="Times New Roman">&#273;&#7871;n khía c&#7841;nh l&#7853;p tr</FONT>&igrave;nh. </P>

<FONT SIZE=4><STRONG><P class="cap2"><a name="thietbi"><img border="0" src="images/read_single.gif" width="15" height="12">
II.1 Thi&#7871;t b&#7883; I/O</a></STRONG> </FONT> </P>
<blockquote>


<P> C&aacute;c thi&#7871;t b&#7883; nh&#7853;p xu&#7847;t c&oacute; th&#7875; chia t&#432;&#417;ng <FONT FACE="Times New Roman">&#273;&#7889;i th</FONT>&agrave;nh hai lo&#7841;i l&agrave; thi&#7871;t b&#7883; kh&#7889;i v&agrave; thi&#7871;t b&#7883; tu&#7847;n t&#7921;. </P>


<P>Thi&#7871;t b&#7883; kh&#7889;i l&agrave; thi&#7871;t b&#7883; m&agrave; th&ocirc;ng tin <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c l&#432;u tr&#7919; trong nh&#7919;ng kh&#7889;i c&oacute; k&iacute;ch th&#432;&#7899;c c&#7889; <FONT FACE="Times New Roman">&#273;&#7883;nh v</FONT>&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;nh v&#7883; b&#7903;i &#273;&#7883;a ch&#7881;. Kích th</FONT>&#432;&#7899;c th&ocirc;ng th&#432;&#7901;ng c&#7911;a m&#7897;t kh&#7889;i l&agrave; kho&#7843;ng t&#7915; 128 bytes <FONT FACE="Times New Roman">&#273;&#7871;n 1024 bytes. &#272;&#7863;c &#273;i&#7875;m c&#7911;a thi&#7871;t b&#7883; kh&#7889;i l</FONT>&agrave; ch&uacute;ng c&oacute; th&#7875; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c truy xu&#7845;t (<FONT FACE="Times New Roman">&#273;&#7885;c ho&#7863;c ghi) t&#7915;ng kh&#7889;i ri</FONT>&ecirc;ng bi&#7879;t, v&agrave; ch&#432;&#417;ng tr&igrave;nh c&oacute; th&#7875; truy xu&#7845;t m&#7897;t kh&#7889;i b&#7845;t k&#7923; n&agrave;o <FONT FACE="Times New Roman">&#273;ó. &#272;&#297;a l</FONT>&agrave; m&#7897;t v&iacute; d&#7909; cho lo&#7841;i thi&#7871;t b&#7883; kh&#7889;i. </P>
<P>M&#7897;t d&#7841;ng thi&#7871;t b&#7883; th&#7913; hai l&agrave; thi&#7871;t b&#7883; tu&#7847;n t&#7921;. &#7902; d&#7841;ng thi&#7871;t b&#7883; n&agrave;y, vi&#7879;c g&#7917;i v&agrave; nh&#7853;n th&ocirc;ng tin d&#7921;a tr&ecirc;n l&agrave; chu&#7895;i c&aacute;c bits, kh&ocirc;ng c&oacute; x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh &#273;&#7883;a ch&#7881; v</FONT>&agrave; kh&ocirc;ng th&#7875; th&#7921;c hi&#7879;n thao t&aacute;c seek <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c. M&agrave;n h&igrave;nh, b&agrave;n ph&iacute;m, m&aacute;y in, card m&#7841;ng, chu&#7897;t, v&agrave; c&aacute;c lo&#7841;i thi&#7871;t b&#7883; kh&aacute;c kh&ocirc;ng ph&#7843;i d&#7841;ng <FONT FACE="Times New Roman">&#273;&#297;a </FONT>l&agrave; thi&#7871;t b&#7883; tu&#7847;n t&#7921;.</P>
<P>Vi&#7879;c ph&acirc;n chia c&aacute;c l&#7899;p nh&#432; tr&ecirc;n kh&ocirc;ng ho&agrave;n to&agrave;n t&#7889;i &#432;u, m&#7897;t s&#7889; c&aacute;c thi&#7871;t b&#7883; kh&ocirc;ng ph&ugrave; h&#7907;p v&#7899;i hai l&#7899;p tr&ecirc;n, v&iacute; d&#7909; : <FONT FACE="Times New Roman">&#273;&#7891;ng h&#7891;, b&#7897; nh&#7899; m</FONT>&agrave;n h&igrave;nh v.v...kh&ocirc;ng th&#7921;c hi&#7879;n theo c&#417; ch&#7871; tu&#7847;n t&#7921; c&aacute;c bits. Ngo&agrave;i ra, ng&#432;&#7901;i ta c&ograve;n ph&acirc;n lo&#7841;i c&aacute;c thi&#7871;t b&#7883; I/O d&#432;&#7899;i m&#7897;t ti&ecirc;u chu&#7849;n kh&aacute;c : </P>
<P>Thi&#7871;t b&#7883; t&#432;&#417;ng t&aacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c v&#7899;i con ng&#432;&#7901;i : d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7875; giao ti&#7871;p gi&#7919;a ng</FONT>&#432;&#7901;i v&agrave; m&aacute;y. V&iacute; d&#7909; : m&agrave;n h&igrave;nh, b&agrave;n ph&iacute;m, chu&#7897;t, m&aacute;y in ...</P>
<P>Thi&#7871;t b&#7883; t&#432;&#417;ng t&aacute;c trong h&#7879; th&#7889;ng m&aacute;y t&iacute;nh l&agrave; c&aacute;c thi&#7871;t b&#7883; giao ti&#7871;p v&#7899;i nhau. V&iacute; d&#7909; : <FONT FACE="Times New Roman">&#273;&#297;a, b&#259;ng t&#7915;, card giao ti&#7871;p...</P>
</FONT><P>Thi&#7871;t b&#7883; truy&#7873;n th&#7891;ng : nh&#432; modem...</P>
<P>Nh&#7919;ng <FONT FACE="Times New Roman">&#273;i&#7875;m khác nhau gi&#7919;a các thi&#7871;t b&#7883; I/O g&#7891;m : </P><blockquote>

</FONT><P><img border="0" src="images/red.gif" width="7" height="10">T&#7889;c <FONT FACE="Times New Roman">&#273;&#7897; truy&#7873;n d&#7919; li&#7879;u , ví d&#7909; b</FONT>&agrave;n ph&iacute;m : 0.01 KB/s, chu&#7897;t 0.02 KB/s ... </P>
<P><img border="0" src="images/red.gif" width="7" height="10">C&ocirc;ng d&#7909;ng. </P>
<P><img border="0" src="images/red.gif" width="7" height="10"><FONT FACE="Times New Roman">&#272;</FONT>&#417;n v&#7883; truy&#7873;n d&#7919; li&#7879;u (kh&#7889;i ho&#7863;c k&yacute; t&#7921;). </P>
<P><img border="0" src="images/red.gif" width="7" height="10">Bi&#7875;u di&#7877;n d&#7919; li&#7879;u, <FONT FACE="Times New Roman">&#273;i&#7873;u n</FONT>&agrave;y t&ugrave;y thu&#7897;c v&agrave;o t&#7915;ng thi&#7871;t b&#7883; c&#7909; th&#7875;. </P>
<P><img border="0" src="images/red.gif" width="7" height="10">T&igrave;nh tr&#7841;ng l&#7895;i : nguy&ecirc;n nh&acirc;n g&acirc;y ra l&#7895;i, c&aacute;ch m&agrave; ch&uacute;ng b&aacute;o v&#7873;... </P>
</blockquote>

</blockquote>

<FONT SIZE=4><P class="cap2"><a name="tochuc"><img border="0" src="images/read_single.gif" width="15" height="12">
II.2 T&#7893; ch&#7913;c c&#7911;a ch&#7913;c n</a></FONT><a name="tochuc"><FONT FACE="Times New Roman" SIZE=4>&#259;ng I/O</FONT> </a> </P>

<blockquote>

<P>C&oacute; ba c&aacute;ch <FONT FACE="Times New Roman">&#273;&#7875; th&#7921;c hi&#7879;n I/O :</P>
</FONT>
  <blockquote>
    <P><img border="0" src="images/red.gif" width="7" height="10">M&#7897;t l&agrave;, b&#7897; x&#7917; l&yacute; ph&aacute;t sinh m&#7897;t l&#7879;nh I/O <FONT FACE="Times New Roman">&#273;&#7871;n c</FONT>&aacute;c <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; I/O, sau <FONT FACE="Times New Roman">&#273;ó, nó ch&#7901; trong tr&#7841;ng thái "busy" cho&nbsp;&nbsp; &#273;&#7871;n khi thao tác n</FONT>&agrave;y ho&agrave;n t&#7845;t tr&#432;&#7899;c khi ti&#7871;p t&#7909;c x&#7917; l&yacute;.</P>
<P><img border="0" src="images/red.gif" width="7" height="10">Hai l&agrave;, b&#7897; x&#7917; l&yacute; ph&aacute;t sinh m&#7897;t l&#7879;nh I/O <FONT FACE="Times New Roman">&#273;&#7871;n các &#273;</FONT>&#417;n v&#7883; I/O, sau <FONT FACE="Times New Roman">&#273;ó, nó ti&#7871;p t&#7909;c vi&#7879;c x&#7917; lý cho t&#7899;i khi nh&#7853;n &#273;</FONT>&#432;&#7907;c m&#7897;t ng&#7855;t t&#7915; <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; I/O b&aacute;o l&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&atilde; ho&agrave;n t&#7845;t, n&oacute; t&#7841;m ng&#432;ng vi&#7879;c x&#7917; l&yacute; hi&#7879;n t&#7841;i <FONT FACE="Times New Roman">&#273;&#7875; chuy&#7875;n qua x&#7917; lý ng&#7855;t.</P>
</FONT><P><img border="0" src="images/red.gif" width="7" height="10">Ba l&agrave;, s&#7917; d&#7909;ng c&#417; ch&#7871; DMA (nh&#432; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7873; c&#7853;p &#7903; sau)</P>
    </blockquote>
</FONT><P>C&aacute;c b&#432;&#7899;c ti&#7871;n h&oacute;a c&#7911;a ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng I/O :</P>
</FONT>
  <blockquote>
    <P><img border="0" src="images/red.gif" width="7" height="10">B&#7897; x&#7917; l&yacute; ki&#7875;m so&aacute;t tr&#7921;c ti&#7871;p c&aacute;c thi&#7871;t b&#7883; ngo&#7841;i vi.</P>
<P><img border="0" src="images/red.gif" width="7" height="10">H&#7879; th&#7889;ng c&oacute; th&ecirc;m b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883;. B&#7897; x&#7917; lý s&#7917; d&#7909;ng cách th&#7921;c hi&#7879;n nh&#7853;p xu&#7845;t th&#7913; nh&#7845;t. Theo cách n</FONT>&agrave;y b&#7897; x&#7917; l&yacute; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&aacute;ch r&#7901;i kh&#7887;i c&aacute;c m&ocirc; t&#7843; chi ti&#7871;t c&#7911;a c&aacute;c thi&#7871;t b&#7883; ngo&#7841;i vi.</P>
<P><img border="0" src="images/red.gif" width="7" height="10">B&#7897; x&#7917; l&yacute; s&#7917; d&#7909;ng th&ecirc;m c&#417; ch&#7871; ng&#7855;t.</P>
<P><img border="0" src="images/red.gif" width="7" height="10">S&#7917; d&#7909;ng c&#417; ch&#7871; DMA, b&#7897; x&#7917; l&yacute; truy xu&#7845;t nh&#7919;ng d&#7919; li&#7879;u I/O tr&#7921;c ti&#7871;p trong b&#7897; nh&#7899; ch&iacute;nh.</P>
</blockquote>
<FONT SIZE=4>
</blockquote>

<P class="cap2"><a name="dieukhien"><img border="0" src="images/read_single.gif" width="15" height="12">
II.3 B&#7897; </a> </FONT><a name="dieukhien"><FONT FACE="Times New Roman" SIZE=4>&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883;</FONT> </a> </P>
<blockquote>
<P>M&#7897;t <FONT FACE="Times New Roman">&#273;</FONT>&#417;n v&#7883; b&#7883; nh&#7853;p xu&#7845;t th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chia l&agrave;m hai th&agrave;nh ph&#7847;n ch&iacute;nh l&agrave; th&agrave;nh ph&#7847;n c&#417; v&agrave; th&agrave;nh ph&#7847;n <FONT FACE="Times New Roman">&#273;i&#7879;n t&#7917;. Th</FONT>&agrave;nh ph&#7847;n <FONT FACE="Times New Roman">&#273;i&#7879;n t&#7917; &#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; b&#7897; ph&#7853;n <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; hay b&#7897; t</FONT>&#432;&#417;ng th&iacute;ch, trong c&aacute;c m&aacute;y vi t&iacute;nh th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c g&#7885;i l&agrave; card giao ti&#7871;p. Th&agrave;nh ph&#7847;n c&#417; ch&iacute;nh l&agrave; b&#7843;n th&acirc;n thi&#7871;t b&#7883;.</P>
<P>M&#7897;t b&#7897; ph&#7853;n <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n th</FONT>&#432;&#7901;ng c&oacute; b&#7897; ph&#7853;n k&#7871;t n&#7889;i tr&ecirc;n ch&uacute;ng <FONT FACE="Times New Roman">&#273;&#7875; có th&#7875; g&#7855;n thi&#7871;t b&#7883; l</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;ó. M&#7897;t b&#7897; ph&#7853;n &#273;i&#7873;u khi&#7875;n có th&#7875; qu&#7843;n lý &#273;</FONT>&#432;&#7907;c hai, b&#7889;n hay th&#7853;m ch&iacute; t&aacute;m thi&#7871;t b&#7883; kh&aacute;c nhau. N&#7871;u giao ti&#7871;p gi&#7919;a thi&#7871;t b&#7883; v&agrave; b&#7897; ph&#7853;n <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n l</FONT>&agrave; c&aacute;c chu&#7849;n nh&#432; ANSI, IEEE hay ISO th&igrave; nh&agrave; s&#7843;n xu&#7845;t thi&#7871;t b&#7883; v&agrave; b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n ph&#7843;i tuân theo chu&#7849;n &#273;ó, ví d&#7909; : b&#7897; &#273;i&#7873;u khi&#7875;n &#273;&#297;a &#273;</FONT>&#432;&#7907;c theo chu&#7849;n giao ti&#7871;p c&#7911;a IBM. </P>
<P>Giao ti&#7871;p gi&#7919;a b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n v</FONT>&agrave; thi&#7871;t b&#7883; l&agrave; giao ti&#7871;p &#7903; m&#7913;c th&#7845;p.</P>
<P align="center"><img border="0" src="images/hinh11.1.gif" width="525" height="204"></P>
<P>Ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a b&#7897; &#273;i&#7873;u khi&#7875;n l</FONT>&agrave; giao ti&#7871;p v&#7899;i h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh v&igrave; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh kh&ocirc;ng th&#7875; truy xu&#7845;t tr&#7921;c ti&#7871;p v&#7899;i thi&#7871;t b&#7883;. Vi&#7879;c th&ocirc;ng tin th&ocirc;ng qua h&#7879; th&#7889;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7901;ng truy&#7873;n g&#7885;i l&agrave; bus. </P>
<P>C&ocirc;ng vi&#7879;c c&#7911;a b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n l</FONT>&agrave; chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7893;i d</FONT>&atilde;y c&aacute;c bit tu&#7847;n t&#7921; trong m&#7897;t kh&#7889;i c&aacute;c byte v&agrave; th&#7921;c hi&#7879;n s&#7917;a ch&#7917;a n&#7871;u c&#7847;n thi&#7871;t. Th&ocirc;ng th&#432;&#7901;ng kh&#7889;i c&aacute;c byte <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7893; ch&#7913;c th&agrave;nh t&#7915;ng bit v&agrave; <FONT FACE="Times New Roman">&#273;&#7863;t trong buffer c&#7911;a b&#7897; &#273;i&#7873;u khi&#7875;n. Sau khi th&#7921;c hi&#7879;n checksum n&#7897;i dung c&#7911;a buffer</FONT> s&#7869; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c chuy&#7875;n v&agrave;o b&#7897; nh&#7899; ch&iacute;nh. V&iacute; d&#7909; : b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n cho m</FONT>&agrave;n h&igrave;nh <FONT FACE="Times New Roman">&#273;&#7885;c các byte c&#7911;a ký t&#7921; &#273;&#7875; hi&#7875;n th&#7883; trong b&#7897; nh&#7899; v</FONT>&agrave; t&#7893; ch&#7913;c c&aacute;c t&iacute;n hi&#7879;u <FONT FACE="Times New Roman">&#273;&#7875; &#273;i&#7873;u khi&#7875;n các tia c&#7911;a CRT &#273;&#7875; xu&#7845;t tr</FONT>&ecirc;n m&agrave;n &#7843;nh b&#7857;ng c&aacute;ch qu&eacute;t c&aacute;c tia d&#7885;c v&agrave; ngang. N&#7871;u kh&ocirc;ng c&oacute; b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n,</FONT> l&#7853;p tr&igrave;nh vi&ecirc;n h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ph&#7843;i t&#7841;o th&ecirc;m ch&#432;&#417;ng tr&igrave;nh <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n tín hi&#7879;u analog cho &#273;</FONT>&egrave;n h&igrave;nh. V&#7899;i b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n , h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh ch&#7881; c&#7847;n kh&#7903;i <FONT FACE="Times New Roman">&#273;&#7897;ng chúng v&#7899;i m&#7897;t s&#7889; tham s&#7889; nh</FONT>&#432; s&#7889; k&yacute; t&#7921; tr&ecirc;n m&#7897;t d&ograve;ng, s&#7889; d&ograve;ng tr&ecirc;n m&agrave;n h&igrave;nh v&agrave; b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n s&#7869; th&#7921;c hi&#7879;n &#273;i&#7873;u khi&#7875;n các tia.</P>
</FONT><P>M&#7895;i b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n có m&#7897;t s&#7889; thanh ghi &#273;&#7875; li</FONT>&ecirc;n l&#7841;c v&#7899;i CPU. Tr&ecirc;n m&#7897;t s&#7889; m&aacute;y t&iacute;nh, c&aacute;c thanh ghi n&agrave;y l&agrave; m&#7897;t ph&#7847;n c&#7911;a b&#7897; nh&#7899; ch&iacute;nh t&#7841;i m&#7897;t <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; xác &#273;&#7883;nh g&#7885;i l</FONT>&agrave; &aacute;nh x&#7841; b&#7897; nh&#7899; nh&#7853;p xu&#7845;t. H&#7879; m&aacute;y PC d&agrave;nh ra m&#7897;t v&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#273;&#7863;c bi&#7879;t g&#7885;i l</FONT>&agrave; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; nh&#7853;p xu&#7845;t v</FONT>&agrave; trong <FONT FACE="Times New Roman">&#273;ó &#273;</FONT>&#432;&#7907;c chia l&agrave;m nhi&#7873;u <FONT FACE="Times New Roman">&#273;o&#7841;n, m&#7895;i &#273;o&#7841;n cho m&#7897;t lo&#7841;i thi&#7871;t b&#7883; nh</FONT>&#432; sau :</P>

<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 BORDERCOLOR="#7f7f7f" CELLPADDING=7 WIDTH=424>
<TR><TD WIDTH="35%" VALIGN="TOP" class="TD1">
<P ALIGN="CENTER">B&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n nh&#7853;p/xu&#7845;t</FONT></TD>
<TD WIDTH="38%" VALIGN="TOP" class="TD1">
<FONT FACE="Times New Roman"><P ALIGN="CENTER">&#272;&#7883;a ch&#7881; nh&#7853;p/xu&#7845;t</FONT></TD>
<TD WIDTH="27%" VALIGN="TOP" class="TD1">
<P ALIGN="CENTER">Vect&#417; ng&#7855;t</TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="TOP" class="TD2">
<FONT FACE="Times New Roman"><P>&#272;&#7891;ng h&#7891;</FONT></TD>
<TD WIDTH="38%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">040 - 043</TD>
<TD WIDTH="27%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">8</TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="TOP" class="TD2">
<P>B&agrave;n ph&iacute;m</TD>
<TD WIDTH="38%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">060 - 063</TD>
<TD WIDTH="27%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">9</TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="TOP" class="TD2">
<P>RS232 ph&#7909;</TD>
<TD WIDTH="38%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">2F8 - 2FF</TD>
<TD WIDTH="27%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">11</TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="TOP" class="TD2">
<FONT FACE="Times New Roman"><P>&#272;&#297;a c&#7913;ng</FONT></TD>
<TD WIDTH="38%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">320 - 32F</TD>
<TD WIDTH="27%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">13</TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="TOP" class="TD2">
<P>M&aacute;y in</TD>
<TD WIDTH="38%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">378 - 37F</TD>
<TD WIDTH="27%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">15</TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="TOP" class="TD2">
<P>M&agrave;n h&igrave;nh mono</TD>
<TD WIDTH="38%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">380 - 3BF</TD>
<TD WIDTH="27%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">-</TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="TOP" class="TD2">
<P>M&agrave;n h&igrave;nh m&agrave;u</TD>
<TD WIDTH="38%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">3D0 - 3DF</TD>
<TD WIDTH="27%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">-</TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="TOP" class="TD2">
<FONT FACE="Times New Roman"><P>&#272;&#297;a m&#7873;m</FONT></TD>
<TD WIDTH="38%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">3F0 - 3F7</TD>
<TD WIDTH="27%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">14</TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="TOP" class="TD2">
<P>RS232 ch&iacute;nh</TD>
<TD WIDTH="38%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">3F8 - 3FF</TD>
<TD WIDTH="27%" VALIGN="TOP" class="TD2">
<P ALIGN="CENTER">12</TD>
</TR>
</TABLE>
</CENTER>
<P>H&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh th&#7921;c hi&#7879;n nh&#7853;p xu&#7845;t b&#7857;ng c&aacute;ch ghi l&#7879;nh l&ecirc;n c&aacute;c thanh ghi c&#7911;a b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n. Ví d&#7909; : b&#7897; &#273;i&#7873;u khi&#7875;n &#273;&#297;a m&#7873;m c&#7911;a IBMPC ch&#7845;p nh&#7853;n 1</FONT>5 l&#7879;nh kh&aacute;c nhau nh&#432; : READ, WRITE, SEEK, FORMAT, RECALIBRATE, m&#7897;t s&#7889; l&#7879;nh c&oacute; tham s&#7889; v&agrave; c&aacute;c tham s&#7889; c&#361;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c n&#7841;p v&agrave;o thanh ghi. Khi m&#7897;t l&#7879;nh <FONT FACE="Times New Roman">&#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c ch&#7845;p nh&#7853;n, CPU s&#7869; r&#7901;i b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n &#273;&#7875; th&#7921;c hi&#7879;n công vi&#7879;c khác. Sau khi th&#7921;c hi&#7879;n xong, b&#7897; &#273;i&#7873;u khi&#7875;n ph</FONT>&aacute;t sinh m&#7897;t ng&#7855;t <FONT FACE="Times New Roman">&#273;&#7875; báo hi&#7879;u cho CPU bi&#7871;t v</FONT>&agrave; <FONT FACE="Times New Roman">&#273;&#7871;n l&#7845;y k&#7871;t qu&#7843; &#273;</FONT>&#432;&#7907;c l&#432;u gi&#7919; trong c&aacute;c thanh ghi. </P>

<FONT SIZE=4></blockquote>

<P class="cap2"><a name="dma"><img border="0" src="images/read_single.gif" width="15" height="12">
II.4 DMA (<U>Direct</U> <U>Memory</U> <U>Access</U>)</a></FONT> </P>

<blockquote>

<P>&nbsp;&nbsp;&nbsp; <FONT FACE="Times New Roman">&#272;a s&#7889; các lo&#7841;i thi&#7871;t b&#7883;, &#273;&#7863;c bi&#7879;t l</FONT>&agrave; c&aacute;c thi&#7871;t b&#7883; d&#7841;ng kh&#7889;i, h&#7895; tr&#7907; c&#417; ch&#7871; DMA (direct memory access). <FONT FACE="Times New Roman">&#272;&#7875; hi&#7875;u v&#7873; c</FONT>&#417; ch&#7871; n&agrave;y, tr&#432;&#7899;c h&#7871;t ph&#7843;i xem x&eacute;t qu&aacute; tr&igrave;nh <FONT FACE="Times New Roman">&#273;&#7885;c &#273;&#297;a m</FONT>&agrave; kh&ocirc;ng c&oacute; DMA. Tr&#432;&#7899;c ti&ecirc;n, b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n &#273;&#7885;c tu&#7847;n t&#7921; các kh&#7889;i tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a, t&#7915;ng bit t&#7915;ng bit cho t&#7899;i khi to</FONT>&agrave;n b&#7897; kh&#7889;i <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o buffer c&#7911;a b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n. Sau &#273;ó máy tính th&#7921;c hi&#7879;n checksum &#273;&#7875; &#273;&#7843;m b&#7843;o không có l&#7895;i x&#7843;y ra. Ti&#7871;p theo b&#7897; &#273;i&#7873;u khi&#7875;n t&#7841;o ra m&#7897;t ng&#7855;t &#273;&#7875; báo cho CPU bi&#7871;t. CPU &#273;&#7871;n l&#7845;y d&#7919; li&#7879;u trong buffer chuy&#7875;n v&#7873; b&#7897; nh&#7899; chính b&#7857;ng cách t&#7841;o m&#7897;t v</FONT>&ograve;ng l&#7863;p <FONT FACE="Times New Roman">&#273;&#7885;c l&#7847;n l</FONT>&#432;&#7907;t t&#7915;ng byte. Thao t&aacute;c n&agrave;y l&agrave;m l&atilde;ng ph&iacute; th&#7901;i gian c&#7911;a CPU. Do <FONT FACE="Times New Roman">&#273;ó &#273;&#7875; t&#7889;i </FONT>&#432;u, ng&#432;&#7901;i ta <FONT FACE="Times New Roman">&#273;</FONT>&#432;a ra c&#417; ch&#7871; DMA.</P>
<P>&nbsp;&nbsp;&nbsp; C&#417; ch&#7871; DMA gi&uacute;p cho CPU kh&ocirc;ng b&#7883; l&atilde;ng ph&iacute; th&#7901;i gian. Khi s&#7917; d&#7909;ng, CPU g&#7917;i cho b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n m&#7897;t s&#7889; các thông s&#7889; nh</FONT>&#432; <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; tr</FONT>&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a c&#7911;a kh&#7889;i, &#273;&#7883;a ch&#7881; trong b&#7897; nh&#7899; n</FONT>&#417;i <FONT FACE="Times New Roman">&#273;&#7883;nh v&#7883; kh&#7889;i, s&#7889; l</FONT>&#432;&#7907;ng byte d&#7919; li&#7879;u <FONT FACE="Times New Roman">&#273;&#7875; chuy&#7875;n.</P>
</FONT><P>&nbsp;&nbsp;&nbsp; Sau khi b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n &#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;&#7885;c to</FONT>&agrave;n b&#7897; d&#7919; li&#7879;u t&#7915; thi&#7871;t b&#7883; v&agrave;o buffer c&#7911;a n&oacute; v&agrave; ki&#7875;m tra checksum. B&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n chuy&#7875;n byte &#273;&#7847;u ti</FONT>&ecirc;n v&agrave;o b&#7897; nh&#7899; ch&iacute;nh t&#7841;i <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; &#273;</FONT>&#432;&#7907;c m&ocirc; t&#7843; b&#7903;i <FONT FACE="Times New Roman">&#273;&#7883;a ch&#7881; b&#7897; nh&#7899; DMA. Sau &#273;ó nó t&#259;ng &#273;&#7883;a ch&#7881; DMA v</FONT>&agrave; gi&#7843;m s&#7889; bytes ph&#7843;i chuy&#7875;n. Qu&aacute; tr&igrave;nh n&agrave;y l&#7853;p cho t&#7899;i khi s&#7889; bytes ph&#7843;i chuy&#7875;n b&#7857;ng 0, v&agrave; b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n t&#7841;o m&#7897;t ng&#7855;t. Nh</FONT>&#432; v&#7853;y kh&ocirc;ng c&#7847;n ph&#7843;i copy kh&#7889;i v&agrave;o trong b&#7897; nh&#7899;, n&oacute; <FONT FACE="Times New Roman">&#273;</FONT>&atilde; hi&#7879;n h&#7919;u trong b&#7897; nh&#7899;.</P>
<P align="center"><img border="0" src="images/hinh11.2.gif" width="432" height="214"></P>
<STRONG><P>&nbsp;</P>


<STRONG></blockquote>

<P ALIGN="JUSTIFY" class="cap1"><a name="phanmem">III. PH&#7846;N M&#7872;M NH&#7852;P/XU&#7844;T</a></P></STRONG>
</STRONG>
<P>&nbsp;&nbsp;&nbsp; M&#7909;c ti&ecirc;u chung c&#7911;a thi&#7871;t b&#7883; logic l&agrave; d&#7875; bi&#7875;u di&#7877;n. Thi&#7871;t b&#7883; logic <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c t&#7893; ch&#7913;c th&agrave;nh nhi&#7873;u l&#7899;p. L&#7899;p d&#432;&#7899;i c&ugrave;ng giao ti&#7871;p v&#7899;i ph&#7847;n c&#7913;ng, l&#7899;p tr&ecirc;n c&ugrave;ng giao ti&#7871;p t&#7889;t, th&acirc;n thi&#7879;n v&#7899;i ng&#432;&#7901;i s&#7917; d&#7909;ng. Kh&aacute;i ni&#7879;m then ch&#7889;t c&#7911;a thi&#7871;t b&#7883; logic l&agrave; <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883;, ví d&#7909; : có th&#7875; vi&#7871;t ch</FONT>&#432;&#417;ng tr&igrave;nh truy xu&#7845;t file tr&ecirc;n <FONT FACE="Times New Roman">&#273;&#297;a m&#7873;m hay &#273;&#297;a c&#7913;ng m</FONT>&agrave; kh&ocirc;ng c&#7847;n ph&#7843;i m&ocirc; t&#7843; l&#7841;i ch&#432;&#417;ng tr&igrave;nh cho t&#7915;ng lo&#7841;i thi&#7871;t b&#7883;. Ngo&agrave;i ra, thi&#7871;t b&#7883; logic ph&#7843;i c&oacute; kh&#7843; n<FONT FACE="Times New Roman">&#259;ng ki&#7875;m soát l&#7895;i. Thi&#7871;t b&#7883; logic &#273;</FONT>&#432;&#7907;c t&#7893; ch&#7913;c th&agrave;nh b&#7889;n l&#7899;p : Ki&#7875;m so&aacute;t l&#7895;i, <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883;, ph&#7847;n m&#7873;m h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883;, ph&#7847;n m&#7873;m m&#7913;c ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng. </P>
<STRONG>
<FONT SIZE=4><P class="cap2"><a name="ngat"><img border="0" src="images/read_single.gif" width="15" height="12">
III.1 Ki&#7875;m so&aacute;t ng&#7855;t</a></FONT> </P>
</STRONG>
<blockquote>
<P>Ng&#7855;t l&agrave; m&#7897;t hi&#7879;n t&#432;&#7907;ng ph&#7913;c t&#7841;p. N&oacute; ph&#7843;i c&#7847;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c che d&#7845;u s&acirc;u trong h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh, v&agrave; m&#7897;t ph&#7847;n&nbsp; &iacute;t c&#7911;a h&#7879; th&#7889;ng bi&#7871;t v&#7873; ch&uacute;ng. C&aacute;ch t&#7889;t nh&#7845;t <FONT FACE="Times New Roman">&#273;&#7875; che d&#7845;u chúng l</FONT>&agrave; h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&oacute; m&#7885;i ti&#7871;n tr&igrave;nh th&#7921;c hi&#7879;n thao t&aacute;c nh&#7853;p xu&#7845;t cho t&#7899;i khi ho&agrave;n t&#7845;t m&#7899;i t&#7841;o ra m&#7897;t ng&#7855;t. Ti&#7871;n tr&igrave;nh c&oacute; th&#7875; t&#7921; kh&oacute;a l&#7841;i b&#7857;ng c&aacute;ch th&#7921;c hi&#7879;n l&#7879;nh WAIT theo m&#7897;t bi&#7871;n <FONT FACE="Times New Roman">&#273;i&#7873;u ki&#7879;n ho&#7863;c RECEIVE theo m&#7897;t thông &#273;i&#7879;p.</P>
</FONT><P>Khi m&#7897;t ng&#7855;t x&#7843;y ra, h&agrave;m x&#7917; l&yacute; ng&#7855;t kh&#7903;i t&#7841;o m&#7897;t ti&#7871;n tr&igrave;nh m&#7899;i <FONT FACE="Times New Roman">&#273;&#7875; x&#7917; </FONT>l&yacute; ng&#7855;t. N&oacute; s&#7869; th&#7921;c hi&#7879;n m&#7897;t t&iacute;n hi&#7879;u tr&ecirc;n bi&#7871;n <FONT FACE="Times New Roman">&#273;i&#7873;u ki&#7879;n v</FONT>&agrave; g&#7917;i nh&#7919;ng th&ocirc;ng <FONT FACE="Times New Roman">&#273;i&#7879;p &#273;&#7871;n cho các ti&#7871;n tr</FONT>&igrave;nh b&#7883; kh&oacute;a. T&#7893;ng qu&aacute;t, ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a ng&#7855;t l</FONT>&agrave; l&agrave;m cho m&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang b&#7883; khóa &#273;</FONT>&#432;&#7907;c thi h&agrave;nh tr&#7903; l&#7841;i.</P>
</blockquote>

<FONT FACE="Times New Roman" SIZE=4><STRONG><P class="cap2"><a name="dktb"><img border="0" src="images/read_single.gif" width="15" height="12">
III.2 &#272;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; (device drivers)</a></STRONG> </FONT> </P><blockquote>

<P>T&#7845;t c&#7843; c&aacute;c <FONT FACE="Times New Roman">&#273;o&#7841;n m</FONT>&atilde; <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883; &#273;&#7873;u &#273;</FONT>&#432;&#7907;c chuy&#7875;n <FONT FACE="Times New Roman">&#273;&#7871;n device drivers. M&#7895;i device drivers ki&#7875;m soát m&#7895;i lo&#7841;i thi&#7871;t b&#7883;, nh</FONT>&#432;ng c&#361;ng c&oacute; khi l&agrave; m&#7897;t t&#7853;p h&#7907;p c&aacute;c thi&#7871;t b&#7883; li&ecirc;n quan m&#7853;t thi&#7871;t v&#7899;i nhau.</P>
<P>Device drivers ph&aacute;t ra c&aacute;c ch&#7881; th&#7883; v&agrave; ki&#7875;m tra xem ch&#7881; th&#7883; <FONT FACE="Times New Roman">&#273;ó có</FONT> <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n ch&iacute;nh x&aacute;c kh&ocirc;ng. V&iacute; d&#7909;, driver c&#7911;a <FONT FACE="Times New Roman">&#273;&#297;a l</FONT>&agrave; ph&#7847;n duy nh&#7845;t c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ki&#7875;m so&aacute;t b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n &#273;&#297;a. Nó qu&#7843;n lý sectors, tracks, cylinders, head, chuy&#7875;n &#273;&#7897;ng, interleave, v</FONT>&agrave; c&aacute;c th&agrave;nh ph&#7847;n kh&aacute;c gi&uacute;p cho c&aacute;c thao t&aacute;c <FONT FACE="Times New Roman">&#273;&#297;a &#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n t&#7889;t. </P>
<P>Ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a device drivers l</FONT>&agrave; nh&#7853;n nh&#7919;ng y&ecirc;u c&#7847;u tr&#7915;u t&#432;&#7907;ng t&#7915; ph&#7847;n m&#7873;m nh&#7853;p/xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883; &#7903; l&#7899;p tr</FONT>&ecirc;n, v&agrave; gi&aacute;m s&aacute;t y&ecirc;u c&#7847;u n&agrave;y th&#7921;c hi&#7879;n. N&#7871;u driver <FONT FACE="Times New Roman">&#273;ang r&#7843;nh, nó s&#7869; th&#7921;c hi&#7879;n ngay y</FONT>&ecirc;u c&#7847;u, ng&#432;&#7907;c l&#7841;i, y&ecirc;u c&#7847;u <FONT FACE="Times New Roman">&#273;ó s&#7869; &#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;</FONT>&#432;a v&agrave;o h&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i. </P>
</FONT><P>V&iacute; d&#7909;, b&#432;&#7899;c <FONT FACE="Times New Roman">&#273;&#7847;u ti</FONT>&ecirc;n c&#7911;a y&ecirc;u c&#7847;u nh&#7853;p/xu&#7845;t <FONT FACE="Times New Roman">&#273;&#297;a l</FONT>&agrave; chuy&#7875;n t&#7915; tr&#7915;u t&#432;&#7907;ng th&agrave;nh c&#7909; th&#7875;. Driver c&#7911;a <FONT FACE="Times New Roman">&#273;&#297;a ph&#7843;i bi&#7871;t kh&#7889;i n</FONT>&agrave;o c&#7847;n <FONT FACE="Times New Roman">&#273;&#7885;c, ki&#7875;m tra s&#7921; ho&#7841;t &#273;&#7897;ng c&#7911;a motor &#273;&#297;a, xác &#273;&#7883;nh v&#7883; trí c&#7911;a &#273;&#7847;u &#273;&#7885;c &#273;</FONT>&atilde; <FONT FACE="Times New Roman">&#273;úng ch</FONT>&#432;a v.v…</P>
<P>Ngh&#297;a l&agrave; device drivers ph&#7843;i x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh &#273;</FONT>&#432;&#7907;c nh&#7919;ng thao t&aacute;c n&agrave;o c&#7911;a b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n ph&#7843;i thi h</FONT>&agrave;nh v&agrave; theo tr&igrave;nh t&#7921; n&agrave;o. M&#7897;t khi <FONT FACE="Times New Roman">&#273;</FONT>&atilde; x&aacute;c <FONT FACE="Times New Roman">&#273;&#7883;nh &#273;</FONT>&#432;&#7907;c ch&#7881; th&#7883; cho b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n, nó b&#7855;t &#273;&#7847;u th&#7921;c hi&#7879;n b&#7857;ng cách chuy&#7875;n l&#7879;nh v</FONT>&agrave;o thanh ghi c&#7911;a b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883;. B&#7897; &#273;i&#7873;u khi&#7875;n có th&#7875; nh&#7853;n m&#7897;t hay nhi&#7873;u ch&#7881; th&#7883; li</FONT>&ecirc;n ti&#7871;p v&agrave; sau <FONT FACE="Times New Roman">&#273;ó t&#7921; nó th&#7921;c hi&#7879;n không c&#7847;n s&#7921; tr&#7907; giúp c&#7911;a h&#7879; &#273;i&#7873;u h</FONT>&agrave;nh. Trong khi l&#7879;nh th&#7921;c hi&#7879;n. C&oacute; hai tr&#432;&#7901;ng h&#7907;p x&#7843;y ra : M&#7897;t l&agrave; device drivers ph&#7843;i ch&#7901; cho t&#7899;i khi b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n th&#7921;c hi&#7879;n xong b&#7857;ng cách t&#7921; khóa l&#7841;i cho t&#7899;i khi m&#7897;t ng&#7855;t phát </FONT>sinh m&#7903; kh&oacute;a cho n&oacute;. Hai l&agrave;, h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ch&#7845;m d&#7913;t m&agrave; kh&ocirc;ng ch&#7901;, v&igrave; v&#7853;y driver kh&ocirc;ng c&#7847;n thi&#7871;t ph&#7843;i kh&oacute;a.</P>
<P>Sau khi h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh ho&agrave;n t&#7845;t vi&#7879;c ki&#7875;m tra l&#7895;i v&agrave; n&#7871;u m&#7885;i th&#7913; <FONT FACE="Times New Roman">&#273;&#7873;u &#7893;n driver s&#7869; chuy&#7875;n d&#7919; li&#7879;u cho ph&#7847;n m&#7873;m &#273;&#7897;c l&#7853;p thi&#7871;t b&#7883;. Cu&#7889;i c</FONT>&ugrave;ng n&oacute; s&#7869; tr&#7843; v&#7873; th&ocirc;ng tin v&#7873; tr&#7841;ng th&aacute;i hay l&#7895;i cho n&#417;i g&#7885;i v&agrave; n&#7871;u c&oacute; m&#7897;t y&ecirc;u c&#7847;u kh&aacute;c &#7903; h&agrave;ng <FONT FACE="Times New Roman">&#273;&#7907;i, nó s&#7869; th&#7921;c hi&#7879;n ti&#7871;p, n&#7871;u không nó s&#7869; khóa l&#7841;i ch&#7901; &#273;&#7871;n y</FONT>&ecirc;u c&#7847;u ti&#7871;p theo.</P>
</blockquote>

<FONT SIZE=4><STRONG><P class="cap2"><a name="dltb"><img border="0" src="images/read_single.gif" width="15" height="12">
III.3 Ph&#7847;n m&#7873;m nh&#7853;p/xu&#7845;t </a></STRONG> </FONT><STRONG><a name="dltb"><FONT FACE="Times New Roman" SIZE=4>&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883;</FONT></a></STRONG> </P>
<blockquote>

<P>M&#7863;c d&ugrave; m&#7897;t s&#7889; ph&#7847;n m&#7873;m nh&#7853;p/xu&#7845;t m&ocirc; t&#7843; thi&#7871;t b&#7883; nh&#432;ng ph&#7847;n l&#7899;n ch&uacute;ng l&agrave; <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p v&#7899;i thi&#7871;t b&#7883;. Ranh gi&#7899;i chính xác gi&#7919;a drivers v</FONT>&agrave; ph&#7847;n m&#7873;m <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883; l</FONT>&agrave; <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p v&#7873; m&#7863;t h&#7879; th&#7889;ng, b&#7903;i v</FONT>&igrave; m&#7897;t s&#7889; h&agrave;m m&agrave; <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c thi h&agrave;nh theo ki&#7875;u <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883; có th&#7875; &#273;</FONT>&#432;&#7907;c thi h&agrave;nh tr&ecirc;n drivers v&igrave; l&yacute; do hi&#7879;u qu&#7843; hay nh&#7919;ng l&yacute; d&oacute; kh&aacute;c n&agrave;o <FONT FACE="Times New Roman">&#273;ó.</P></blockquote>
</FONT>
<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 BORDERCOLOR="#7f7f7f" CELLPADDING=7 WIDTH=283>
<TR><TD VALIGN="TOP">
<P>Giao ti&#7871;p <FONT FACE="Times New Roman">&#273;&#7891;ng nh&#7845;t cho device drivers</FONT></TD>
</TR>
<TR><TD VALIGN="TOP">
<FONT FACE="Times New Roman"><P>&#272;&#7863;t t</FONT>&ecirc;n thi&#7871;t b&#7883;</TD>
</TR>
<TR><TD VALIGN="TOP">
<P>B&#7843;o v&#7879; thi&#7871;t b&#7883;</TD>
</TR>
<TR><TD VALIGN="TOP">
<P>Cung c&#7845;p kh&#7889;i <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883;</FONT></TD>
</TR>
<TR><TD VALIGN="TOP">
<P>T&#7893; ch&#7913;c buffer</TD>
</TR>
<TR><TD VALIGN="TOP">
<FONT FACE="Times New Roman"><P>&#272;&#7883;nh v&#7883; l</FONT>&#432;u tr&#7919; tr&ecirc;n thi&#7871;t b&#7883; kh&#7889;i</TD>
</TR>
<TR><TD VALIGN="TOP">
<P>C&#7845;p ph&aacute;t v&agrave; gi&#7843;i ph&oacute;ng thi&#7871;t b&#7883; t&#7853;n hi&#7871;n</TD>
</TR>
<TR><TD VALIGN="TOP">
<P>B&aacute;o l&#7895;i</TD>
</TR>
</TABLE>
</CENTER>
<blockquote>

<P>Ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c</FONT>&#417; b&#7843;n c&#7911;a ph&#7847;n m&#7873;m nh&#7853;p/xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883; l</FONT>&agrave; nh&#7919;ng ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng chung cho t&#7845;t c&#7843; các thi&#7871;t b&#7883; v</FONT>&agrave; cung c&#7845;p m&#7897;t giao ti&#7871;p <FONT FACE="Times New Roman">&#273;&#7891;ng nh&#7845;t cho ph&#7847;n m&#7873;m ph&#7841;m vi ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng.</P>
<P>Tr&#432;&#7899;c ti&ecirc;n n&oacute; ph&#7843;i c&oacute; ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng t&#7841;o m&#7897;t ánh x&#7841; gi&#7919;a thi&#7871;t b&#7883; v</FONT>&agrave; m&#7897;t t&ecirc;n h&igrave;nh th&#7913;c. V&iacute; d&#7909; <FONT FACE="Times New Roman">&#273;&#7889;i v&#7899;i UNI</FONT>X, t&ecirc;n /dev/tty0 d&agrave;nh ri&ecirc;ng <FONT FACE="Times New Roman">&#273;&#7875; mô t&#7843; I-node cho m&#7897;t file &#273;&#7863;c bi&#7879;t, v</FONT>&agrave; I-node n&agrave;y ch&#7913;a ch&#7913;a s&#7889; thi&#7871;t b&#7883; ch&iacute;nh, <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7875; xác &#273;&#7883;nh driver thích h&#7907;p v</FONT>&agrave; s&#7889; thi&#7871;t b&#7883; ph&#7909;, <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7875; xác &#273;&#7883;nh các tham s&#7889; cho driver &#273;&#7875; cho bi&#7871;t l</FONT>&agrave; <FONT FACE="Times New Roman">&#273;&#7885;c hay ghi.</P>
</FONT><P>Th&#7913; hai l&agrave; b&#7843;o v&#7879; thi&#7871;t b&#7883;, l&agrave; cho ph&eacute;p hay kh&ocirc;ng cho ph&eacute;p ng&#432;&#7901;i s&#7917; d&#7909;ng truy xu&#7845;t thi&#7871;t b&#7883;. C&aacute;c h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh c&oacute; th&#7875; c&oacute; hay kh&ocirc;ng c&oacute; ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng n</FONT>&agrave;y.</P>
<P>Th&#7913; ba l&agrave; cung c&#7845;p kh&#7889;i d&#7919; li&#7879;u <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883; v</FONT>&igrave; v&iacute; d&#7909; nh&#7919;ng <FONT FACE="Times New Roman">&#273;&#297;a khác nhau s&#7869; có kích th</FONT>&#432;&#7899;c sector kh&aacute;c nhau v&agrave; <FONT FACE="Times New Roman">&#273;i&#7873;u n</FONT>&agrave;y s&#7869; g&acirc;y kh&oacute; kh<FONT FACE="Times New Roman">&#259;n cho các ph&#7847;n m&#7873;m ng</FONT>&#432;&#7901;i s&#7917; d&#7909;ng &#7903; l&#7899;p tr&ecirc;n. Ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng n</FONT>&agrave;y cung c&#7845;p c&aacute;c kh&#7889;i d&#7919; li&#7879;u logic <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p v&#7899;i kích th</FONT>&#432;&#7899;c sector v&#7853;t l&yacute;.</P>
<P>Th&#7913; t&#432; l&agrave; cung c&#7845;p buffer <FONT FACE="Times New Roman">&#273;&#7875; h&#7895; tr&#7907; cho &#273;&#7891;ng b&#7897; hóa quá tr</FONT>&igrave;nh ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng c&#7911;a h&#7879; th&#7889;ng. Ví d&#7909; buffer </FONT>cho b&agrave;n ph&iacute;m.</P>
<P>Th&#7913; n<FONT FACE="Times New Roman">&#259;m l</FONT>&agrave; <FONT FACE="Times New Roman">&#273;&#7883;nh v&#7883; l</FONT>&#432;u tr&#7919; tr&ecirc;n c&aacute;c thi&#7871;t b&#7883; kh&#7889;i.</P>
<P>Th&#7913; s&aacute;u l&agrave; c&#7845;p ph&aacute;t v&agrave; gi&#7843;i ph&oacute;ng c&aacute;c thi&#7871;t b&#7883; t&#7853;n hi&#7871;n.</P>

<P>Cu&#7889;i c&ugrave;ng l&agrave; th&ocirc;ng b&aacute;o l&#7895;i cho l&#7899;p b&ecirc;n tr&ecirc;n t&#7915; c&aacute;c l&#7895;i do device driver b&aacute;o v&#7873;.</P></blockquote>

<FONT SIZE=4><STRONG><P class="cap2"><img border="0" src="images/read_single.gif" width="15" height="12">
<a name="nguoidung">III.4 Ph&#7847;n m&#7873;m nh&#7853;p/xu&#7845;t ph&#7841;m vi ng&#432;&#7901;i s&#7917; d&#7909;ng</a></STRONG> </FONT> </P><blockquote>

<P>H&#7847;u h&#7871;t c&aacute;c ph&#7847;n m&#7873;m nh&#7853;p/xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7873;u &#7903; b</FONT>&ecirc;n trong c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh v&agrave; m&#7897;t ph&#7847;n nh&#7887; c&#7911;a ch&uacute;ng ch&#7913;a c&aacute;c th&#432; vi&#7879;n li&ecirc;n k&#7871;t v&#7899;i ch&#432;&#417;ng tr&igrave;nh c&#7911;a ng&#432;&#7901;i s&#7917; d&#7909;ng ngay c&#7843; nh&#7919;ng ch&#432;&#417;ng tr&igrave;nh thi h&agrave;nh b&ecirc;n ngo&agrave;i h&#7841;t nh&acirc;n. </P>
<P>L&#7901;i g&#7885;i h&#7879; th&#7889;ng, bao g&#7891;m l&#7901;i g&#7885;i h&#7879; th&#7889;ng nh&#7853;p/xu&#7845;t th&#432;&#7901;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c th&#7921;c hi&#7879;n b&#7903;i c&aacute;c h&agrave;m th&#432; vi&#7879;n. V&iacute; d&#7909; khi trong ch&#432;&#417;ng tr&igrave;nh C c&oacute; l&#7879;nh </P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; count = write(fd, buffer, nbytes) ;</P>
<P>H&agrave;m th&#432; vi&#7879;n write <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c <FONT FACE="Times New Roman">&#273;&#7883;ch v</FONT>&agrave; li&ecirc;n k&#7871;t d&#432;&#7899;i d&#7841;ng nh&#7883; ph&acirc;n v&agrave; n&#7857;m trong b&#7897; nh&#7899; khi thi h&agrave;nh. T&#7853;p h&#7907;p t&#7845;t c&#7843; nh&#7919;ng h&agrave;m th&#432; vi&#7879;n n&agrave;y r&otilde; r&agrave;ng l&agrave; m&#7897;t ph&#7847;n c&#7911;a h&#7879; th&#7889;ng nh&#7853;p/xu&#7845;t. </P>

<P>Kh&ocirc;ng ph&#7843;i t&#7845;t c&#7843; c&aacute;c ph&#7847;n m&#7873;m nh&#7853;p/xu&#7845;t <FONT FACE="Times New Roman">&#273;&#7873;u ch&#7913;a h</FONT>&agrave;m th&#432; vi&#7879;n, c&oacute; m&#7897;t lo&#7841;i quan tr&#7885;ng kh&aacute;c&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; g&#7885;i l&agrave; h&#7879; th&#7889;ng spooling d&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7875; khai thác t&#7889;i &#273;a thi&#7871;t b&#7883; nh&#7853;p/xu&#7845;t trong h&#7879; th&#7889;ng &#273;a ch</FONT>&#432;&#417;ng.</P>

<P>&nbsp;&nbsp;&nbsp; C&aacute;c h&agrave;m th&#432; vi&#7879;n chuy&#7875;n c&aacute;c tham s&#7889; th&iacute;ch h&#7907;p cho l&#7901;i g&#7885;i h&#7879; th&#7889;ng v&agrave; h&agrave;m th&#432; vi&#7879;n th&#7921;c hi&#7879;n vi&#7879;c <FONT FACE="Times New Roman">&#273;&#7883;nh d&#7841;ng cho nh&#7853;p v</FONT>&agrave; xu&#7845;t nh&#432; l&#7879;nh printf trong C. Th&#432; vi&#7879;n nh&#7853;p/xu&#7845;t chu&#7849;n ch&#7913;a m&#7897;t s&#7889; h&agrave;m c&oacute; ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng nh&#7853;p/xu&#7845;t v</FONT>&agrave; t&#7845;t c&#7843; ch&#7841;y nh&#432; ch&#432;&#417;ng tr&igrave;nh ng&#432;&#7901;i d&ugrave;ng.</P>
<P>&nbsp;&nbsp;&nbsp; Ch&#7913;c n<FONT FACE="Times New Roman">&#259;ng c&#7911;a spooling l</FONT>&agrave; tr&aacute;nh tr&#432;&#7901;ng h&#7907;p m&#7897;t ti&#7871;n tr&igrave;nh <FONT FACE="Times New Roman">&#273;ang truy xu&#7845;t thi&#7871;t b&#7883;, chi&#7871;m gi&#7919; thi&#7871;t b&#7883; nh</FONT>&#432;ng sau <FONT FACE="Times New Roman">&#273;ó không l</FONT>&agrave;m g&igrave; c&#7843; trong m&#7897;t kho&#7843;ng th&#7901;i gian v&agrave; nh&#432; v&#7853;y c&aacute;c ti&#7871;n tr&igrave;nh kh&aacute;c b&#7883; &#7843;nh h&#432;&#7903;ng v&igrave; kh&ocirc;ng th&#7875; truy xu&#7845;t thi&#7871;t b&#7883; <FONT FACE="Times New Roman">&#273;ó. M&#7897;t ví d&#7909; c&#7911;a spooling device l</FONT>&agrave; line printer. Spooling c&ograve;n <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c s&#7917; d&#7909;ng trong h&#7879; th&#7889;ng m&#7841;ng nh&#432; h&#7879; th&#7889;ng e-mail ch&#7859;ng h&#7841;n.</P>
<P>&nbsp;</P>
<STRONG></blockquote>

<P ALIGN="JUSTIFY" class="cap1"><a name="tomtat">IV. T&Oacute;M T&#7854;T</a></P>
</STRONG>
<blockquote>

<P>&nbsp;&nbsp;&nbsp; I/O l&agrave; m&#7897;t ph&#7847;n quan tr&#7885;ng v&agrave; kh&ocirc;ng th&#7875; thi&#7871;u <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh, nh&#432;ng th&#432;&#7901;ng kh&ocirc;ng <FONT FACE="Times New Roman">&#273;</FONT>&#432;&#7907;c quan t&acirc;m <FONT FACE="Times New Roman">&#273;úng m&#7913;c. Trong b</FONT>&agrave;i n&agrave;y, ch&uacute;ng ta <FONT FACE="Times New Roman">&#273;</FONT>&atilde; kh&#7843;o s&aacute;t ph&#7847;n c&#7913;ng I/O, m&#7889;i li&ecirc;n h&#7879; gi&#7919;a thi&#7871;t b&#7883; I/O v&#7899;i b&#7897; ki&#7875;m so&aacute;t thi&#7871;t b&#7883;. Sau <FONT FACE="Times New Roman">&#273;ó chúng ta kh&#7843;o sát b&#7889;n c&#7845;p c&#7911;a ph&#7847;n m&#7873;m I/O : th&#7911; t&#7909;c ng&#7855;t, &#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883;, ph&#7847;n m&#7873;m &#273;&#7897;c l&#7853;p thi&#7871;t b&#7883; v</FONT>&agrave; nh&#7919;ng th&#432; vi&#7879;n I/O trong m&ocirc;i tr&#432;&#7901;ng ng&#432;&#7901;i d&ugrave;ng. <FONT FACE="Times New Roman">&#272;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; qu&#7843;n lý t&#7845;t c&#7843; nh&#7919;ng mô t&#7843; chi ti&#7871;t c&#7911;a m&#7897;t ho&#7863;c nhi&#7875;u thi&#7871;t b&#7883;. Ph&#7847;n m&#7873;m &#273;&#7897;c l&#7853;p thi&#7871;t b&#7883; xây d&#7921;ng các v</FONT>&ugrave;ng <FONT FACE="Times New Roman">&#273;&#7879;m v</FONT>&agrave; <FONT FACE="Times New Roman">&#273;&#7883;nh v&#7883;, &#273;ây l</FONT>&agrave; nh&#7919;ng vi&#7879;c chung cho nhi&#7873;u thi&#7871;t b&#7883;.</P></blockquote>
<STRONG><P ALIGN="JUSTIFY"><font size="4" color="#FF0000"><img border="0" src="images/blebul1a.gif" width="20" height="20">
<a name="cauhoi">C&acirc;u h&#7887;i ki&#7875;m tra ki&#7871;n th&#7913;c</a></font></P></STRONG>
<blockquote>
  <P>1. T&#7893; ch&#7913;c c&#7911;a h&#7879; th&#7889;ng qu&#7843;n l&yacute; I/O nh&#432; th&#7871; n&agrave;o ?</P>
<P>2. C&oacute; bao nhi&ecirc;u lo&#7841;i thi&#7871;t b&#7883; I/O ? V&#7899;i m&#7895;i lo&#7841;i cho v&iacute; d&#7909; c&#7909; th&#7875;.</P>
<P>3. Vai tr&ograve; c&#7911;a b&#7897; <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; l</FONT>&agrave; g&igrave; ?</P>
<P>4. C&#417; ch&#7871; ho&#7841;t <FONT FACE="Times New Roman">&#273;&#7897;ng DMA nh</FONT>&#432; th&#7871; n&agrave;o ?</P>
<P>5. C&oacute; th&#7875; th&#7921;c hi&#7879;n I/O m&agrave; kh&ocirc;ng s&#7917; d&#7909;ng <FONT FACE="Times New Roman">&#273;i&#7873;u khi&#7875;n thi&#7871;t b&#7883; không?&nbsp; T&#7841;i sao?</P>
</FONT><P>6. N&ecirc;u vai tr&ograve; c&#7911;a ph&#7847;n m&#7873;m <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883;.

</FONT></P><STRONG>
  </blockquote>
  <P ALIGN="JUSTIFY"><font size="4" color="#FF0000"><img border="0" src="images/blebul1a.gif" width="20" height="20">
  <a name="baitap">C&acirc;u h&#7887;i tr&#7855;c nghi&#7879;m</a></font></P></STRONG><B><EM><P><img border="0" src="images/help.gif" width="16" height="16">
1. H&#7879; th&#7889;ng qu&#7843;n l&yacute; I/O c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh l&agrave; :</P>
</EM>
</B>
<blockquote>
  <P>a. M&#7897;t c&#417; ch&#7871; tr&ecirc;n m&#7885;i thi&#7871;t b&#7883; tin h&#7885;c &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; c. B&agrave;n ph&iacute;m</P>
<P>b. M&#7897;t ph&#7847;n c&#7911;a h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;d. M&aacute;y in</P>
</blockquote>
<B><EM><P><img border="0" src="images/help.gif" width="16" height="16"> 2. H&#7879; th&#7889;ng qu&#7843;n l&yacute; I/O c&#7911;a m&#7897;t h&#7879; <FONT FACE="Times New Roman">&#273;i&#7873;u h</FONT>&agrave;nh bao g&#7891;m :</P>
</B></EM>
<blockquote>
  <P>a. Ph&#7847;n c&#7913;ng I/O v&agrave; ph&#7847;n m&#7873;m I/O &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;c. Ki&#7875;m so&aacute;t ng&#7855;t</P>
<P>b. DMA &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;d. a, b, c <FONT FACE="Times New Roman">&#273;&#7873;u sai.</P>
  </blockquote>
</FONT><B><EM><P><img border="0" src="images/help.gif" width="16" height="16"> 3. DMA l&agrave; vi&#7871;t t&#7855;t c&#7911;a :</P>
</B></EM>
<blockquote>
  <P>a. Direct Management Access &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;c. Direct Memory Access</P>
<P>b. Direct Memory Application &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; d. Direct Mainboard Access</P>
</blockquote>
<B><EM><P><img border="0" src="images/help.gif" width="16" height="16"> 4. Ph&#7847;n m&#7873;m <FONT FACE="Times New Roman">&#273;&#7897;c l&#7853;p thi&#7871;t b&#7883; :</P>
</B></FONT></EM>
<blockquote>
  <P>a. Do Microsoft vi&#7871;t ra &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;c. L&agrave; m&#7897;t ph&#7847;n c&#7911;a h&#7879; th&#7889;ng qu&#7843;n l&yacute; I/O</P>
<P>b. L&agrave; m&#7897;t ph&#7847;n c&#7911;a tr&igrave;nh bi&ecirc;n d&#7883;ch &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
d. a, b, c <FONT FACE="Times New Roman">&#273;&#7873;u sai.</FONT>
  </P>
</blockquote>
  </BODY>
</HTML>
